{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              21
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        21,
        64
      ],
      "dtype": "float32",
      "data": [
        0.42614075541496277,
        0.3049522638320923,
        0.1394110769033432,
        0.195161834359169,
        0.1079232469201088,
        0.18719786405563354,
        0.5077130794525146,
        0.058707095682621,
        0.09490250796079636,
        0.4981403648853302,
        0.07645314186811447,
        0.03907031938433647,
        -0.06508991122245789,
        0.6046062707901001,
        0.07716267555952072,
        -0.1577765941619873,
        0.20692178606987,
        -0.39054301381111145,
        -0.09282901138067245,
        -0.3872849643230438,
        -0.27272117137908936,
        0.14234685897827148,
        -0.4370633661746979,
        -0.4753020405769348,
        -0.04247992858290672,
        0.012403104454278946,
        -0.23472189903259277,
        0.2569299340248108,
        -0.45975831151008606,
        -0.26189884543418884,
        -0.1664220243692398,
        -0.11923927068710327,
        -0.4868178963661194,
        -0.2427448183298111,
        0.24434806406497955,
        -0.6047649383544922,
        0.5839226841926575,
        -0.3460584878921509,
        0.1722366064786911,
        0.02923426777124405,
        0.11013893038034439,
        0.05399772524833679,
        0.06361248344182968,
        0.00043258341611362994,
        0.4670518636703491,
        -0.05430405214428902,
        -0.1633758246898651,
        -0.06121981889009476,
        0.19216687977313995,
        -0.24600990116596222,
        0.30050647258758545,
        0.04182397574186325,
        0.059315942227840424,
        -0.14509126543998718,
        -0.00732277799397707,
        -0.1737683117389679,
        -0.15963226556777954,
        0.1750299334526062,
        -0.3440929055213928,
        -0.20933030545711517,
        -0.13803310692310333,
        -0.1732545793056488,
        0.4244711399078369,
        0.4358769357204437,
        0.4307858645915985,
        -0.13821862637996674,
        -0.32350414991378784,
        -0.018786221742630005,
        -0.3424951434135437,
        0.2445821613073349,
        -0.2394436150789261,
        0.17870868742465973,
        0.022089488804340363,
        -0.5348883867263794,
        0.26364442706108093,
        -0.026716288179159164,
        0.1324121654033661,
        0.19629919528961182,
        -0.19464758038520813,
        -0.32324451208114624,
        0.11014430969953537,
        0.2977938950061798,
        0.41452980041503906,
        -0.14574776589870453,
        -0.4087538719177246,
        -0.11697275936603546,
        -0.23604771494865417,
        -0.2599990963935852,
        -0.28986191749572754,
        -0.2901838421821594,
        0.46469759941101074,
        0.4307219088077545,
        0.2437620460987091,
        -0.22922955453395844,
        0.08087911456823349,
        0.1671467125415802,
        -0.5033191442489624,
        -0.05071223899722099,
        -0.6021093726158142,
        0.3589772880077362,
        0.17098474502563477,
        -0.3087318241596222,
        -0.15330927073955536,
        -0.22151987254619598,
        0.1496594250202179,
        0.006895977072417736,
        -0.31777364015579224,
        -0.13114982843399048,
        0.02591300942003727,
        -0.1783115565776825,
        0.4445013999938965,
        0.18548104166984558,
        0.007586056366562843,
        0.3853367269039154,
        -0.3137684762477875,
        0.2900901138782501,
        -0.3210570216178894,
        -0.5079103708267212,
        -0.16475869715213776,
        -0.13376100361347198,
        0.4109680652618408,
        0.09771542251110077,
        -0.1377352625131607,
        0.1620974987745285,
        0.23725806176662445,
        -0.5412197709083557,
        0.13000181317329407,
        -0.2650291621685028,
        0.28725457191467285,
        -0.31256401538848877,
        -0.21933071315288544,
        -0.03502511605620384,
        0.043902426958084106,
        -0.33956390619277954,
        0.11773937195539474,
        -0.5459155440330505,
        -0.5167070627212524,
        -0.34630638360977173,
        0.1305905282497406,
        0.46195152401924133,
        0.24690887331962585,
        -0.385017067193985,
        0.09455575048923492,
        -0.2397359311580658,
        -0.1729157418012619,
        0.04688984900712967,
        -0.3466755449771881,
        -0.008574213832616806,
        -0.12243898957967758,
        0.32986411452293396,
        -0.6067192554473877,
        -0.28978583216667175,
        -0.2581101059913635,
        -0.2754769027233124,
        0.26956653594970703,
        0.027402225881814957,
        -0.4627912640571594,
        0.29181423783302307,
        0.175818532705307,
        0.22232216596603394,
        0.3548779785633087,
        0.26137828826904297,
        -0.2300243079662323,
        -0.211435005068779,
        0.10757678747177124,
        0.03468921780586243,
        -0.1598970592021942,
        -0.3659624457359314,
        0.12187929451465607,
        0.31788232922554016,
        0.1565977782011032,
        0.05432725325226784,
        -0.08713364601135254,
        0.19377784430980682,
        -0.6011908054351807,
        -0.5402247309684753,
        -0.23552288115024567,
        -0.15917982161045074,
        -0.19028861820697784,
        0.049743540585041046,
        0.05346289277076721,
        -0.04276765510439873,
        -0.08246394991874695,
        -0.07038769870996475,
        -0.15730907022953033,
        -0.07180559635162354,
        -0.3575531840324402,
        0.20322050154209137,
        0.12481851130723953,
        -0.12584176659584045,
        0.5110635161399841,
        -0.22425173223018646,
        0.3077283203601837,
        -0.09576651453971863,
        0.03780651465058327,
        -0.10749794542789459,
        0.2040264904499054,
        -0.15846113860607147,
        0.226545050740242,
        0.4447961151599884,
        -0.3040520250797272,
        -0.5869987607002258,
        -0.12747599184513092,
        0.32767125964164734,
        -0.44888144731521606,
        0.2210170179605484,
        -0.2593050003051758,
        0.15833699703216553,
        -0.3165082335472107,
        -0.07145215570926666,
        -0.19796453416347504,
        -0.4387297034263611,
        -0.4495256543159485,
        -0.053274087607860565,
        -0.33073440194129944,
        0.13446424901485443,
        -0.2757682800292969,
        -0.34025850892066956,
        0.18207408487796783,
        -0.08677475899457932,
        -0.2745746672153473,
        -0.03847332298755646,
        -0.024460410699248314,
        -0.03568720445036888,
        0.0852125957608223,
        0.19917671382427216,
        -0.33737191557884216,
        -0.12146049737930298,
        0.1582230031490326,
        0.2560172379016876,
        0.1495608389377594,
        -0.372097373008728,
        0.05434337630867958,
        -0.13973963260650635,
        -0.08834144473075867,
        0.039799001067876816,
        0.19081194698810577,
        -0.07487661391496658,
        0.1693800836801529,
        -0.3066355288028717,
        0.14282108843326569,
        0.13746227324008942,
        0.11515123397111893,
        0.06836627423763275,
        0.0034026317298412323,
        0.5198179483413696,
        0.08971024304628372,
        0.4576282203197479,
        0.14544235169887543,
        -0.02217985689640045,
        -0.06077539175748825,
        -0.012931657955050468,
        -0.16284935176372528,
        0.0346171036362648,
        0.09694336354732513,
        -0.054024480283260345,
        0.05061909556388855,
        -0.39954277873039246,
        -0.2844157814979553,
        -0.3731040954589844,
        0.20371079444885254,
        -0.168726846575737,
        0.08674909174442291,
        -0.022091912105679512,
        -0.08992968499660492,
        -0.3780158758163452,
        0.09021424502134323,
        0.5291444659233093,
        0.2127958983182907,
        0.14937032759189606,
        -0.3357137441635132,
        -0.0056234304793179035,
        -0.5739321112632751,
        -0.10910464078187943,
        -0.217870831489563,
        0.28469279408454895,
        -0.07647311687469482,
        -0.20412474870681763,
        0.29048699140548706,
        0.15723265707492828,
        0.0038011108990758657,
        0.11358807981014252,
        0.1658812314271927,
        0.359142541885376,
        0.14744214713573456,
        0.17273445427417755,
        0.21709470450878143,
        -0.10352074354887009,
        0.07234150916337967,
        0.011908013373613358,
        -0.09377176314592361,
        -0.16178877651691437,
        -0.1404077112674713,
        -0.5266956090927124,
        -0.15489985048770905,
        0.48422062397003174,
        -0.35389843583106995,
        0.07361042499542236,
        -0.22373315691947937,
        -0.5451985597610474,
        0.0325331948697567,
        0.023022010922431946,
        -0.20740431547164917,
        0.5041198134422302,
        -0.07060886174440384,
        -0.026898209005594254,
        0.28992384672164917,
        -0.18504054844379425,
        -0.24879881739616394,
        -0.5220433473587036,
        -0.07445451617240906,
        0.18833890557289124,
        0.32597342133522034,
        -0.5482604503631592,
        0.2669796049594879,
        -0.42502620816230774,
        0.21542923152446747,
        0.12324844300746918,
        0.16754162311553955,
        -0.2972903251647949,
        -0.3577023148536682,
        0.13178858160972595,
        0.12030869722366333,
        0.07772179692983627,
        0.38475897908210754,
        -0.010144075378775597,
        0.13389351963996887,
        -0.3568849563598633,
        -0.24943214654922485,
        -0.30165916681289673,
        -0.042338237166404724,
        -0.23800453543663025,
        -0.021130453795194626,
        0.08490131795406342,
        -0.25004443526268005,
        -0.42007556557655334,
        -0.3277134597301483,
        -0.19891631603240967,
        0.00824600737541914,
        -0.48685529828071594,
        -0.04885932430624962,
        -0.02271105907857418,
        -0.013210832141339779,
        0.2093225121498108,
        0.0690520852804184,
        0.2935870289802551,
        -0.0741773247718811,
        0.0012208587722852826,
        -0.08028865605592728,
        0.3528372347354889,
        -0.11215541511774063,
        0.4064849317073822,
        -0.16245777904987335,
        0.17235064506530762,
        0.022665755823254585,
        0.19856961071491241,
        0.16265250742435455,
        0.31213924288749695,
        0.0071344091556966305,
        -0.014262169599533081,
        -0.30191391706466675,
        0.02978791855275631,
        -0.11763453483581543,
        -0.49749118089675903,
        -0.3066675364971161,
        0.0019081099890172482,
        -0.2498367428779602,
        0.3614386320114136,
        -0.016850046813488007,
        -0.5014345049858093,
        -0.04840626195073128,
        -0.06277889013290405,
        0.34075596928596497,
        0.3717399537563324,
        -0.027670443058013916,
        0.3422587215900421,
        0.16826370358467102,
        0.2934502363204956,
        -0.08967678993940353,
        -0.2301563173532486,
        -0.2724066376686096,
        -0.2479173243045807,
        -0.15383797883987427,
        0.2666624188423157,
        -0.06947014480829239,
        -0.1249757707118988,
        0.10446126013994217,
        -0.17584455013275146,
        -0.1227278858423233,
        0.029859261587262154,
        -0.0949246808886528,
        0.15725837647914886,
        0.09756951034069061,
        -0.010809085331857204,
        -0.518827497959137,
        0.15803435444831848,
        0.034106966108083725,
        0.4445466101169586,
        0.21846327185630798,
        -0.21057865023612976,
        -0.15482966601848602,
        -0.25273364782333374,
        0.1994463950395584,
        -0.10154355317354202,
        -0.47111183404922485,
        -0.1513848900794983,
        -0.11211172491312027,
        -0.1725921928882599,
        0.34924355149269104,
        0.2776431739330292,
        0.18582355976104736,
        0.221175417304039,
        0.10572949051856995,
        0.14857855439186096,
        0.3198195695877075,
        -0.568001925945282,
        0.2539285123348236,
        -0.10004931688308716,
        0.29098060727119446,
        0.4063063859939575,
        -0.05401669442653656,
        0.15724782645702362,
        0.12314815819263458,
        0.10333239287137985,
        0.1252669095993042,
        0.09646438807249069,
        -0.23501095175743103,
        0.15946434438228607,
        0.34664344787597656,
        -0.34684520959854126,
        0.0016221371479332447,
        0.36953461170196533,
        0.26640012860298157,
        -0.266446590423584,
        -0.14848510921001434,
        0.324237585067749,
        0.17156408727169037,
        -0.2665833830833435,
        0.2607804238796234,
        -0.026592839509248734,
        0.548434317111969,
        -0.0554841049015522,
        0.060976751148700714,
        0.17191722989082336,
        -0.10079731047153473,
        0.2510029077529907,
        0.0709216296672821,
        -0.24307744204998016,
        0.3699100911617279,
        -0.060892265290021896,
        -0.18471702933311462,
        -0.12126053124666214,
        0.10899511724710464,
        -0.16754838824272156,
        -0.21490171551704407,
        -0.12249711900949478,
        0.3038617670536041,
        0.46198585629463196,
        0.10630717873573303,
        -0.22982224822044373,
        -0.04833786189556122,
        0.12305887043476105,
        0.14545495808124542,
        0.18994510173797607,
        -0.48940902948379517,
        0.0608782097697258,
        0.23566395044326782,
        -0.06820005178451538,
        0.10913518071174622,
        0.17737604677677155,
        -0.04082082211971283,
        -0.08091408759355545,
        0.041769158095121384,
        0.10103343427181244,
        -0.11346706748008728,
        -0.10806470364332199,
        -0.31273317337036133,
        0.25055956840515137,
        -0.33265888690948486,
        0.18230454623699188,
        -0.608775794506073,
        -0.40071848034858704,
        -0.4210231602191925,
        -0.1072343960404396,
        0.07339993864297867,
        0.5268453359603882,
        0.2739849388599396,
        -0.3371071517467499,
        0.4021800458431244,
        -0.40538063645362854,
        0.2776363492012024,
        0.11808846890926361,
        0.1758589744567871,
        -0.11271948367357254,
        0.2224421203136444,
        0.4873664677143097,
        0.131901815533638,
        0.056711405515670776,
        -0.43181729316711426,
        -0.02894439361989498,
        -0.4524401128292084,
        0.3279292583465576,
        -0.41876935958862305,
        0.4401867389678955,
        -0.15954461693763733,
        -0.33377671241760254,
        0.28555887937545776,
        -0.14886939525604248,
        0.019761642441153526,
        0.3596265912055969,
        0.3781684935092926,
        0.5940450429916382,
        0.1258830428123474,
        0.36398690938949585,
        -0.19208666682243347,
        -0.003557309042662382,
        -0.4718949794769287,
        0.02941795065999031,
        0.5896772146224976,
        0.5046409964561462,
        -0.21883653104305267,
        0.1957925409078598,
        -0.13986551761627197,
        -0.06358683109283447,
        0.051863547414541245,
        0.34920209646224976,
        0.3507196307182312,
        0.33170321583747864,
        0.43402695655822754,
        0.41712790727615356,
        0.12934744358062744,
        0.16636741161346436,
        0.1765175610780716,
        -0.4330067038536072,
        0.34792155027389526,
        0.5311465859413147,
        -0.018173523247241974,
        0.27305302023887634,
        -0.05972226709127426,
        0.268147349357605,
        -0.020073790103197098,
        -0.010031960904598236,
        -0.1897592395544052,
        0.33421340584754944,
        -0.018993763253092766,
        -0.2875925302505493,
        -0.1810559630393982,
        -0.23149487376213074,
        0.03823100030422211,
        0.0070645506493747234,
        -0.16412243247032166,
        0.21583044528961182,
        0.26230016350746155,
        -0.18405525386333466,
        -0.16342522203922272,
        0.26144397258758545,
        0.02261974662542343,
        -0.19537751376628876,
        -0.14858944714069366,
        0.021980883553624153,
        0.3308413624763489,
        -0.49979302287101746,
        -0.11416921764612198,
        -0.2331334948539734,
        0.13669180870056152,
        0.29537010192871094,
        0.3880589008331299,
        0.5519050359725952,
        -0.044217370450496674,
        -0.1818946748971939,
        0.3882231116294861,
        0.16512823104858398,
        0.5003830194473267,
        -0.4414573609828949,
        0.44434854388237,
        -0.252273291349411,
        0.21924945712089539,
        0.22989702224731445,
        0.11050370335578918,
        -0.1581937074661255,
        0.34904828667640686,
        -0.07846952974796295,
        -0.0521976463496685,
        -0.004917440004646778,
        -0.14428453147411346,
        0.4619702100753784,
        0.46288660168647766,
        -0.30343225598335266,
        0.049674466252326965,
        -0.03845012187957764,
        -0.2576240301132202,
        0.29480889439582825,
        0.08898618072271347,
        -0.15415355563163757,
        -0.29841893911361694,
        0.2884449064731598,
        -0.46271848678588867,
        -0.2856529951095581,
        0.3234083950519562,
        -0.1789187341928482,
        -0.23591794073581696,
        0.06478068232536316,
        0.15979981422424316,
        0.2298489362001419,
        0.21738533675670624,
        -0.0609741173684597,
        -0.17186659574508667,
        -0.11330953240394592,
        -0.3103136718273163,
        -0.291810005903244,
        -0.3304855227470398,
        -0.3053398132324219,
        0.06148826330900192,
        0.21578764915466309,
        -0.25692862272262573,
        -0.384308785200119,
        0.27156296372413635,
        0.36222147941589355,
        -0.10291510075330734,
        0.5740119814872742,
        -0.08636665344238281,
        0.08569620549678802,
        -0.2989102303981781,
        0.30234870314598083,
        0.1349489986896515,
        0.07252832502126694,
        0.22055324912071228,
        -0.1819879114627838,
        0.25226303935050964,
        -0.08165688812732697,
        -0.28882792592048645,
        0.29335716366767883,
        -0.007058587856590748,
        0.1772622913122177,
        -0.35424086451530457,
        -0.07347699999809265,
        -0.030871588736772537,
        0.22230865061283112,
        -0.3349910378456116,
        0.08880845457315445,
        0.19587171077728271,
        0.13580486178398132,
        -0.04244151711463928,
        0.08875533938407898,
        -0.10392872989177704,
        -0.11791439354419708,
        -0.1258639395236969,
        0.45542922616004944,
        -0.11930331587791443,
        -0.33054837584495544,
        -0.0007920495118014514,
        -0.2792607843875885,
        0.07562553137540817,
        -0.3223966956138611,
        0.27553078532218933,
        0.4532822370529175,
        -0.2931465208530426,
        -0.17847532033920288,
        -0.0031129554845392704,
        0.06808382272720337,
        -0.09269770979881287,
        0.3867442011833191,
        0.6061618328094482,
        0.4819086194038391,
        -0.18571703135967255,
        -0.6161682605743408,
        0.18822810053825378,
        -0.6131014823913574,
        0.06722398102283478,
        -0.37547820806503296,
        0.27994218468666077,
        -0.3987749516963959,
        -0.270389586687088,
        -0.19424273073673248,
        0.09052916616201401,
        -0.43568211793899536,
        -0.35175207257270813,
        0.20414362847805023,
        0.36786970496177673,
        -0.0634094774723053,
        0.46231895685195923,
        0.2721930146217346,
        -0.11416653543710709,
        -0.3857082724571228,
        -0.2101842612028122,
        -0.4888537526130676,
        -0.6140350699424744,
        -0.2410624921321869,
        -0.16316337883472443,
        0.09341553598642349,
        -0.41908279061317444,
        -0.09266790002584457,
        0.01042172685265541,
        -0.17277437448501587,
        -0.08407014608383179,
        0.09715384989976883,
        -0.0912071168422699,
        -0.0352458655834198,
        0.4549681842327118,
        0.40357112884521484,
        0.05334975942969322,
        0.029297498986124992,
        0.29203927516937256,
        -0.12781739234924316,
        0.20887845754623413,
        0.40051770210266113,
        0.035089991986751556,
        0.03690548613667488,
        0.2823699712753296,
        0.36444026231765747,
        0.24096858501434326,
        0.06741943955421448,
        0.014582451432943344,
        -0.06298350542783737,
        -0.5660878419876099,
        0.5310903787612915,
        -0.3605421483516693,
        0.39083099365234375,
        -0.4489143490791321,
        0.4242973327636719,
        0.26671409606933594,
        -0.3020345866680145,
        0.2592512369155884,
        -0.45513761043548584,
        0.17104609310626984,
        -0.04497542604804039,
        -0.007964503951370716,
        -0.3936630189418793,
        -0.3557015061378479,
        -0.21532489359378815,
        0.07226219028234482,
        0.14096015691757202,
        -0.20411238074302673,
        -0.010661812499165535,
        -0.4405542016029358,
        -0.05463556572794914,
        -0.4104042053222656,
        0.2971929907798767,
        0.1545078605413437,
        0.09936303645372391,
        0.4480139911174774,
        -0.029022295027971268,
        -0.18733105063438416,
        -0.08395975828170776,
        0.12219655513763428,
        0.03152528405189514,
        0.5363614559173584,
        0.04885575547814369,
        -0.11893028020858765,
        -0.278977632522583,
        -0.19376195967197418,
        -0.05535132437944412,
        0.38855797052383423,
        0.19347646832466125,
        -0.25846076011657715,
        0.17017555236816406,
        -0.5514318346977234,
        -0.06545642763376236,
        0.2107972502708435,
        0.22715336084365845,
        -0.6033085584640503,
        -0.3601144552230835,
        -0.185029074549675,
        0.16242475807666779,
        -0.14079076051712036,
        -0.013708745129406452,
        0.23585140705108643,
        -0.4031394124031067,
        0.19144047796726227,
        0.03848830237984657,
        0.4548770785331726,
        0.3024142384529114,
        0.3481513559818268,
        -0.04870527982711792,
        -0.40078550577163696,
        0.0983344092965126,
        -0.1705586165189743,
        -0.053588446229696274,
        0.15389584004878998,
        -0.036089565604925156,
        0.009277057833969593,
        0.310635507106781,
        -0.3583480417728424,
        0.043636493384838104,
        0.3499600887298584,
        -0.13360676169395447,
        -0.24700790643692017,
        -0.2340807467699051,
        0.20001475512981415,
        0.5634220838546753,
        0.28444188833236694,
        -0.5255218744277954,
        0.27981939911842346,
        -0.45311668515205383,
        0.0660952627658844,
        -0.3723756968975067,
        -0.12873589992523193,
        -0.024805990979075432,
        -0.166819766163826,
        -0.24331338703632355,
        -0.3578348159790039,
        0.3421238362789154,
        -0.13598959147930145,
        0.1142173632979393,
        -0.02957593835890293,
        -0.15837861597537994,
        0.23133216798305511,
        0.2558879852294922,
        0.4209356904029846,
        0.43542706966400146,
        -0.4006866216659546,
        0.4075471758842468,
        -0.17449182271957397,
        -0.4834440052509308,
        0.26272788643836975,
        0.33686336874961853,
        -0.2262902855873108,
        0.27254417538642883,
        -0.4310663044452667,
        -0.43574264645576477,
        0.00008504516154062003,
        -0.5538470149040222,
        -0.22525198757648468,
        -0.13785767555236816,
        -0.2842007279396057,
        -0.21170437335968018,
        -0.06614209711551666,
        0.038587767630815506,
        0.2388250231742859,
        0.09201286733150482,
        0.07372817397117615,
        0.5975821614265442,
        -0.01783001981675625,
        -0.2855346202850342,
        0.4722840189933777,
        -0.0923445075750351,
        0.1266767680644989,
        -0.1124018058180809,
        -0.2033989131450653,
        0.027347715571522713,
        0.0053617386147379875,
        -0.026974257081747055,
        0.15035077929496765,
        -0.08295660465955734,
        -0.46136951446533203,
        -0.08367379754781723,
        0.32867351174354553,
        0.2974874675273895,
        -0.4733419418334961,
        -0.01545949187129736,
        -0.43681037425994873,
        -0.19613538682460785,
        0.31394124031066895,
        0.43727779388427734,
        -0.14786478877067566,
        0.46789759397506714,
        0.4148963987827301,
        -0.16052460670471191,
        0.2673034071922302,
        -0.13226188719272614,
        -0.15544918179512024,
        0.43327128887176514,
        -0.4196430742740631,
        -0.1276179850101471,
        -0.4520218074321747,
        -0.17275547981262207,
        -0.091526098549366,
        0.18838758766651154,
        0.3827625811100006,
        -0.1807996928691864,
        -0.09871409833431244,
        -0.4758858382701874,
        0.44993117451667786,
        -0.07285141944885254,
        -0.24947482347488403,
        0.13293658196926117,
        -0.33606916666030884,
        -0.17903932929039001,
        -0.09520964324474335,
        0.1856631338596344,
        0.4399588704109192,
        -0.1849728226661682,
        0.29387009143829346,
        -0.359846830368042,
        -0.019354751333594322,
        0.3039659261703491,
        -0.19267180562019348,
        -0.09300296753644943,
        -0.12306420505046844,
        -0.04851348325610161,
        -0.2147485762834549,
        0.36612117290496826,
        0.21148143708705902,
        0.11444118618965149,
        -0.589772641658783,
        -0.08554358780384064,
        -0.42154350876808167,
        0.17302438616752625,
        -0.3237784504890442,
        0.17642931640148163,
        0.392717182636261,
        0.15700489282608032,
        0.3345297873020172,
        0.520676851272583,
        -0.35400155186653137,
        -0.5554641485214233,
        -0.5182003378868103,
        0.06430205702781677,
        -0.49084410071372986,
        0.011013831943273544,
        0.23419061303138733,
        -0.06010085716843605,
        -0.23624904453754425,
        0.14034205675125122,
        0.06412823498249054,
        -0.08882797509431839,
        -0.30584442615509033,
        -0.3719244599342346,
        -0.00048602771130390465,
        0.5731174349784851,
        -0.4252761900424957,
        -0.024323787540197372,
        0.34372371435165405,
        -0.40761709213256836,
        -0.23083023726940155,
        0.1796976774930954,
        -0.26247715950012207,
        0.46327754855155945,
        -0.3117632269859314,
        0.12258270382881165,
        -0.5714648365974426,
        0.4433613121509552,
        -0.08665553480386734,
        0.3410669267177582,
        0.35720598697662354,
        -0.2284010797739029,
        0.12827210128307343,
        0.008480796590447426,
        -0.13660714030265808,
        0.28096672892570496,
        0.1562073826789856,
        -0.047191228717565536,
        0.43222665786743164,
        -0.2737308442592621,
        -0.15470315515995026,
        0.05255104973912239,
        0.28571343421936035,
        0.019291715696454048,
        -0.037765949964523315,
        -0.211838036775589,
        -0.2750914692878723,
        -0.17502447962760925,
        0.40949928760528564,
        -0.2082584947347641,
        -0.2387162148952484,
        -0.17813605070114136,
        0.26536816358566284,
        -0.35056358575820923,
        -0.21519652009010315,
        -0.02055254392325878,
        0.4784321188926697,
        0.5149867534637451,
        -0.2738284170627594,
        -0.28511717915534973,
        -0.35457372665405273,
        -0.3235234022140503,
        0.3013492226600647,
        0.3100323975086212,
        -0.2559085488319397,
        0.0398627407848835,
        0.24143128097057343,
        -0.12245061993598938,
        -0.2753981947898865,
        0.025034742429852486,
        0.45591309666633606,
        0.4081955552101135,
        0.22239886224269867,
        -0.3337074816226959,
        0.45291420817375183,
        -0.44906720519065857,
        -0.024392221122980118,
        -0.05564331263303757,
        0.016473716124892235,
        -0.220988929271698,
        -0.0026679469738155603,
        -0.053431205451488495,
        -0.06973198801279068,
        0.09026951342821121,
        -0.17036040127277374,
        -0.2275858074426651,
        0.21010373532772064,
        -0.10834237188100815,
        -0.16581116616725922,
        -0.20626351237297058,
        0.2188609093427658,
        -0.3693157136440277,
        0.1270086169242859,
        -0.03787458688020706,
        -0.4166601002216339,
        -0.21485698223114014,
        0.3991680443286896,
        0.05731019005179405,
        -0.022402986884117126,
        -0.2404281198978424,
        0.026601526886224747,
        -0.034075118601322174,
        -0.5846367478370667,
        -0.3076729476451874,
        0.4852675199508667,
        0.08258526772260666,
        -0.19475795328617096,
        0.06667640060186386,
        0.08181764930486679,
        -0.014403024688363075,
        -0.319199800491333,
        -0.5981186628341675,
        -0.22335238754749298,
        0.2979496717453003,
        0.3827784061431885,
        -0.31410834193229675,
        -0.27285969257354736,
        -0.2227586954832077,
        -0.047664493322372437,
        0.2543469965457916,
        0.23680785298347473,
        -0.37005406618118286,
        -0.13971693813800812,
        0.11278287321329117,
        0.44513535499572754,
        0.032597292214632034,
        -0.1815389096736908,
        0.09585170447826385,
        0.43964704871177673,
        -0.19291386008262634,
        0.20153489708900452,
        -0.2621419429779053,
        -0.09154420346021652,
        -0.4768138825893402,
        0.06239516660571098,
        0.019228395074605942,
        -0.2855536937713623,
        0.37770313024520874,
        0.5953868627548218,
        0.17853261530399323,
        -0.5911707282066345,
        0.15538328886032104,
        0.004054572898894548,
        -0.05833374708890915,
        0.26394349336624146,
        0.019558120518922806,
        0.3771497309207916,
        -0.2792750298976898,
        0.02767259068787098,
        -0.08826182782649994,
        -0.06629075855016708,
        -0.13251030445098877,
        0.10806670784950256,
        0.28293120861053467,
        -0.11625681072473526,
        0.33059364557266235,
        -0.41574883460998535,
        0.4753588140010834,
        0.10721347481012344,
        0.038129325956106186,
        0.43102318048477173,
        0.5749176740646362,
        -0.30803370475769043,
        0.4005155861377716,
        -0.29308319091796875,
        -0.11205173283815384,
        -0.04370635002851486,
        -0.20723406970500946,
        0.03982008993625641,
        -0.12895677983760834,
        -0.07348062843084335,
        0.04459625482559204,
        0.4064939618110657,
        0.1415311098098755,
        -0.013483853079378605,
        0.505145251750946,
        0.40480178594589233,
        -0.1266220062971115,
        -0.26836854219436646,
        0.01573757641017437,
        -0.289286345243454,
        -0.21870511770248413,
        0.10357952862977982,
        -0.059159986674785614,
        0.09528179466724396,
        0.007863009348511696,
        -0.09069309383630753,
        -0.5175772309303284,
        -0.4229152500629425,
        -0.0908246785402298,
        0.3736247718334198,
        -0.3586200475692749,
        0.06744652986526489,
        -0.3579882085323334,
        -0.3356938064098358,
        -0.4672878384590149,
        -0.1252882182598114,
        0.02047807164490223,
        0.09277092665433884,
        -0.17113478481769562,
        0.2557980418205261,
        -0.03451943397521973,
        -0.3107672929763794,
        0.19283786416053772,
        -0.4040661156177521,
        0.4011126160621643,
        0.11491653323173523,
        -0.21422064304351807,
        0.22745852172374725,
        0.3806419372558594,
        -0.030768923461437225,
        -0.33354583382606506,
        0.11044558137655258,
        -0.03079044446349144,
        0.04452667012810707,
        0.30345264077186584,
        0.17986999452114105,
        0.4329018294811249,
        0.18200068175792694,
        0.019779665395617485,
        0.3502720594406128,
        -0.17518985271453857,
        -0.10199234634637833,
        -0.016521699726581573,
        0.10996249318122864,
        0.3074667751789093,
        -0.1381627917289734,
        0.413025438785553,
        -0.030449362471699715,
        -0.28780341148376465,
        0.5061362385749817,
        -0.11245319992303848,
        0.016230296343564987,
        -0.3737432658672333,
        0.015214460901916027,
        -0.4007066786289215,
        0.3100239038467407,
        -0.09650418162345886,
        -0.15936154127120972,
        0.05965043231844902,
        0.1200743317604065,
        -0.0898398831486702,
        0.026147250086069107,
        0.15445181727409363,
        -0.015572436153888702,
        0.4537983238697052,
        0.20891475677490234,
        0.006051749922335148,
        0.5181878805160522,
        0.1712336391210556,
        -0.5170762538909912,
        -0.1612589955329895,
        -0.12496677041053772,
        0.26322248578071594,
        -0.011326921172440052,
        -0.026910115033388138,
        -0.0343671478331089,
        -0.09142747521400452,
        -0.4028768837451935,
        -0.4817570149898529,
        0.22081756591796875,
        0.5445078611373901,
        0.23902255296707153,
        0.1435559242963791,
        -0.46720707416534424,
        -0.1804322749376297,
        0.21383635699748993,
        -0.566200852394104,
        0.3146338164806366,
        -0.1530807465314865,
        -0.5289707779884338,
        -0.2660502791404724,
        0.3069784343242645,
        0.42864906787872314,
        -0.1791170984506607,
        0.128585085272789,
        -0.009355717338621616,
        0.556756854057312,
        -0.2715514600276947,
        -0.14998432993888855,
        -0.1873607188463211,
        0.16609954833984375,
        -0.10358808934688568,
        -0.1058393344283104,
        0.05369951203465462,
        -0.3068867027759552,
        0.43937480449676514,
        -0.13405448198318481,
        0.5367361307144165,
        0.22593723237514496,
        0.12924711406230927,
        0.23766718804836273,
        0.2933982014656067,
        0.08111537992954254,
        0.0010105655528604984,
        -0.20561029016971588,
        0.32771098613739014,
        0.44660887122154236,
        -0.08823443204164505,
        0.051215048879384995,
        0.2029181271791458,
        0.12782850861549377,
        0.26415035128593445,
        -0.12693443894386292,
        -0.13243046402931213,
        0.33795490860939026,
        0.2680746018886566,
        -0.3385293781757355,
        0.17249193787574768,
        0.25367698073387146,
        0.02444124035537243,
        0.34780648350715637,
        0.03504328802227974,
        0.42323970794677734,
        0.09962048381567001,
        -0.1708996444940567,
        0.12518398463726044,
        0.22564435005187988,
        -0.1887020468711853,
        0.37873387336730957,
        0.19547313451766968,
        -0.3207347095012665,
        0.15060138702392578,
        0.0006041888846084476,
        -0.05678829923272133,
        0.07245435565710068,
        0.09167685359716415,
        0.03067556582391262,
        0.16632886230945587,
        0.34917402267456055,
        0.0941600501537323,
        -0.13768714666366577,
        0.04416797310113907,
        -0.19061309099197388,
        -0.5763934254646301,
        -0.3543839454650879,
        -0.5670494437217712,
        -0.06627430766820908,
        -0.38903263211250305,
        -0.18226930499076843,
        0.05788377299904823,
        0.21224337816238403,
        0.0928027555346489,
        0.06806401163339615,
        -0.2536783516407013,
        -0.3125617504119873,
        -0.5593065023422241,
        -0.052809007465839386,
        0.5332204103469849,
        0.2281702309846878,
        0.11214670538902283,
        -0.1905258595943451,
        0.15113726258277893,
        0.3629678785800934,
        0.028719110414385796,
        -0.08492965996265411,
        0.013793506659567356,
        0.31400418281555176,
        0.2934466004371643,
        0.2429969310760498,
        0.004083503503352404,
        -0.1737414300441742,
        0.1929689198732376,
        0.1986110359430313,
        -0.1803707629442215,
        0.00035336296423338354,
        -0.5070093870162964,
        -0.29658880829811096,
        0.202407568693161,
        -0.20302042365074158,
        -0.3658944070339203,
        -0.02972712740302086,
        0.30382850766181946,
        0.11817348003387451,
        -0.28221285343170166,
        0.046967826783657074,
        0.4843269884586334,
        0.06341544538736343,
        0.20443634688854218,
        -0.5312580466270447,
        -0.06687406450510025,
        0.09122123569250107,
        0.45319491624832153,
        0.35919758677482605,
        -0.6129290461540222,
        0.18251341581344604,
        -0.0769324004650116,
        -0.11433872580528259,
        0.21059399843215942,
        -0.004014588892459869,
        0.11123622953891754,
        0.11692693084478378,
        -0.12996315956115723,
        0.08076830208301544,
        0.17343448102474213,
        -0.13263404369354248,
        0.038374681025743484,
        0.05746222287416458,
        0.007568960078060627,
        0.46020814776420593,
        0.5431079268455505,
        0.13971708714962006,
        0.19773748517036438,
        0.0723109319806099,
        -0.15549129247665405,
        -0.14140236377716064,
        0.3667925298213959,
        0.25195151567459106,
        -0.2124897539615631,
        -0.07372128963470459,
        0.11573097854852676,
        -0.048173967748880386,
        -0.4419078826904297,
        0.20250649750232697,
        -0.3087535500526428,
        0.0967874750494957,
        0.5484257936477661,
        -0.07170996814966202,
        0.08249007165431976,
        -0.19236868619918823,
        0.46461230516433716,
        0.24515384435653687,
        -0.30455252528190613,
        0.3142898678779602,
        0.3968082070350647,
        0.16997461020946503,
        -0.30577608942985535,
        0.22178499400615692,
        0.13452056050300598,
        -0.06437499821186066,
        0.4593002498149872,
        -0.05522594600915909,
        -0.5167930722236633,
        -0.545861542224884,
        -0.5044732689857483,
        0.2549397647380829,
        -0.2392243593931198,
        0.27055877447128296,
        0.3185276389122009,
        -0.5858762264251709
      ]
    },
    {
      "name": "dense_Dense1/bias",
      "shape": [
        64
      ],
      "dtype": "float32",
      "data": [
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0
      ]
    },
    {
      "name": "dense_Dense2/kernel",
      "shape": [
        64,
        32
      ],
      "dtype": "float32",
      "data": [
        -0.018490590155124664,
        -0.24863773584365845,
        0.10557842999696732,
        -0.3062531650066376,
        -0.005685410462319851,
        -0.004881333559751511,
        0.13081760704517365,
        -0.16537833213806152,
        0.033671628683805466,
        0.05107376351952553,
        0.11537457257509232,
        0.02689662203192711,
        -0.0374382808804512,
        0.13405011594295502,
        0.12996380031108856,
        0.11949840188026428,
        0.04453089460730553,
        0.09019159525632858,
        -0.14203645288944244,
        0.09590049088001251,
        -0.12925763428211212,
        -0.08236487209796906,
        0.19390781223773956,
        -0.2930709421634674,
        0.1251731961965561,
        -0.03557601198554039,
        0.01630779169499874,
        0.09622978419065475,
        -0.0832587331533432,
        -0.13856631517410278,
        -0.22642990946769714,
        0.12740418314933777,
        0.24092060327529907,
        0.0886959582567215,
        0.08385152369737625,
        -0.024795930832624435,
        -0.234859898686409,
        0.216478630900383,
        0.0802234634757042,
        0.02980668470263481,
        0.0658908262848854,
        -0.15349282324314117,
        0.021512990817427635,
        -0.10584147274494171,
        -0.05535281449556351,
        0.001074872212484479,
        0.15017765760421753,
        0.21251130104064941,
        -0.11481728404760361,
        -0.08622190356254578,
        0.06882006675004959,
        -0.008405790664255619,
        0.09902797639369965,
        0.2141222059726715,
        -0.08209562301635742,
        -0.05521423742175102,
        -0.01151457242667675,
        -0.10383917391300201,
        -0.28320905566215515,
        0.3008003234863281,
        -0.09671512991189957,
        0.08714135736227036,
        -0.25877633690834045,
        0.35014045238494873,
        -0.03709294646978378,
        -0.12058580666780472,
        0.05718355253338814,
        -0.07521075755357742,
        -0.1596706211566925,
        -0.3130081295967102,
        0.22833992540836334,
        -0.15436547994613647,
        -0.14166176319122314,
        -0.07851949334144592,
        0.16329243779182434,
        -0.15262562036514282,
        0.10130170732736588,
        -0.06102455407381058,
        -0.18271209299564362,
        -0.21359911561012268,
        0.009544785134494305,
        -0.09366284310817719,
        0.14433692395687103,
        0.052201613783836365,
        -0.3290456533432007,
        0.21947979927062988,
        0.04693392291665077,
        0.20261457562446594,
        -0.18835334479808807,
        -0.21152502298355103,
        0.1282811015844345,
        0.15626879036426544,
        0.04215918108820915,
        0.14559948444366455,
        0.04035084322094917,
        -0.01185210607945919,
        0.13052202761173248,
        0.09403256326913834,
        -0.16990232467651367,
        -0.007906908169388771,
        0.11207931488752365,
        0.2679063081741333,
        -0.11888941377401352,
        -0.14552442729473114,
        -0.18441586196422577,
        0.18430034816265106,
        -0.06071349233388901,
        -0.14639697968959808,
        0.024520913138985634,
        0.06399410963058472,
        -0.07914887368679047,
        -0.3225143551826477,
        0.08646773546934128,
        0.06630674004554749,
        0.3278684914112091,
        -0.08700667321681976,
        0.0032444915268570185,
        -0.012082596309483051,
        0.2082228809595108,
        -0.026913104578852654,
        -0.02077397145330906,
        -0.14622820913791656,
        -0.19753533601760864,
        0.08329951018095016,
        0.03463016450405121,
        -0.22318650782108307,
        0.06086523458361626,
        -0.1887599229812622,
        -0.020140379667282104,
        -0.010502763092517853,
        -0.20156650245189667,
        -0.10920525342226028,
        -0.19519485533237457,
        -0.1256249099969864,
        0.04386492073535919,
        0.06293746829032898,
        0.17042602598667145,
        -0.06506074219942093,
        -0.23380279541015625,
        0.08341893553733826,
        0.3047998547554016,
        -0.19631929695606232,
        0.20227397978305817,
        -0.12478015571832657,
        -0.3244158625602722,
        -0.011882811784744263,
        -0.008942855522036552,
        0.060697078704833984,
        -0.3179033398628235,
        0.015469986945390701,
        -0.03258663788437843,
        0.1661817729473114,
        -0.12391643971204758,
        0.10184093564748764,
        -0.33845657110214233,
        0.09581351280212402,
        0.34748321771621704,
        -0.11180863529443741,
        -0.003552897833287716,
        -0.10047231614589691,
        0.10227248072624207,
        -0.2010248750448227,
        -0.17882895469665527,
        0.2609405517578125,
        -0.06389164179563522,
        -0.09109266102313995,
        0.12688899040222168,
        0.12871447205543518,
        -0.10127665847539902,
        0.05688013881444931,
        0.10188150405883789,
        -0.01876320131123066,
        -0.12545526027679443,
        0.17068538069725037,
        -0.3157166540622711,
        -0.08046244829893112,
        -0.24376115202903748,
        -0.09467801451683044,
        0.010670243762433529,
        0.09657507389783859,
        0.05360161140561104,
        -0.32596689462661743,
        -0.2447478473186493,
        -0.248681902885437,
        -0.06843336671590805,
        0.2004227191209793,
        -0.12056533247232437,
        -0.2226773202419281,
        -0.06269422918558121,
        -0.01941778138279915,
        0.21034906804561615,
        0.10429385304450989,
        0.013896760530769825,
        0.14929448068141937,
        0.11204050481319427,
        0.21647405624389648,
        0.2771896421909332,
        0.041959911584854126,
        0.026900123804807663,
        0.17841248214244843,
        -0.0911269336938858,
        -0.023609666153788567,
        -0.17661191523075104,
        -0.3118508458137512,
        -0.07926230877637863,
        0.0014622770249843597,
        0.017976921051740646,
        0.21398760378360748,
        0.18119440972805023,
        0.09426266700029373,
        -0.000033272292057517916,
        -0.28263670206069946,
        -0.1974564492702484,
        -0.062054120004177094,
        -0.011584844440221786,
        0.050732746720314026,
        0.09690547734498978,
        -0.20787030458450317,
        -0.036257050931453705,
        0.05368119105696678,
        -0.037182390689849854,
        -0.05455305427312851,
        0.037203311920166016,
        -0.20021285116672516,
        0.09255974739789963,
        -0.15668699145317078,
        0.2253359705209732,
        0.22468340396881104,
        -0.08909278362989426,
        -0.06226395443081856,
