{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel_1",
      "shape": [
        15,
        64
      ],
      "dtype": "float32",
      "data": [
        0.07248073071241379,
        0.6383774876594543,
        0.7731980681419373,
        -1.4378737211227417,
        -0.5904226899147034,
        -1.730131983757019,
        -0.04772571846842766,
        -0.476839154958725,
        0.07693063467741013,
        0.09490980207920074,
        0.04779559373855591,
        -0.6417399644851685,
        0.11717032641172409,
        0.019207071512937546,
        0.2907194197177887,
        0.21114252507686615,
        -0.3193342089653015,
        0.42724594473838806,
        0.5101767182350159,
        -2.4488489627838135,
        0.1994580775499344,
        -1.1235930919647217,
        -1.6512451171875,
        0.045868851244449615,
        0.21523137390613556,
        -0.19264739751815796,
        0.43017578125,
        -0.18966209888458252,
        -0.12695515155792236,
        -1.5730409622192383,
        -0.180607870221138,
        0.32701376080513,
        0.225916787981987,
        -1.139353632926941,
        -2.145383358001709,
        0.283812552690506,
        -0.4109073579311371,
        0.2630799114704132,
        -0.3242221474647522,
        0.14508454501628876,
        -0.20673814415931702,
        -1.2951180934906006,
        0.2853652536869049,
        0.5996885895729065,
        0.04613260552287102,
        0.0005938121466897428,
        0.3636247515678406,
        0.2791315019130707,
        1.1201461553573608,
        -1.391585111618042,
        1.024198055267334,
        0.7693081498146057,
        0.3462238907814026,
        -1.391778826713562,
        -2.0553956031799316,
        0.8088226914405823,
        1.0420832633972168,
        -0.36778581142425537,
        0.27583014965057373,
        0.07623160630464554,
        0.00867395754903555,
        -0.1990201622247696,
        0.28030288219451904,
        0.007299602031707764,
        0.21282385289669037,
        -0.03807784244418144,
        0.6200656294822693,
        -0.8437826633453369,
        -0.4914071261882782,
        -1.8016955852508545,
        0.706372082233429,
        -0.8198128342628479,
        -0.05764276534318924,
        0.5047521591186523,
        0.1685125082731247,
        -1.409714937210083,
        -0.22518421709537506,
        -0.10850405693054199,
        -1.1188079118728638,
        0.46934425830841064,
        0.34438854455947876,
        0.6670043468475342,
        0.04854298010468483,
        -2.1043124198913574,
        0.6006194353103638,
        0.46831458806991577,
        -1.5535510778427124,
        -0.11217532306909561,
        0.3339908719062805,
        -0.48726075887680054,
        1.1362594366073608,
        0.01949189230799675,
        -0.48565009236335754,
        -0.2243301123380661,
        -0.1455059051513672,
        0.14892995357513428,
        0.10635567456483841,
        -0.7612093687057495,
        -2.349836826324463,
        0.7067360877990723,
        0.4564032256603241,
        0.19740544259548187,
        0.5868686437606812,
        0.20932219922542572,
        -0.4464639723300934,
        -1.9954242706298828,
        -0.03325144574046135,
        0.589224100112915,
        -0.28942081332206726,
        0.16720698773860931,
        -0.09782370924949646,
        0.5094720721244812,
        -0.2134607434272766,
        -0.1557915210723877,
        0.5837810039520264,
        0.2985977828502655,
        0.05310795083642006,
        -1.8858174085617065,
        -2.201169967651367,
        0.3508789539337158,
        0.7054083347320557,
        -0.6004327535629272,
        0.2629854381084442,
        -0.07483407855033875,
        1.329214334487915,
        0.2118293195962906,
        -0.18990664184093475,
        0.19088852405548096,
        0.5021920204162598,
        -0.019125090911984444,
        0.15111541748046875,
        -0.6653069257736206,
        0.32348814606666565,
        -2.139601945877075,
        0.1569722443819046,
        -1.8593862056732178,
        -0.7067996859550476,
        -0.1448563039302826,
        -0.04895384982228279,
        -0.5653250217437744,
        0.09610907733440399,
        0.23207814991474152,
        -0.13423874974250793,
        0.24813507497310638,
        0.9277973771095276,
        0.21895550191402435,
        0.5878923535346985,
        -2.3056817054748535,
        0.0407818928360939,
        0.481953501701355,
        -0.41247227787971497,
        -0.12935030460357666,
        0.7718950510025024,
        -0.12273897230625153,
        0.5273687839508057,
        0.25844278931617737,
        0.10338296741247177,
        -1.160987138748169,
        -0.19684123992919922,
        0.21972085535526276,
        -0.9258974194526672,
        0.4652799367904663,
        -2.810839891433716,
        0.38481107354164124,
        0.3922625780105591,
        -0.12971509993076324,
        -0.0686192587018013,
        0.531769871711731,
        0.2665216326713562,
        -1.6537485122680664,
        0.161407932639122,
        0.5154776573181152,
        -0.4184499680995941,
        0.15505799651145935,
        0.17760975658893585,
        0.32140666246414185,
        0.1981782615184784,
        -0.10870786756277084,
        -0.3817565441131592,
        0.7738946080207825,
        0.4422961473464966,
        -0.7255058884620667,
        -2.2853758335113525,
        1.0333911180496216,
        0.05359663814306259,
        0.6299698352813721,
        0.4476984441280365,
        0.4368125796318054,
        0.8909391760826111,
        0.05984223634004593,
        -0.07943397760391235,
        0.19990749657154083,
        0.49841591715812683,
        -0.141508549451828,
        0.47450706362724304,
        -2.059326648712158,
        -0.2715386152267456,
        -3.380251407623291,
        0.41467005014419556,
        -0.8154268860816956,
        0.0588659793138504,
        -0.08219309151172638,
        0.04388532415032387,
        -1.8016393184661865,
        0.0865204855799675,
        0.41831621527671814,
        -0.014922878704965115,
        0.19311970472335815,
        0.22305558621883392,
        0.7783376574516296,
        0.28013941645622253,
        -2.856724500656128,
        0.13629046082496643,
        0.3867262899875641,
        -1.8193438053131104,
        -0.1337469220161438,
        0.9963414669036865,
        0.7084798216819763,
        0.09404490888118744,
        0.45135119557380676,
        0.10643799602985382,
        -2.570621967315674,
        0.08188848197460175,
        0.013681369833648205,
        -0.0865856483578682,
        0.15795251727104187,
        -2.510573148727417,
        0.1377483755350113,
        -0.480413556098938,
        0.5113810896873474,
        0.1618148684501648,
        0.06737417727708817,
        0.30498412251472473,
        -2.439622640609741,
        0.7258291840553284,
        0.4413670301437378,
        0.12561699748039246,
        -0.295335590839386,
        0.33334311842918396,
        -0.03331039100885391,
        0.35894355177879333,
        -0.44497156143188477,
        0.3233278691768646,
        -0.022324133664369583,
        0.2673276662826538,
        -0.8949617743492126,
        -3.2959132194519043,
        0.3405817449092865,
        0.2690698802471161,
        0.30804646015167236,
        0.40978795289993286,
        0.6071386337280273,
        0.15278632938861847,
        0.2916160225868225,
        -0.5548745393753052,
        0.3992048501968384,
        0.18903380632400513,
        -2.3353934288024902,
        -0.11530312150716782,
        -1.6466554403305054,
        -0.9999327063560486,
        -2.080343723297119,
        0.5580908060073853,
        -1.300628662109375,
        -0.6527591943740845,
        -0.4801841676235199,
        -0.08771850913763046,
        0.5848315954208374,
        -1.764878273010254,
        0.028691131621599197,
        -1.2403219938278198,
        0.39832350611686707,
        -0.16674268245697021,
        0.7726513147354126,
        0.21637015044689178,
        -3.786015272140503,
        0.10084863752126694,
        0.3520168960094452,
        -3.715463399887085,
        0.10837585479021072,
        0.405144065618515,
        0.0667111799120903,
        0.5268785357475281,
        -0.36450836062431335,
        0.39046016335487366,
        -1.3550060987472534,
        0.13473518192768097,
        0.468299001455307,
        0.3995719850063324,
        -0.5044142603874207,
        -3.6202375888824463,
        0.5448196530342102,
        -0.4195142984390259,
        -0.02787482738494873,
        0.26770275831222534,
        0.6729246973991394,
        -0.004644298460334539,
        -3.96389102935791,
        0.1544019728899002,
        0.7803146243095398,
        -0.27649548649787903,
        -0.100328728556633,
        -0.7518215775489807,
        0.1915052980184555,
        0.5656492114067078,
        -1.21502685546875,
        -0.4461602568626404,
        0.06847906112670898,
        -0.0791923999786377,
        0.3598909080028534,
        -3.9121665954589844,
        0.3212226927280426,
        0.7396602034568787,
        -0.7721154093742371,
        0.43405774235725403,
        0.4588364362716675,
        0.39317747950553894,
        0.47262120246887207,
        0.2770850956439972,
        0.393588662147522,
        0.48512503504753113,
        -0.15997622907161713,
        -3.1414601802825928,
        -0.6496707797050476,
        -0.7499197721481323,
        -0.17642579972743988,
        2.6517257690429688,
        0.2939695119857788,
        0.04558917135000229,
        3.088533639907837,
        -2.7462170124053955,
        -0.2851947844028473,
        -0.35462579131126404,
        -0.0902547836303711,
        1.2448782920837402,
        -0.8728482723236084,
        -0.157646045088768,
        -2.743666410446167,
        2.8253166675567627,
        -0.15807735919952393,
        -2.894094944000244,
        -0.6938667297363281,
        -0.15152700245380402,
        2.4536263942718506,
        -2.0262582302093506,
        -2.0890750885009766,
        -2.713275671005249,
        0.4121984839439392,
        -0.058405306190252304,
        0.3984057605266571,
        2.7883615493774414,
        0.8945513367652893,
        -1.6763343811035156,
        -1.8167065382003784,
        -0.09839469939470291,
        -0.9965868592262268,
        0.9525480270385742,
        2.770108461380005,
        3.1198134422302246,
        3.6011321544647217,
        1.9919310808181763,
        -0.10335171222686768,
        3.056086301803589,
        -2.430030345916748,
        -0.71966952085495,
        1.5341919660568237,
        -0.319019615650177,
        -0.8392881751060486,
        -1.173405408859253,
        -0.2839435040950775,
        1.6716632843017578,
        1.7673567533493042,
        -2.9113948345184326,
        -0.5290141701698303,
        -0.09903577715158463,
        -1.1226632595062256,
        -2.294163465499878,
        -1.2760838270187378,
        -1.264305591583252,
        -0.06635581701993942,
        -1.2065649032592773,
        -0.32952073216438293,
        -0.9953961372375488,
        -1.986612319946289,
        -0.6693469882011414,
        -0.22591055929660797,
        0.6227336525917053,
        0.18540331721305847,
        0.8382789492607117,
        0.22209370136260986,
        0.4693310260772705,
        0.22543080151081085,
        -0.01167245116084814,
        0.4362754821777344,
        0.42123353481292725,
        0.656719446182251,
        0.19470752775669098,
        0.4914482533931732,
        0.21373885869979858,
        0.6135706901550293,
        -1.142295241355896,
        0.3223148584365845,
        0.2035260647535324,
        0.1707441806793213,
        0.2989872694015503,
        -0.48633113503456116,
        -0.40572983026504517,
        0.2610180675983429,
        -0.19691102206707,
        -0.08389062434434891,
        -0.17286325991153717,
        -0.2283182591199875,
        0.7230324149131775,
        0.49048566818237305,
        -0.2857101857662201,
        0.3437739908695221,
        0.8012565970420837,
        -0.09252507984638214,
        0.3348976969718933,
        0.4386317729949951,
        -0.2598893642425537,
        -0.12196328490972519,
        0.30686452984809875,
        -0.17810827493667603,
        0.15242648124694824,
        0.458641916513443,
        -0.18004700541496277,
        0.27808794379234314,
        0.4518565237522125,
        -0.13145656883716583,
        0.07747455686330795,
        0.5432710647583008,
        0.6961076259613037,
        -0.2526472508907318,
        0.5778120160102844,
        0.326612263917923,
        0.5033616423606873,
        0.41942596435546875,
        0.22655129432678223,
        0.05485837906599045,
        0.7296962738037109,
        0.06702618300914764,
        0.3766568899154663,
        -0.7962060570716858,
        0.37747427821159363,
        -0.17663758993148804,
        0.10300467163324356,
        0.025396544486284256,
        0.08515683561563492,
        0.35255077481269836,
        0.4983399510383606,
        -0.4126374125480652,
        0.52520352602005,
        0.04485262557864189,
        -0.1595289558172226,
        0.636833131313324,
        -0.11544676125049591,
        0.10875462740659714,
        0.06228514760732651,
        -0.20976515114307404,
        0.14230698347091675,
        -0.42528340220451355,
        0.24118436872959137,
        0.4489458501338959,
        -0.14934983849525452,
        0.0012096524005755782,
        0.1300601214170456,
        0.25283971428871155,
        0.3028082549571991,
        0.5298559069633484,
        0.3754953145980835,
        -0.19469408690929413,
        -0.1574597954750061,
        0.1749039590358734,
        -0.07218582928180695,
        -0.03180157020688057,
        -0.3671877086162567,
        0.3274177610874176,
        -0.1292191594839096,
        0.19162745773792267,
        0.7253034114837646,
        0.5061970353126526,
        0.09150061011314392,
        0.07025495171546936,
        -0.059209372848272324,
        -0.4643063545227051,
        0.5085506439208984,
        -0.4626765251159668,
        0.8003299832344055,
        0.3268105387687683,
        -0.25757747888565063,
        0.4860963225364685,
        -0.305828720331192,
        0.206473708152771,
        0.5461763739585876,
        -0.49832916259765625,
        0.3940891921520233,
        0.6860926747322083,
        0.3300955593585968,
        0.007870867848396301,
        -0.05362053960561752,
        0.06813017278909683,
        0.03591481223702431,
        0.42668816447257996,
        0.38922059535980225,
        0.34687942266464233,
        -0.2052334100008011,
        -1.091739535331726,
        0.24443656206130981,
        -0.677833616733551,
        0.46392711997032166,
        -0.24452249705791473,
        -1.2938249111175537,
        0.2695752680301666,
        -0.011111165396869183,
        -0.12666983902454376,
        0.4619610607624054,
        0.3230563998222351,
        -0.14197832345962524,
        0.525269091129303,
        0.0003703509282786399,
        -0.01454272959381342,
        0.69452965259552,
        0.3838650584220886,
        0.7952500581741333,
        0.1131591647863388,
        0.19436655938625336,
        0.4934238791465759,
        -0.03685670346021652,
        0.25332406163215637,
        0.2621065080165863,
        0.36236122250556946,
        0.26377108693122864,
        0.37133607268333435,
        0.4112088084220886,
        0.22408537566661835,
        0.13198406994342804,
        0.41289830207824707,
        0.07483752816915512,
        -0.3294038772583008,
        -0.25508514046669006,
        0.5833064317703247,
        -0.09883260726928711,
        0.19460061192512512,
        0.009341763332486153,
        0.5596063733100891,
        0.20603902637958527,
        0.27970537543296814,
        0.527994692325592,
        -0.0825643315911293,
        -0.07855617254972458,
        0.1017620638012886,
        0.25596025586128235,
        0.31376323103904724,
        -0.008669929578900337,
        0.599949300289154,
        -0.5786908268928528,
        -0.24505926668643951,
        -0.2371186912059784,
        0.5830652713775635,
        0.5404757857322693,
        0.2610105276107788,
        -0.07202862948179245,
        0.18684057891368866,
        0.25248971581459045,
        0.22797657549381256,
        0.15730375051498413,
        0.17598164081573486,
        -0.2828238010406494,
        -0.02315889485180378,
        0.36208653450012207,
        -1.3036751747131348,
        0.6985524892807007,
        -1.0557193756103516,
        0.1583639234304428,
        -0.3229539692401886,
        -1.6526048183441162,
        0.2966175079345703,
        0.06038297712802887,
        -0.05678607523441315,
        0.5286024212837219,
        0.29147252440452576,
        0.386677622795105,
        0.45844393968582153,
        0.08834858983755112,
        0.10094919800758362,
        0.41174817085266113,
        0.12102098017930984,
        0.47112348675727844,
        -0.49813413619995117,
        0.13748866319656372,
        0.3004266619682312,
        0.7351030111312866,
        0.01681213080883026,
        -0.3058589696884155,
        0.37600430846214294,
        -0.012783276848495007,
        0.6694197058677673,
        0.33137646317481995,
        0.25710639357566833,
        -0.08902103453874588,
        0.223788782954216,
        -0.03975887596607208,
        0.5307438969612122,
        -1.3312798738479614,
        0.6359503269195557,
        -0.2762766480445862,
        0.3330053687095642,
        0.06490889191627502,
        0.7025904059410095,
        0.42576518654823303,
        0.4520222246646881,
        0.20025509595870972,
        -0.21934178471565247,
        -0.2226570099592209,
        -0.48886701464653015,
        0.5354384779930115,
        0.3161587119102478,
        0.14496934413909912,
        0.544451892375946,
        0.4524666666984558,
        -0.19488756358623505,
        0.10478557646274567,
        -0.6135576367378235,
        0.8765404224395752,
        -0.9828512668609619,
        0.14972466230392456,
        -0.1768094003200531,
        0.21756763756275177,
        0.16792312264442444,
        0.14028044044971466,
        -0.08304545283317566,
        0.32094860076904297,
        -0.2132629156112671,
        0.2638697028160095,
        -1.8754081726074219,
        0.5443708300590515,
        -1.6435725688934326,
        0.4585697054862976,
        -0.14457279443740845,
        -2.1278371810913086,
        0.5995757579803467,
        0.32631242275238037,
        -0.05470515787601471,
        0.39802515506744385,
        0.2933211922645569,
        -0.3681699335575104,
        0.8607479333877563,
        0.48760801553726196,
        0.034944087266922,
        0.6297882199287415,
        0.08663196861743927,
        0.4367283880710602,
        -0.3275226652622223,
        0.7041330933570862,
        0.11435860395431519,
        -0.26781508326530457,
        0.25530892610549927,
        -0.48422694206237793,
        0.1664193719625473,
        0.14009210467338562,
        0.3597578704357147,
        0.3073563277721405,
        0.11197570711374283,
        0.1363108605146408,
        0.502931535243988,
        0.2779183089733124,
        -0.2570924162864685,
        -0.8861070275306702,
        0.4260404407978058,
        0.37488552927970886,
        0.09026345610618591,
        -0.4874476194381714,
        0.061019111424684525,
        0.24057801067829132,
        -0.12539996206760406,
        0.5709694623947144,
        0.32548072934150696,
        -0.18323399126529694,
        -0.4926728904247284,
        0.4616768956184387,
        0.12928907573223114,
        0.12381341308355331,
        0.7272254228591919,
        0.6397534608840942,
        0.097100168466568,
        0.40430840849876404,
        -0.9030669331550598,
        0.221364825963974,
        -0.5209177136421204,
        0.4651154577732086,
        -0.22621801495552063,
        0.25743579864501953,
        -0.3695312440395355,
        -0.2711608111858368,
        0.8206557035446167,
        0.7676053047180176,
        -0.3857421875,
        -0.149064838886261,
        -1.6023731231689453,
        0.3279878795146942,
        -1.9890474081039429,
        0.18739035725593567,
        -0.13043469190597534,
        -0.38564351201057434,
        -2.4189798831939697,
        -0.39926770329475403,
        0.7839848399162292,
        -2.0204434394836426,
        0.35213392972946167,
        -3.27911114692688,
        -1.604169249534607,
        3.9014015197753906,
        0.5312684178352356,
        1.2045328617095947,
        1.757460117340088,
        -1.1972265243530273,
        -0.1768675446510315,
        -1.5732944011688232,
        -5.4226837158203125,
        0.6985310912132263,
        1.8485265970230103,
        -1.3575769662857056,
        0.4836842119693756,
        2.450261116027832,
        -2.3500847816467285,
        -0.9990699887275696,
        3.4675028324127197,
        -1.7198823690414429,
        0.22658349573612213,
        -0.7406565546989441,
        -0.07303221523761749,
        0.263460248708725,
        -1.5454190969467163,
        0.9254381060600281,
        -5.179920196533203,
        0.9283444285392761,
        -0.6866386532783508,
        0.21725939214229584,
        -2.8856942653656006,
        3.2122726440429688,
        -1.2311347723007202,
        -0.7714827656745911,
        0.7806262969970703,
        -3.448158025741577,
        0.2591635584831238,
        0.31092384457588196,
        -0.74680495262146,
        -0.3795914947986603,
        3.5963735580444336,
        0.10625005513429642,
        0.037252042442560196,
        -3.7784805297851562,
        -0.010729934088885784,
        3.4308629035949707,
        3.377426862716675,
        0.906671941280365,
        0.9446362853050232,
        -0.292992502450943,
        -3.7417759895324707,
        0.05197592452168465,
        0.5786145925521851,
        -1.5158511400222778,
        0.051556702703237534,
        -3.5592100620269775,
        -0.401356041431427,
        3.222317695617676,
        3.224802017211914,
        0.3251743018627167,
        0.5208519697189331,
        0.3469841778278351,
        0.6288965344429016,
        0.3095046281814575,
        0.341278612613678,
        0.26779940724372864,
        0.018377719447016716,
        -0.7716614603996277,
        -0.4827735424041748,
        0.5012962818145752,
        0.2971588671207428,
        0.06383166462182999,
        -0.4741407632827759,
        0.1288677603006363,
        0.0171084962785244,
        0.010756962932646275,
        -0.06352315843105316,
        -0.01583343744277954,
        -0.013643751852214336,
        0.016648484393954277,
        0.2640385031700134,
        0.3604643642902374,
        -0.17198483645915985,
        0.43647500872612,
        0.2907707393169403,
        0.2511415481567383,
        -0.5354727506637573,
        0.17194241285324097,
        0.5011410713195801,
        0.2039557695388794,
        0.6555086374282837,
        0.561127245426178,
        0.33290746808052063,
        0.341598242521286,
        -0.2880772054195404,
        -0.39208632707595825,
        -0.2853478491306305,
        0.02387555129826069,
        -0.2525193989276886,
        0.5326756834983826,
        0.32456138730049133,
        0.4144536256790161,
        0.8452337980270386,
        0.16380946338176727,
        -0.40872445702552795,
        0.12931028008460999,
        -0.0917644277215004,
        0.10263139009475708,
        0.7778127193450928,
        -1.6376453638076782,
        -0.5456624031066895,
        -0.10851210355758667,
        0.21739083528518677,
        0.20401674509048462,
        0.4334184229373932,
        0.11150471121072769,
        0.25849971175193787,
        1.1292765140533447,
        0.02083488553762436,
        0.41888001561164856,
        0.43175268173217773,
        -0.4039173424243927,
        0.45232242345809937,
        0.19302509725093842,
        0.13279591500759125,
        0.0802682414650917,
        0.5076425671577454,
        0.0899122878909111,
        0.3742832839488983,
        -0.2727622389793396,
        0.5658324956893921,
        0.6355620622634888,
        0.13881030678749084,
        0.23885872960090637,
        0.03704608604311943,
        0.34962794184684753,
        -0.4999019503593445,
        0.6004980206489563,
        0.6063064336776733,
        -0.10963129997253418,
        0.24374021589756012,
        0.4061829745769501,
        0.32309016585350037,
        0.08610982447862625,
        -0.35122472047805786,
        0.20995363593101501,
        -0.36286523938179016,
        0.37840932607650757,
        0.4762730896472931,
        0.8996683359146118,
        -0.23524349927902222,
        0.6083487868309021,
        0.285767138004303,
        -0.03939241170883179,
        0.34134700894355774,
        0.08916217088699341,
        0.9336509704589844,
        0.14507009088993073,
        0.6228293180465698,
        -0.5719888210296631,
        0.3064090311527252,
        -0.5114349126815796,
        -0.39851436018943787,
        0.0809294730424881,
        0.08730046451091766,
        0.32572901248931885,
        -0.015485725365579128,
        -0.004668898414820433,
        0.17819339036941528,
        -0.43573176860809326,
        -0.0024078497663140297,
        0.012628215365111828,
        -0.15202930569648743,
        -0.9638914465904236,
        -0.07702963054180145,
        0.405571311712265,
        0.48089271783828735,
        0.2231903225183487,
        0.37139368057250977,
        0.24546898901462555,
        0.175868421792984,
        0.8832705020904541,
        0.3782798945903778,
        -0.15814636647701263,
        0.01885164901614189,
        0.37628066539764404,
        -0.03925412520766258,
        -0.4929675757884979,
        -0.3512224853038788,
        0.36791545152664185,
        -0.2990607023239136,
        0.0024921996518969536,
        -0.1702556610107422,
        0.6193047165870667,
        -0.3352208137512207,
        0.6966155171394348,
        0.4804440438747406,
        -0.01733410730957985,
        -0.03657183423638344,
        -0.42525964975357056,
        -0.6718788146972656,
        -0.2235819548368454,
        0.10607868432998657,
        -0.08228208124637604,
        -0.041312579065561295,
        0.46984392404556274,
        -0.5208079814910889,
        0.13568618893623352,
        -0.32765787839889526,
        -0.7447344064712524,
        0.004643707536160946,
        0.27141761779785156,
        0.10500681400299072,
        0.5146109461784363,
        -0.6013638377189636,
        -0.345833957195282,
        0.12794680893421173,
        0.31866633892059326,
        0.1830861121416092,
        0.22267436981201172,
        0.26839032769203186,
        -0.31645384430885315,
        0.29470062255859375,
        -0.14386671781539917,
        0.5917164087295532,
        0.24347777664661407,
        0.5898211598396301,
        0.27111268043518066,
        -0.4311886727809906,
        -0.16202270984649658,
        -0.2044011354446411,
        -0.2766004204750061,
        0.3701988160610199,
        -0.668662428855896,
        -0.0794486477971077,
        -0.04318639263510704,
        -0.2324545830488205,
        0.373709112405777,
        0.7597642540931702,
        -0.12444336712360382,
        -0.018660875037312508,
        0.06227078661322594,
        0.47369852662086487,
        0.36153846979141235,
        -0.030669115483760834,
        -0.044399287551641464,
        -0.4793277680873871,
        -0.022946780547499657,
        -0.05201346054673195,
        0.1886211782693863,
        0.4138449728488922
      ]
    },
    {
      "name": "dense_Dense1/bias_1",
      "shape": [
        64
      ],
      "dtype": "float32",
      "data": [
        0.0061472817324101925,
        0.24192160367965698,
        0.16818243265151978,
        0.024544943124055862,
        0.026128273457288742,
        -0.08417794108390808,
        0.15509183704853058,
        0.28187263011932373,
        0.05844787508249283,
        -0.03804578259587288,
        0.1200525239109993,
        -0.00998110044747591,
        0.1293022334575653,
        -0.02406015433371067,
        0.19063472747802734,
        0.2529621124267578,
        0.21104401350021362,
        0.10247795283794403,
        0.10552222281694412,
        0.1355305016040802,
        0.1717289239168167,
        0.08605504035949707,
        0.13779111206531525,
        0.1192757785320282,
        0.2720470130443573,
        0.0882784053683281,
        0.3102450668811798,
        -0.1401236653327942,
        0.024229492992162704,
        0.14730821549892426,
        0.029045384377241135,
        0.24484042823314667,
        0.15491816401481628,
        0.2890658378601074,
        0.05113059654831886,
        0.3300711512565613,
        0.08858924359083176,
        0.11057115346193314,
        0.09125488996505737,
        0.0710313469171524,
        0.23968230187892914,
        0.05902867391705513,
        0.10842971503734589,
        0.334738552570343,
        -0.006643799599260092,
        0.1484343260526657,
        -0.16262128949165344,
        0.13184447586536407,
        0.16148141026496887,
        -0.020001037046313286,
        -0.11653311550617218,
        0.03503245860338211,
        0.15440888702869415,
        0.04990952089428902,
        0.06309758871793747,
        0.29407408833503723,
        0.26748982071876526,
        0.1624699980020523,
        0.3049447238445282,
        0.09677024930715561,
        0.29174405336380005,
        0.14553995430469513,
        0.13808992505073547,
        0.057243235409259796
      ]
    },
    {
      "name": "dense_Dense2/kernel_1",
      "shape": [
        64,
        64
      ],
      "dtype": "float32",
      "data": [
        -0.42580100893974304,
        -0.24912239611148834,
        -0.4624840021133423,
        0.2674289643764496,
        0.24590037763118744,
        -0.5331553220748901,
        0.145199254155159,
        -0.4286339581012726,
        -0.8763191103935242,
        0.6065102815628052,
        -0.2066287249326706,
        -1.1102657318115234,
        1.3903565406799316,
        -1.505382776260376,
        -0.6548424363136292,
        -0.5971168875694275,
        0.04278501123189926,
        -0.9474676847457886,
        0.9188361763954163,
        -0.16563452780246735,
        -1.0493258237838745,
        -0.9946223497390747,
        1.109472393989563,
        -0.748065173625946,
        0.1978704184293747,
        0.30546921491622925,
        0.2575272023677826,
        1.783619999885559,
        0.6639245748519897,
        0.01194166112691164,
        0.5383575558662415,
        -0.3864166736602783,
        -0.7970516681671143,
        0.04683712124824524,
        -0.7632473111152649,
        -0.24722297489643097,
        0.20889100432395935,
        0.28406164050102234,
        -0.4969331622123718,
        0.940397322177887,
        -0.3613456189632416,
        -0.07869374752044678,
        1.9323713779449463,
        -0.29183149337768555,
        -0.1009247750043869,
        0.05189346522092819,
        -0.9946831464767456,
        0.5969460010528564,
        0.2840583622455597,
        0.10924352705478668,
        -0.7963321805000305,
        -0.4381016194820404,
        -0.3260386884212494,
        -1.3799160718917847,
        0.12988920509815216,
        1.1454322338104248,
        -0.28750550746917725,
        0.04578439146280289,
        -0.4844093918800354,
        -0.12477172911167145,
        -0.0729980543255806,
        0.14422345161437988,
        0.30133843421936035,
        0.7546491026878357,
        0.2822992503643036,
        -0.48789459466934204,
        0.5521445274353027,
        0.19695843756198883,
        1.5833395719528198,
        0.31030958890914917,
        0.2705651819705963,
        0.09905116260051727,
        0.9306405782699585,
        -0.007991106249392033,
        -0.07375193387269974,
        1.0929964780807495,
        -0.21244804561138153,
        1.6395491361618042,
        1.0622917413711548,
        0.9838842153549194,
        0.012067423202097416,
        1.1082983016967773,
        -1.2615396976470947,
        0.22181583940982819,
        0.842492938041687,
        1.1229814291000366,
        -0.6442914605140686,
        1.0803030729293823,
        -0.42508623003959656,
        0.14296363294124603,
        -0.07486721128225327,
        -0.23260392248630524,
        0.2839272618293762,
        -0.14361855387687683,
        0.006319341249763966,
        0.9591296911239624,
        1.078100562095642,
        -0.2008594572544098,
        1.758341670036316,
        -0.6984157562255859,
        -0.24712559580802917,
        -0.27405989170074463,
        1.3919366598129272,
        -1.060523271560669,
        0.3771950900554657,
        -0.13517068326473236,
        -0.28361982107162476,
        -0.0577053427696228,
        0.023072736337780952,
        0.10740002244710922,
        0.9188925623893738,
        -0.6282854080200195,
        -0.07614985853433609,
        0.20861376821994781,
        0.9079847931861877,
        0.5733802914619446,
        0.1934899091720581,
        1.4761282205581665,
        0.19633150100708008,
        -0.3145712614059448,
        0.13890738785266876,
        -0.1957646608352661,
        1.4979077577590942,
        -0.43445706367492676,
        0.05560636892914772,
        -1.3025566339492798,
        0.7495271563529968,
        0.11312933266162872,
        -0.2683379650115967,
        0.1589861512184143,
        0.6796532869338989,
        -1.2812691926956177,
        1.017265796661377,
        1.039831280708313,
        -0.30634617805480957,
        -0.9636272192001343,
        -0.12231362611055374,
        0.1513214111328125,
        -0.04798104614019394,
        -0.16366446018218994,
        -0.09113004803657532,
        -0.46111035346984863,
        0.5578168034553528,
        1.4658786058425903,
        -0.06560983508825302,
        0.11741197854280472,
        0.20108087360858917,
        1.0345534086227417,
        0.28485754132270813,
        0.18314173817634583,
        -0.21413055062294006,
        0.16590721905231476,
        -0.6773799061775208,
        -0.21060539782047272,
        -0.15610381960868835,
        0.11386851221323013,
        0.1665036827325821,
        -0.8983019590377808,
        -0.8381757140159607,
        0.38155612349510193,
        0.49041852355003357,
        -0.12186642736196518,
        0.20163480937480927,
        0.7334045171737671,
        1.1450871229171753,
        1.169079065322876,
        0.27248552441596985,
        0.6045622825622559,
        -0.2385760396718979,
        0.03834586217999458,
        -0.30286380648612976,
        0.026078689843416214,
        0.02134088985621929,
        -0.029623905196785927,
        0.9756191372871399,
        0.3201428949832916,
        1.0838295221328735,
        0.4557782709598541,
        -0.04321551322937012,
        0.29857367277145386,
        -2.0892744064331055,
        0.2006019651889801,
        -0.10610971599817276,
        0.4784911870956421,
        0.14910642802715302,
        -0.9279748797416687,
        -0.2047954499721527,
        -0.5379152297973633,
        1.2503352165222168,
        0.292431503534317,
        -0.14768265187740326,
        -0.15732204914093018,
        0.3389241099357605,
        -0.09654281288385391,
        -0.1257966011762619,
        -0.7049849629402161,
        0.11733689904212952,
        -0.24197053909301758,
        -0.018206454813480377,
        -0.7029790282249451,
        0.24515925347805023,
        0.04019433632493019,
        -0.25947660207748413,
        -0.44303980469703674,
        -0.031749509274959564,
        0.13864269852638245,
        -0.20670875906944275,
        -0.48494601249694824,
        0.045234836637973785,
        -0.2729245722293854,
        -0.44008269906044006,
        -0.5325204730033875,
        -0.2687878906726837,
        -0.28641477227211,
        -0.1278516948223114,
        -0.007485383655875921,
        -0.5575207471847534,
        0.10457362979650497,
        0.11280203610658646,
        -0.43145886063575745,
        0.7659474015235901,
        -0.796612024307251,
        -0.33031439781188965,
        -0.16411612927913666,
        0.07142426073551178,
        -0.23247383534908295,
        0.5879533290863037,
        -0.7646052837371826,
        -0.5165069103240967,
        -0.730485200881958,
        1.668474793434143,
        -0.4093032777309418,
        0.33648842573165894,
        -0.1682211458683014,
        -0.24430592358112335,
        -0.25902941823005676,
        0.054091863334178925,
        -0.004045299720019102,
        -0.5146639943122864,
        0.03376365453004837,
        -0.10053864866495132,
        1.8928691148757935,
        -0.20827284455299377,
        0.6727427840232849,
        0.2692744731903076,
        -0.028394749388098717,
        -0.0589432530105114,
        0.19232097268104553,
        0.3273494839668274,
        0.2972663342952728,
        -0.16756506264209747,
        -0.37774088978767395,
        -0.5977981686592102,
        0.008411886170506477,
        -0.4368857443332672,
        0.2027083933353424,
        0.751691997051239,
        0.11553671211004257,
        0.8819561004638672,
        -0.3725767135620117,
        0.6068359017372131,
        0.3403429090976715,
        0.13970813155174255,
        -0.23632897436618805,
        0.8959956169128418,
        0.0922776535153389,
        -0.022952310740947723,
        0.05842434987425804,
        -0.8368366360664368,
        0.3060277998447418,
        0.7184609770774841,
        1.0194419622421265,
        -0.20869746804237366,
        0.9567899107933044,
        0.09306292235851288,
        0.4908091723918915,
        0.9044033288955688,
        0.8126353621482849,
        -0.42565256357192993,
        0.776611328125,
        -0.04099135473370552,
        -0.04219651222229004,
        -0.0388188473880291,
        -0.4008142054080963,
        0.4126054346561432,
        -0.5010476112365723,
        -0.3778219521045685,
        0.8700827360153198,
        0.957037627696991,
        0.10502700507640839,
        0.7969653010368347,
        0.4045018255710602,
        0.03402099385857582,
        0.26357895135879517,
        0.676184356212616,
        -0.09970107674598694,
        0.6679297089576721,
        0.005869653541594744,
        0.01072312705218792,
        0.2647835910320282,
        -0.11965581774711609,
        -0.23922358453273773,
        0.5691663026809692,
        0.13256299495697021,
        0.0026936589274555445,
        -0.17419353127479553,
        0.7565128803253174,
        -0.7623559236526489,
        0.19165652990341187,
        0.9214345216751099,
        0.19966526329517365,
        -0.09717875719070435,
        0.24518121778964996,
        -0.4455958306789398,
        0.5877794623374939,
        -0.4290924370288849,
        0.3718286156654358,
        -0.3203319013118744,
        0.03508679196238518,
        0.11999477446079254,
        1.953637719154358,
        1.614842176437378,
        -0.7338414192199707,
        -0.9382597804069519,
        -1.3080822229385376,
        -0.2609855830669403,
        -0.20469129085540771,
        -0.17234168946743011,
        -0.8030323386192322,
        0.013958925381302834,
        -0.06752067804336548,
        -0.7170233130455017,
        1.151930570602417,
        -0.5175579786300659,
        -1.0892090797424316,
        -0.9500053524971008,
        -0.1444598287343979,
        -1.339038372039795,
        -0.2917831540107727,
        -0.9851446151733398,
        -0.778431236743927,
        -0.8186496496200562,
        -0.5085156559944153,
        -1.2146028280258179,
        -1.2426903247833252,
        -0.09979590028524399,
        0.11329575628042221,
        -1.420247197151184,
        1.1573718786239624,
        -0.3822343647480011,
        -0.8328053951263428,
        -1.349458932876587,
        -0.95353102684021,
        -0.34140175580978394,
        0.4192828834056854,
        -0.8976401686668396,
        -0.7929407954216003,
        -1.026205062866211,
        2.095207929611206,
        -0.800896406173706,
        1.8562917709350586,
        0.16943104565143585,
        -1.5983926057815552,
        -0.09128958731889725,
        -0.278638631105423,
        0.03005986474454403,
        -1.7039051055908203,
        -0.2480163872241974,
        -0.8065062165260315,
        1.9116778373718262,
        -1.1460018157958984,
        1.7379684448242188,
        1.3509913682937622,
        -1.0496325492858887,
        -0.36244821548461914,
        0.8491154909133911,
        2.0114078521728516,
        0.6427846550941467,
        -0.6558526754379272,
        -0.17900694906711578,
        -0.6397737264633179,
        -1.3489052057266235,
        -0.7139269113540649,
        1.181937575340271,
        -0.3343018591403961,
        -0.10654827207326889,
        -0.27276745438575745,
        0.6581481695175171,
        0.5839304327964783,
        -0.06382745504379272,
        -0.23195025324821472,
        0.6723017692565918,
        0.07540871202945709,
        -0.06800089031457901,
        -0.05305686965584755,
        0.7159178256988525,
        0.6162575483322144,
        0.9338201284408569,
        0.2615116238594055,
        -0.04182754084467888,
        -0.025876395404338837,
        0.5076238512992859,
        -0.6296770572662354,
        -0.16006231307983398,
        0.10500302165746689,
        0.6043953895568848,
        -0.3809822201728821,
        0.7726070284843445,
        0.5548739433288574,
        -0.008281489834189415,
        -0.15341901779174805,
        0.4369511008262634,
        -0.7893515229225159,
        0.7591193318367004,
        0.6223752498626709,
        0.6995317935943604,
        0.8271918892860413,
        0.041283246129751205,
        0.27908217906951904,
        -0.21607132256031036,
        -0.7608019113540649,
        0.06734251976013184,
        -0.5630219578742981,
        -0.35031646490097046,
        -0.2742190957069397,
        0.0907001942396164,
        -0.0648275837302208,
        0.08622957020998001,
        -0.3324275612831116,
        -0.04064328595995903,
        0.11522812396287918,
        -0.6050438284873962,
        -0.2832299768924713,
        0.03978336974978447,
        0.4668791592121124,
        0.5144463777542114,
        0.3557659983634949,
        0.32873857021331787,
        -0.20447155833244324,
        -0.34315788745880127,
        -0.19940714538097382,
        0.7405253052711487,
        0.13988235592842102,
        0.5080374479293823,
        -0.5948943495750427,
        -0.094578318297863,
        0.663532018661499,
        0.07708564400672913,
        0.7577289342880249,
        0.7376705408096313,
        0.09959667921066284,
        0.5423206686973572,
        0.5980653166770935,
        0.24437788128852844,
        0.14495371282100677,
        0.11820417642593384,
        0.5703162550926208,
        -0.41461774706840515,
        -0.10631479322910309,
        0.615181565284729,
        0.16928482055664062,
        0.6163055896759033,
        0.6996774673461914,
        0.7684520483016968,
        -0.05680526793003082,
        0.5381100177764893,
        -0.6235811710357666,
        -0.4736986458301544,
        0.41747337579727173,
        0.8863674402236938,
        -1.0775413513183594,
        0.6275189518928528,
        0.1961003988981247,
        -0.21488229930400848,
        -0.39379018545150757,
        -0.6223997473716736,
        0.2477790266275406,
        0.32605335116386414,
        0.28377678990364075,
        0.3485010862350464,
        0.6547584533691406,
        -0.32842954993247986,
        0.6088364720344543,
        -0.5517297983169556,
        -0.20414641499519348,
        0.0876883864402771,
        1.2591794729232788,
        -0.5865132808685303,
        0.6643530130386353,
        -0.16265606880187988,
        -0.3448306918144226,
        -0.25441500544548035,
        -0.2133302390575409,
        0.2858348488807678,
        0.6982647180557251,
        -0.3798658549785614,
        -0.45412102341651917,
        0.009566495195031166,
        0.9673658609390259,
        0.5714274644851685,
        -0.019408589228987694,
        0.6789178848266602,
        0.19013889133930206,
        0.38402843475341797,
        0.7697167992591858,
        0.20366103947162628,
        0.8829107284545898,
        -0.5815274715423584,
        -0.5011641383171082,
        -1.138183355331421,
        0.71885746717453,
        0.1843356341123581,
        -0.36094626784324646,
        -0.14685173332691193,
        0.11167861521244049,
        0.15728875994682312,
        -0.43948736786842346,
        0.3683289587497711,
        0.2125963568687439,
        0.70914226770401,
        -0.5597872734069824,
        -0.4492394030094147,
        -0.12176401913166046,
        -0.23661409318447113,
        0.7139614224433899,
        -0.4537957012653351,
        -0.6748427152633667,
        0.4811595380306244,
        -0.275998592376709,
        -0.9986891150474548,
        0.6911617517471313,
        0.14204977452754974,
        -0.5387120246887207,
        -0.9569109082221985,
        0.7286723852157593,
        -0.7846791744232178,
        -0.06016338989138603,
        0.06986846029758453,
        -0.7712817192077637,
        0.5413013696670532,
        0.5652477145195007,
        0.5185827016830444,
        -0.033243659883737564,
        -0.9153528809547424,
        -0.7632724046707153,
        0.22484461963176727,
        -0.28820347785949707,
        0.22978375852108002,
        0.1990768015384674,
        0.47925040125846863,
        0.2640205919742584,
        0.44242173433303833,
        -0.09508625417947769,
        0.06455613672733307,
        -0.2845417559146881,
        -0.030101776123046875,
        -0.04357406124472618,
        -0.25408366322517395,
        -0.044370878487825394,
        0.48290982842445374,
        -0.03578969091176987,
        1.361037015914917,
        -0.4950505197048187,
        1.1147946119308472,
        0.3064382076263428,
        -1.0239059925079346,
        0.19946613907814026,
        0.2050924450159073,
        0.06270501762628555,
        0.06088077276945114,
        -0.5352001190185547,
