{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              21
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        21,
        64
      ],
      "dtype": "float32",
      "data": [
        -0.4355641305446625,
        0.6256283521652222,
        0.6865854859352112,
        0.5105361342430115,
        -0.4606897830963135,
        -0.2034941464662552,
        -0.21225662529468536,
        0.3852507472038269,
        -0.16826187074184418,
        -0.41681769490242004,
        0.1772857904434204,
        -0.04458427429199219,
        -0.2764020562171936,
        0.7103061079978943,
        -0.37217292189598083,
        0.4855133891105652,
        -0.03414201736450195,
        0.17516681551933289,
        0.3175256550312042,
        0.48421815037727356,
        -0.9456647038459778,
        -0.27622705698013306,
        -0.22637566924095154,
        -0.4846636652946472,
        0.464222252368927,
        0.10014109313488007,
        0.10327188670635223,
        0.014586882665753365,
        0.5727729797363281,
        0.12459961324930191,
        -0.7453473210334778,
        0.011758080683648586,
        0.41527971625328064,
        -0.048430562019348145,
        -0.11068502068519592,
        0.2064102590084076,
        -0.14831729233264923,
        0.41027912497520447,
        -0.9411001205444336,
        -0.21032503247261047,
        0.19761671125888824,
        -0.024630757048726082,
        -0.05302870273590088,
        0.3731108605861664,
        -0.8968632221221924,
        0.6500212550163269,
        0.5188617706298828,
        0.1126091331243515,
        -0.1685662567615509,
        -0.559124231338501,
        0.4806708097457886,
        0.16771544516086578,
        0.6070571541786194,
        -0.026176011189818382,
        -0.5000745058059692,
        0.16520115733146667,
        0.20632492005825043,
        -0.17306731641292572,
        -0.21059179306030273,
        -0.07919525355100632,
        0.09034170210361481,
        0.4147840440273285,
        0.5662326216697693,
        0.22084616124629974,
        -0.6863149404525757,
        -0.1568591445684433,
        0.01730182394385338,
        0.14403536915779114,
        -0.9314653873443604,
        -0.1674209088087082,
        0.32482990622520447,
        0.14169999957084656,
        -0.39046046137809753,
        0.9480199813842773,
        0.016907824203372,
        0.20794233679771423,
        -0.30718761682510376,
        0.33320653438568115,
        -0.16867654025554657,
        0.1864372342824936,
        -0.010583125054836273,
        -0.18152202665805817,
        0.9697179198265076,
        0.5766464471817017,
        -1.2117677927017212,
        0.2004566639661789,
        0.677631676197052,
        0.22512666881084442,
        0.0670597180724144,
        0.8903341889381409,
        -0.051762573421001434,
        -0.04125182703137398,
        0.1385512501001358,
        -0.2628166675567627,
        -1.2295022010803223,
        0.0288857389241457,
        0.23536112904548645,
        0.34966784715652466,
        -0.3951212167739868,
        -0.14861349761486053,
        0.5546264052391052,
        0.2246968299150467,
        -0.31022733449935913,
        0.2911011874675751,
        0.18060345947742462,
        0.5081096291542053,
        -0.1348988562822342,
        0.007241842802613974,
        0.02216644585132599,
        0.3164311945438385,
        0.22881710529327393,
        0.1594863384962082,
        -0.07277039438486099,
        -0.4708985686302185,
        0.4064599573612213,
        -0.07106496393680573,
        0.7383191585540771,
        0.17338715493679047,
        -0.12307321280241013,
        -0.5621066093444824,
        0.8231550455093384,
        0.21885843575000763,
        0.20918789505958557,
        -0.6532484292984009,
        0.4217073321342468,
        0.2359691560268402,
        -0.6030899286270142,
        0.057683344930410385,
        -0.8132060170173645,
        0.5815320611000061,
        -0.014877364039421082,
        -0.3076876699924469,
        -0.5679064989089966,
        -0.28725534677505493,
        0.495358407497406,
        -0.07756932079792023,
        0.3571447730064392,
        0.31869733333587646,
        0.20113879442214966,
        0.053607821464538574,
        -0.2869287133216858,
        -0.1706053465604782,
        -0.40043362975120544,
        0.06737937033176422,
        -0.4450688362121582,
        0.3589051067829132,
        0.058793678879737854,
        -0.0821026936173439,
        -0.12434927374124527,
        0.2728452682495117,
        -0.07217643409967422,
        -0.11412642896175385,
        0.24609218537807465,
        -0.006319083273410797,
        0.3075627386569977,
        0.3890804946422577,
        0.03138547018170357,
        -0.2013041228055954,
        -0.9695696830749512,
        -0.312730073928833,
        -0.27979740500450134,
        0.5131235718727112,
        0.08311010152101517,
        -0.4405529797077179,
        -0.1587292104959488,
        -0.04795466363430023,
        -0.36385101079940796,
        0.2541360557079315,
        -0.3633248805999756,
        -0.33846160769462585,
        -0.2841474115848541,
        -0.7186179757118225,
        0.25606629252433777,
        0.12694545090198517,
        0.6049180030822754,
        0.04028409346938133,
        -0.29657697677612305,
        -0.5347134470939636,
        -0.04613287374377251,
        -0.12898243963718414,
        -0.02007022686302662,
        -0.2235022932291031,
        0.5117878913879395,
        0.11424550414085388,
        -0.623775839805603,
        -0.0745154321193695,
        0.05585281550884247,
        -0.4272828698158264,
        -0.20076175034046173,
        0.015735069289803505,
        -0.08968956768512726,
        -0.21387052536010742,
        -0.10141949355602264,
        0.7916200757026672,
        0.18342910706996918,
        0.07792354375123978,
        -0.14025528728961945,
        0.4879053831100464,
        0.28933799266815186,
        -0.46680763363838196,
        -0.39341822266578674,
        -0.09825332462787628,
        0.06562759727239609,
        0.032414913177490234,
        -0.3161843717098236,
        -0.40726813673973083,
        -0.17441067099571228,
        -0.14647944271564484,
        -0.09516681730747223,
        0.03772813826799393,
        0.11659244447946548,
        0.33849120140075684,
        -0.45313677191734314,
        0.09485209733247757,
        -0.11335746198892593,
        0.14482761919498444,
        0.27888378500938416,
        0.22591841220855713,
        -0.6443801522254944,
        0.27706658840179443,
        0.4004082977771759,
        0.3496066927909851,
        -0.9064568877220154,
        0.11830002069473267,
        -0.3299814760684967,
        -0.06300780177116394,
        -0.13141781091690063,
        0.14117558300495148,
        0.08045552670955658,
        0.10458546131849289,
        -0.19399768114089966,
        -0.25418341159820557,
        -0.3327617049217224,
        -0.5897397994995117,
        -0.4015713930130005,
        0.5104786157608032,
        0.19641610980033875,
        0.6512169241905212,
        0.13932853937149048,
        -0.10876930505037308,
        0.10687267035245895,
        -0.12289886176586151,
        0.4723588228225708,
        -0.4728749692440033,
        -0.03214503452181816,
        -0.10769449174404144,
        0.1252349615097046,
        -0.02205846458673477,
        0.1312040388584137,
        -0.03599872067570686,
        -0.7518975138664246,
        0.06638281792402267,
        0.07218668609857559,
        -0.18935947120189667,
        -0.163854718208313,
        -0.46902406215667725,
        -0.3356831967830658,
        0.42523351311683655,
        -0.19992443919181824,
        0.18757790327072144,
        -0.6706167459487915,
        -0.4421815574169159,
        -0.15877489745616913,
        0.053739819675683975,
        -0.4828798174858093,
        0.16087347269058228,
        0.14299149811267853,
        -0.4329349994659424,
        0.03490732982754707,
        0.10072295367717743,
        -0.24838818609714508,
        0.4580027759075165,
        -0.1855734884738922,
        0.09497610479593277,
        0.23402824997901917,
        0.19558721780776978,
        -0.5916420221328735,
        0.020363230258226395,
        0.08289316296577454,
        -0.9608355760574341,
        -0.18748533725738525,
        -0.3166477680206299,
        0.28338512778282166,
        0.46218809485435486,
        -0.41471055150032043,
        0.42259475588798523,
        -0.17884238064289093,
        0.2056981772184372,
        0.22960203886032104,
        0.04746668040752411,
        0.32883769273757935,
        -0.08691421896219254,
        -0.7097914814949036,
        0.048103079199790955,
        -0.49759888648986816,
        0.18388545513153076,
        -0.05876001715660095,
        -0.45408880710601807,
        -0.10811690986156464,
        0.08103428035974503,
        0.3901817500591278,
        0.1049993634223938,
        0.14618082344532013,
        0.2566729187965393,
        -0.34468796849250793,
        -0.9998078346252441,
        0.295981228351593,
        -0.27758997678756714,
        -0.18301086127758026,
        -0.04433871805667877,
        -0.2091425210237503,
        -0.23508746922016144,
        0.12104295194149017,
        0.059025444090366364,
        -0.6923275589942932,
        -0.16251809895038605,
        -0.07112466543912888,
        -0.21232569217681885,
        0.09096642583608627,
        -0.02176276594400406,
        0.23217913508415222,
        -0.627363920211792,
        -0.44279125332832336,
        -0.009173938073217869,
        -0.21863600611686707,
        0.045998573303222656,
        0.13500714302062988,
        -0.18914757668972015,
        -0.1471918672323227,
        0.3909246623516083,
        0.22402486205101013,
        -0.0470157265663147,
        0.2544088661670685,
        -0.10487856715917587,
        -0.10047457367181778,
        -0.5693055987358093,
        -0.1266079694032669,
        0.05299193412065506,
        -0.16256596148014069,
        -0.0570027232170105,
        -0.070976123213768,
        0.2745174169540405,
        -0.1326703429222107,
        -0.03987535461783409,
        -0.38434648513793945,
        -0.3330341875553131,
        -0.3125982880592346,
        -0.5358511209487915,
        -0.9752333164215088,
        -0.033868495374917984,
        -0.28423139452934265,
        -0.2893611788749695,
        -0.18479841947555542,
        0.29961299896240234,
        0.36253318190574646,
        0.022911813110113144,
        -0.07459151744842529,
        -1.5211049318313599,
        0.048138633370399475,
        0.4997541904449463,
        0.43364986777305603,
        0.05292632058262825,
        -0.5077877640724182,
        0.6745175123214722,
        0.2590828835964203,
        -0.3380979299545288,
        -0.10243575274944305,
        -0.02816925197839737,
        -0.38637775182724,
        0.08276987075805664,
        -0.19411087036132812,
        -0.056035321205854416,
        0.24380815029144287,
        0.17833314836025238,
        -0.33128345012664795,
        0.10979533940553665,
        0.10168001800775528,
        0.19162631034851074,
        -0.30491217970848083,
        0.22747544944286346,
        -0.05201165750622749,
        -0.12559112906455994,
        0.1261017620563507,
        -0.09653057903051376,
        -0.33454057574272156,
        -0.4895782470703125,
        -0.6289651989936829,
        0.3462839722633362,
        -0.3030140697956085,
        0.05574720352888107,
        0.6620287299156189,
        -0.4164506494998932,
        -1.1047216653823853,
        -0.07283823192119598,
        -0.01412966288626194,
        -0.06858856976032257,
        -0.25859540700912476,
        -0.10496772825717926,
        -0.12196537107229233,
        0.20236815512180328,
        -0.29678526520729065,
        0.3315967321395874,
        -0.43936794996261597,
        0.17800270020961761,
        -0.3176071047782898,
        -0.48038554191589355,
        -0.8845145106315613,
        -0.40991589426994324,
        -0.2904679477214813,
        0.40597882866859436,
        -0.1339643895626068,
        0.6733258962631226,
        -0.1747431755065918,
        0.06264813244342804,
        0.14537204802036285,
        -0.4506371021270752,
        0.45958301424980164,
        -0.2833782136440277,
        0.18221689760684967,
        0.6813147664070129,
        0.1839970499277115,
        0.15968535840511322,
        0.2582259774208069,
        -0.14143288135528564,
        0.29645079374313354,
        -0.07306189835071564,
        -0.10131766647100449,
        -0.09969249367713928,
        0.022661488503217697,
        0.06235014274716377,
        -0.2625575363636017,
        0.5793270468711853,
        0.36856669187545776,
        0.24421925842761993,
        0.010363669134676456,
        -0.41840702295303345,
        -0.00154598755761981,
        0.25541383028030396,
        0.3753610849380493,
        -0.31099236011505127,
        0.35293346643447876,
        -0.10482575744390488,
        -0.8166816830635071,
        -0.3133583664894104,
        -0.31108906865119934,
        0.3830412030220032,
        0.17285795509815216,
        0.2555876672267914,
        0.15922896564006805,
        -0.37612682580947876,
        0.1405029296875,
        -0.2302136868238449,
        -0.04965578392148018,
        -0.751193642616272,
        0.10038113594055176,
        -0.19117988646030426,
        -1.1189663410186768,
        0.03044300526380539,
        0.11963043361902237,
        -0.7312729954719543,
        -0.503372073173523,
        0.26090723276138306,
        0.2062472552061081,
        -0.03786318376660347,
        -0.3374648690223694,
        0.6658093333244324,
        -0.0855545699596405,
        0.0611162893474102,
        -0.11453396081924438,
        -0.34731340408325195,
        0.038688644766807556,
        -0.5671154260635376,
        0.07965639978647232,
        -0.650871753692627,
        0.22238771617412567,
        0.10928089171648026,
        -0.2801012098789215,
        0.010044295340776443,
        -0.0941343903541565,
        -1.148316740989685,
        0.4792778491973877,
        0.3085082173347473,
        0.5910095572471619,
        -0.5114977359771729,
        -0.36543112993240356,
        -0.2726891040802002,
        0.19291914999485016,
        -0.3571353852748871,
        0.06046290323138237,
        -0.015896428376436234,
        -0.4142296314239502,
        -0.31952884793281555,
        0.1785995364189148,
        0.21112704277038574,
        0.459552139043808,
        0.7136927843093872,
        1.0533311367034912,
        0.09074977785348892,
        -0.03658683970570564,
        -0.1523023545742035,
        0.3561159074306488,
        0.4036797881126404,
        -0.8101620674133301,
        -0.3892807960510254,
        -0.05489334836602211,
        0.018331801518797874,
        0.28684765100479126,
        -0.5928173661231995,
        0.5292109251022339,
        -0.18726831674575806,
        0.3348254859447479,
        -0.09754014015197754,
        -0.1639324277639389,
        0.18214455246925354,
        0.05080714449286461,
        -0.41339564323425293,
        -0.1951913684606552,
        0.13113972544670105,
        0.5702921152114868,
        -0.4327067732810974,
        -0.4622534215450287,
        0.6511119604110718,
        -0.08563151210546494,
        -0.6978660225868225,
        0.32114702463150024,
        -0.5079033970832825,
        0.29803183674812317,
        0.3586251139640808,
        0.05758122354745865,
        -0.17718961834907532,
        -0.369498610496521,
        -0.06690792739391327,
        -0.13743525743484497,
        -0.06618815660476685,
        0.07581034302711487,
        0.0627359077334404,
        -0.4326101541519165,
        0.8430244326591492,
        0.4564236104488373,
        -0.2517237663269043,
        -0.40587109327316284,
        -0.028945742174983025,
        0.26145055890083313,
        -0.6289498209953308,
        -0.08910814672708511,
        -0.2672174870967865,
        0.2192327082157135,
        -0.014170545153319836,
        0.02657763846218586,
        -0.11659321188926697,
        -0.08618900924921036,
        -0.37233731150627136,
        0.24938997626304626,
        0.05101977288722992,
        -0.2231123149394989,
        -0.15460234880447388,
        0.22163663804531097,
        0.2718989849090576,
        0.3342137038707733,
        -0.20847709476947784,
        -0.08879745751619339,
        0.3773200213909149,
        -0.3713490962982178,
        -0.19946470856666565,
        0.4942779242992401,
        -0.10327907651662827,
        -0.2844602167606354,
        -0.04590882733464241,
        -0.18339429795742035,
        0.25738725066185,
        0.1044297143816948,
        -0.23142892122268677,
        -0.07617484033107758,
        -0.1679903268814087,
        0.5088626742362976,
        -0.10581173002719879,
        -0.12248629331588745,
        0.22437484562397003,
        -0.16200506687164307,
        0.3438302278518677,
        -0.12819842994213104,
        0.06422457098960876,
        -0.2862823009490967,
        -0.08128751069307327,
        -0.66408371925354,
        -0.007173942867666483,
        -0.08934451639652252,
        -0.7709232568740845,
        -0.06891235709190369,
        -0.026921065524220467,
        -0.17140203714370728,
        0.028919510543346405,
        -0.036305032670497894,
        0.6349912881851196,
        0.49977442622184753,
        -0.07670378684997559,
        0.47392499446868896,
        0.05758294463157654,
        -0.1485651284456253,
        0.3590778112411499,
        -0.06498653441667557,
        0.1812347024679184,
        0.10350928455591202,
        0.3661019504070282,
        0.1501181423664093,
        0.42731139063835144,
        0.2823810577392578,
        -0.49990296363830566,
        0.30464163422584534,
        -0.20399746298789978,
        -0.13691630959510803,
        -0.10643448680639267,
        -0.0421975776553154,
        0.050848864018917084,
        -0.3116268813610077,
        -0.21225202083587646,
        0.40414634346961975,
        -0.051946189254522324,
        -0.2625582218170166,
        -0.011127457022666931,
        0.08167208731174469,
        0.2238358110189438,
        0.45556074380874634,
        -0.2168811559677124,
        0.6347666382789612,
        0.26477736234664917,
        -0.12742005288600922,
        -0.14167466759681702,
        0.2645297348499298,
        -0.2210838347673416,
        0.07838226109743118,
        0.2638987600803375,
        -0.2536194920539856,
        0.00657280907034874,
        -0.1613278090953827,
        -0.66504967212677,
        0.022966301068663597,
        0.06233997642993927,
        0.42820075154304504,
        0.15224283933639526,
        0.14754852652549744,
        0.18507026135921478,
        -0.21396170556545258,
        -0.2985214591026306,
        0.16763396561145782,
        -0.11648499965667725,
        0.26097041368484497,
        0.030040793120861053,
        -0.9525988101959229,
        0.3265584409236908,
        -0.29194825887680054,
        -0.5461536645889282,
        -0.38117095828056335,
        0.24555326998233795,
        -0.018693847581744194,
        0.16752338409423828,
        0.1475692242383957,
        0.2607254683971405,
        0.31085994839668274,
        0.2696409225463867,
        0.28575724363327026,
        0.53680819272995,
        -0.3515625,
        -0.7484159469604492,
        0.48315340280532837,
        -0.25608208775520325,
        0.5116780996322632,
        -0.23006278276443481,
        -0.20606635510921478,
        -0.35087916254997253,
        -0.38127022981643677,
        -0.7074722051620483,
        -0.09768953174352646,
        0.1326494812965393,
        0.033979468047618866,
        -0.08383220434188843,
        0.13385532796382904,
        -0.06979171186685562,
        0.6606200337409973,
        -0.06978977471590042,
        -0.17737817764282227,
        -0.12998971343040466,
        -0.03842303529381752,
        -0.08464068174362183,
        0.24668848514556885,
        0.2650229334831238,
        0.12009286880493164,
        -0.05889734625816345,
        0.2308456003665924,
        -0.5804275274276733,
        -0.16742978990077972,
        -0.8817797899246216,
        0.19222226738929749,
        -0.4447568655014038,
        -0.7023243308067322,
        0.0955977663397789,
        -0.010286781936883926,
        -0.029174579307436943,
        -0.32628676295280457,
        0.18781426548957825,
        -0.4076962471008301,
        -0.5852885246276855,
        0.15080513060092926,
        0.20464208722114563,
        0.13938233256340027,
        0.21337565779685974,
        0.03227226063609123,
        0.22079473733901978,
        0.1347220540046692,
        -0.0032273479737341404,
        0.16135449707508087,
        -0.06453605741262436,
        -0.15987296402454376,
        0.20804445445537567,
        -0.12902016937732697,
        -0.5362902879714966,
        -0.1642248034477234,
        0.06659117341041565,
        -0.45840632915496826,
        0.17483405768871307,
        -0.45991086959838867,
        0.6404619812965393,
        0.17153722047805786,
        -0.09523764252662659,
        0.3618485927581787,
        0.304597944021225,
        0.39231735467910767,
        0.06669917702674866,
        0.49570974707603455,
        0.14138516783714294,
        -0.366436243057251,
        0.3266203999519348,
        0.4225537180900574,
        0.6189994215965271,
        0.06701259315013885,
        0.17901010811328888,
        0.26593318581581116,
        0.030602140352129936,
        -0.008546042256057262,
        -0.185250923037529,
        0.05015800893306732,
        0.2579885423183441,
        -0.39947834610939026,
        -0.08726868778467178,
        0.40284714102745056,
        -0.5497708916664124,
        0.18205879628658295,
        0.2038114070892334,
        0.3225843608379364,
        0.19315463304519653,
        0.03810689598321915,
        0.05361699312925339,
        -0.42670324444770813,
        -0.7451144456863403,
        0.2402442991733551,
        0.3031528890132904,
        0.1208658441901207,
        -0.2245730310678482,
        0.154502272605896,
        -0.39479124546051025,
        -0.5025991797447205,
        -0.5992611646652222,
        0.5050654411315918,
        0.11725237220525742,
        0.38482019305229187,
        0.10878517478704453,
        0.07657692581415176,
        0.25941482186317444,
        0.08879024535417557,
        0.6326189637184143,
        0.25046035647392273,
        -0.2752217948436737,
        -0.4966989755630493,
        -0.11616680771112442,
        0.2986089289188385,
        0.12472978979349136,
        0.05252975597977638,
        -0.04092566668987274,
        -0.2513134479522705,
        0.6569960117340088,
        -0.5505943894386292,
        -0.25361597537994385,
        -0.04736391082406044,
        0.3986196517944336,
        0.34805184602737427,
        0.16446076333522797,
        0.5355425477027893,
        0.36259597539901733,
        0.23771844804286957,
        0.39490529894828796,
        0.12046850472688675,
        -0.01236127782613039,
        0.2347964346408844,
        -0.5374065637588501,
        0.4881879985332489,
        0.14966726303100586,
        -0.08120444416999817,
        0.12968628108501434,
        -0.02523442730307579,
        0.26641571521759033,
        0.16579456627368927,
        -0.05341726168990135,
        -0.23570996522903442,
        0.1893625408411026,
        -0.09356608241796494,
        0.3616220951080322,
        0.3080061376094818,
        -0.2451193928718567,
        -0.2835913300514221,
        -0.04504776373505592,
        0.02045142836868763,
        0.03566034510731697,
        0.5236368775367737,
        0.6103847026824951,
        0.5361908078193665,
        0.19217562675476074,
        0.014733272604644299,
        -0.08324345201253891,
        0.11868468672037125,
        0.03766956552863121,
        0.11466225981712341,
        -0.22394879162311554,
        -0.06678860634565353,
        -0.13630980253219604,
        -0.1892332136631012,
        0.1236775740981102,
        -0.06622474640607834,
        -0.26610055565834045,
        0.0608646534383297,
        -0.38381877541542053,
        -0.09593655169010162,
        -0.11489073187112808,
        0.3180132508277893,
        0.12075958400964737,
        -0.3802536129951477,
        -0.03477351367473602,
        0.12871019542217255,
        0.31590479612350464,
        -0.0673033744096756,
        -0.0629415288567543,
        -0.28096267580986023,
        -0.3859238624572754,
        0.06806056946516037,
        0.0456894114613533,
        -0.11327999830245972,
        -0.50279301404953,
        0.22289177775382996,
        -0.6470568776130676,
        -0.5289459824562073,
        -0.7067698240280151,
        -0.3392413556575775,
        -0.29342272877693176,
        0.0622529461979866,
        -0.030495047569274902,
        0.3224811553955078,
        0.3425777554512024,
        0.26510265469551086,
        0.106537826359272,
        0.5831528902053833,
        -0.006060438230633736,
        -0.26800537109375,
        -0.22496646642684937,
        -0.4160420298576355,
        -0.05037987604737282,
        -0.6471366882324219,
        -0.1116037666797638,
        0.15263506770133972,
        0.3458419144153595,
        -0.523250162601471,
        0.06237594038248062,
        -0.1611512303352356,
        0.10522059351205826,
        0.23021122813224792,
        0.07886842638254166,
        0.24229659140110016,
        -0.27717211842536926,
        0.02525937184691429,
        -0.142952561378479,
        -0.42838701605796814,
        0.45560798048973083,
        -0.5336139798164368,
        0.4451330900192261,
        0.15528275072574615,
        -0.07013660669326782,
        -0.38237884640693665,
        -0.17390738427639008,
        0.28930726647377014,
        0.06580822914838791,
        0.11869443207979202,
        0.5835973620414734,
        0.01511385291814804,
        -0.08984120190143585,
        -0.18422523140907288,
        0.032952915877103806,
        -0.3761399984359741,
        0.20253440737724304,
        0.0849054828286171,
        -0.32918432354927063,
        0.14133904874324799,
        0.18102209270000458,
        0.250529408454895,
        -0.30248120427131653,
        0.22670574486255646,
        0.2906627058982849,
        -0.13039153814315796,
        -0.18954472243785858,
        -0.021991971880197525,
        0.1105785071849823,
        -0.34738627076148987,
        0.020895952358841896,
        -0.2001706063747406,
        0.06158057972788811,
        -0.14873142540454865,
        -0.38290169835090637,
        -0.1174514889717102,
        0.1666739583015442,
        0.060729674994945526,
        -0.1854274868965149,
        -0.12107867002487183,
        0.07240194082260132,
        -0.022539617493748665,
        -0.04003763198852539,
        0.08714981377124786,
        -0.2541904151439667,
        -0.3090267479419708,
        0.5481564402580261,
        -0.042395833879709244,
        -0.299652099609375,
        -0.008449931629002094,
        -0.06995467096567154,
        0.08064249157905579,
        0.35207122564315796,
        0.3826013207435608,
        0.3267882764339447,
        0.08404964208602905,
        -0.5991575121879578,
        -0.41492196917533875,
        -0.11050098389387131,
        0.5822426676750183,
        0.08839412033557892,
        0.19639723002910614,
        -0.16851672530174255,
        0.31165915727615356,
        -0.39505839347839355,
        -0.005922039970755577,
        0.3313928544521332,
        0.1804148554801941,
        -0.8555760979652405,
        -0.0680457204580307,
        -0.4808577001094818,
        -0.08366488665342331,
        -0.18121924996376038,
        0.17312777042388916,
        0.003999317530542612,
        -0.6577029228210449,
        -0.26377302408218384,
        -0.08218754827976227,
        0.30548229813575745,
        0.3403676450252533,
        -0.0652158260345459,
        -0.4821787476539612,
        -0.2936175465583801,
        0.2914998531341553,
        0.08899730443954468,
        -0.3053871691226959,
        0.0010414939606562257,
        -0.0769486054778099,
        0.09780552238225937,
        0.018086064606904984,
        -0.19993342459201813,
        -0.3457120954990387,
        -0.3366619348526001,
        0.18107573688030243,
        -0.22737836837768555,
        -0.12931223213672638,
        -0.046235110610723495,
        -0.327683687210083,
        -0.3950521945953369,
        0.14184178411960602,
        0.5658863186836243,
        -0.09094864875078201,
        0.36560767889022827,
        -0.19930140674114227,
        0.032526012510061264,
        0.039624687284231186,
        0.28285834193229675,
        -0.0700683668255806,
        -0.04719194397330284,
        0.016989581286907196,
        -0.20609703660011292,
        -0.48796361684799194,
        -0.03585720807313919,
        0.08311860263347626,
        -0.20705583691596985,
        0.07112884521484375,
        -0.4526008665561676,
        -0.08142995089292526,
        -0.45790085196495056,
        -0.041655778884887695,
        -0.26390790939331055,
        0.1456748992204666,
        -0.3060082495212555,
        -0.2282172441482544,
        -0.6523599624633789,
        -0.5229090452194214,
        -0.144794762134552,
        -0.40196695923805237,
        0.22467780113220215,
        0.19093529880046844,
        0.4324277341365814,
        -0.07579892128705978,
        0.07015661895275116,
        0.15932834148406982,
        -0.23125533759593964,
        0.4214455783367157,
        -0.3153155446052551,
        -0.4985721707344055,
        -0.027621880173683167,
        -0.12597891688346863,
        -0.3805937170982361,
        0.20152907073497772,
        -0.3641051948070526,
        0.041499245911836624,
        0.23718297481536865,
        -0.2979329824447632,
        -0.058835696429014206,
        0.1754409521818161,
        0.17502756416797638,
        -0.8501350283622742,
        0.05273383483290672,
        -0.04132485389709473,
        0.19989103078842163,
        0.36569899320602417,
        0.11421389132738113,
        0.3197604715824127,
        0.24957583844661713,
        -0.4218449592590332,
        0.22978845238685608,
        -0.28277337551116943,
        0.2632821798324585,
        0.1612248420715332,
        0.08086857944726944,
        0.014315993525087833,
        0.030896153301000595,
        -0.5553945302963257,
        -0.09466835856437683,
        -0.04372181370854378,
        -0.3697335124015808,
        0.3898433744907379,
        0.13538040220737457,
        -0.3586937487125397,
        0.2576017379760742,
        0.23953552544116974,
        0.12885476648807526,
        -0.26682862639427185,
        0.28538909554481506,
        0.48480603098869324,
        -0.5113964676856995,
        0.2333090603351593,
        0.17856921255588531,
        -0.06751059740781784,
        -0.2547168433666229,
        -0.6088666915893555,
        0.4181840121746063,
        0.0755990520119667,
        0.09509674459695816,
        -0.37840548157691956,
        0.02907872200012207,
        -0.5149112939834595,
        -0.022659294307231903,
        0.2087574601173401,
        -0.4405423402786255,
        0.06131354346871376,
        -0.4374189078807831,
        -0.06984157860279083,
        -0.1424603909254074,
        -0.10439488291740417,
        -0.0926433727145195,
        0.128648042678833,
        0.23493000864982605,
        0.00653468444943428,
        -0.34790927171707153,
        -0.17678989470005035,
        0.4774779677391052,
        -0.1613653600215912,
        0.2715167701244354,
        -0.03238620236515999,
        0.007123074494302273,
        0.06827977299690247,
        -0.15488646924495697,
        0.14672498404979706,
        -0.29709020256996155,
        0.09908542037010193,
        0.38523998856544495,
        0.07166268676519394,
        0.05723050981760025,
        -0.7153913974761963,
        0.03142348676919937,
        0.22504012286663055,
        -0.998414933681488,
        0.18159855902194977,
        0.29940661787986755,
        0.06994415819644928,
        -0.29085955023765564,
        0.1884269416332245,
        0.9088974595069885,
        0.01793280616402626,
        0.4510326087474823,
        0.1252623349428177,
        0.24736426770687103,
        0.6132815480232239,
        -0.5135237574577332,
        -0.27148139476776123,
        -0.2358490526676178,
        -0.6006590723991394,
        0.5589520931243896,
        0.23787356913089752,
        -0.005377006717026234,
        -0.0770166888833046,
        -0.9203644394874573,
        -0.09641201049089432,
        -0.0626131072640419,
        0.08316700160503387,
        -0.2069849818944931,
        -0.014642138965427876,
        -0.1880844384431839,
        -0.07380013167858124,
        -0.17929907143115997,
        -0.21092438697814941,
        0.29723498225212097,
        -0.34894269704818726,
        -0.19065947830677032,
        0.29503899812698364,
        -0.007859169505536556,
        -0.042053136974573135,
        0.11256906390190125,
        0.8005378842353821,
        -0.45499926805496216,
        0.15793883800506592,
        -0.6372964382171631,
        0.09717530757188797,
        -0.22043053805828094,
        -0.1759423166513443,
        -0.19640353322029114,
        -0.25969409942626953,
        -0.34920862317085266,
        0.12991300225257874,
        0.07894443720579147,
        0.49498647451400757,
        0.07546113431453705,
        0.38264796137809753,
        -0.5365212559700012,
        0.5320967435836792,
        -0.015398682095110416,
        -0.28428494930267334,
        0.26356202363967896,
        0.3836084008216858,
        -0.20781901478767395,
        0.3108764886856079,
        -0.23606809973716736,
        0.1519928276538849,
        -0.08512569963932037,
        -0.2858959436416626,
        -0.04066680744290352,
        0.25656527280807495,
        0.11285186558961868,
        0.5683954954147339,
        0.0964580848813057,
        -0.5973666310310364,
        -0.11073027551174164,
        0.14446084201335907,
        0.16511312127113342,
        0.15029935538768768,
        -0.09549172967672348,
        -0.20079655945301056,
        0.20767508447170258,
        -0.30959460139274597,
        0.24908556044101715,
        -0.3572149872779846,
        -0.23928025364875793,
        0.0779864713549614,
        0.052691709250211716,
        0.6160352230072021,
        -0.18152810633182526,
        -0.07483314722776413,
        -0.285849004983902,
        -0.7786368727684021,
        0.41844549775123596,
        0.09764312207698822,
        -0.16476142406463623,
        0.4742525517940521,
        -0.20680569112300873,
        0.31567102670669556,
        -0.4228353798389435,
        -0.45000216364860535,
        -0.49416202306747437,
        0.17732027173042297,
        -0.17807729542255402,
        -0.2608951926231384,
        0.013868903741240501,
        -0.07179523259401321,
        -0.028728848323225975,
        -0.1973513811826706,
        -0.2670098543167114,
        0.19302478432655334,
        0.09226833283901215,
        0.003619530936703086,
        -0.3956046402454376,
        0.08291260898113251,
        0.05745437368750572,
        0.23220013082027435,
        0.5326778292655945,
        -0.24183399975299835,
        -0.03540068864822388,
        0.29706650972366333,
        0.1482125073671341,
        -0.1623462438583374,
        0.34887248277664185,
        0.23783303797245026,
        0.2248823046684265,
        0.11622220277786255,
        0.3369385600090027,
        -0.3587534427642822,
        0.36852291226387024,
        0.6428318619728088,
        -0.5325366854667664,
        0.36897581815719604,
        0.08394063264131546,
        0.07047270983457565,
        -0.20465709269046783,
        -0.4209097623825073,
        -0.06973835825920105,
        -0.3088344633579254,
        0.026269596070051193,
        0.09042716771364212,
        -0.6091305613517761,
        0.042570795863866806,
        -0.24029041826725006,
        -0.315189927816391,
        0.6379392147064209,
        0.28434979915618896,
        -0.1507146656513214,
        0.2031954824924469,
        -0.14542746543884277,
        0.1879754364490509,
        -0.12032481282949448,
        0.3120920956134796,
        0.4010109007358551,
        -0.14155100286006927,
        -0.2830982208251953,
        -0.31810078024864197,
        -0.2096754014492035,
        -0.20897157490253448,
        -0.10235083103179932,
        -0.19135023653507233,
        0.5127451419830322,
        -0.11197273433208466,
        -0.3128531873226166,
        0.07503236085176468,
        0.44400426745414734,
        0.05353428050875664,
        -0.2088140994310379,
        0.306984543800354,
        -0.12161317467689514,
        0.16324417293071747,
        -0.04724736511707306,
        0.30692288279533386,
        0.9010582566261292,
        -0.32152196764945984,
        0.33857011795043945,
        0.4482300579547882,
        -0.10123889893293381,
        0.1179395243525505,
        -0.24484124779701233,
        -0.05358195677399635,
        0.45955488085746765,
        -0.3112233877182007,
        -0.20290181040763855,
        0.03655760735273361,
        0.01171685941517353,
        -0.011286524124443531,
        1.1759991645812988,
        0.014093809761106968,
        -0.060005027800798416,
        0.06684637814760208,
        0.11604785174131393,
        0.4410174787044525,
        0.008223150856792927,
        0.43960461020469666,
        -0.5135762691497803,
        -0.3201627731323242,
        0.23387768864631653,
        -0.9909043312072754,
        0.8611873984336853,
        0.2831089198589325,
        0.9269634485244751,
        0.012280292809009552,
        0.12260430306196213,
        0.3309246003627777,
        -0.15269707143306732,
        -0.09613234549760818,
        -0.6258176565170288,
        -0.7350968718528748,
        0.33909693360328674,
        0.18223601579666138,
        -0.16697479784488678,
        -0.1266157627105713,
        0.4046129286289215,
        0.5424481630325317,
        0.6741519570350647,
        -0.16885361075401306,
        -0.05122481286525726,
        0.5240015983581543,
        -0.05699770152568817,
        -0.18761102855205536,
        -0.448729932308197,
        0.35954052209854126,
        0.5881726145744324,
        0.012817421928048134,
        0.22483372688293457,
        0.12794804573059082,
        0.019872764125466347,
        -0.09328904747962952,
        -0.30330657958984375,
        -0.298117995262146,
        1.09945809841156,
        0.05174698308110237,
        -0.16522642970085144,
        -0.20729483664035797,
        -0.5669388771057129,
        0.1314239650964737,
        0.4112139642238617,
        -0.40897902846336365,
        0.0712156817317009,
        -0.5083450675010681,
        -0.42498472332954407,
        -0.30452513694763184,
        -1.072400450706482,
        0.44976165890693665,
        0.021161025390028954,
        -0.031091060489416122,
        -0.45665767788887024,
        -0.33537206053733826,
        -0.4993923306465149
      ]
    },
    {
      "name": "dense_Dense1/bias",
      "shape": [
        64
      ],
      "dtype": "float32",
      "data": [
        -0.010122307576239109,
        -0.01254956517368555,
        0.035469695925712585,
        -0.0348004512488842,
        -0.046168774366378784,
        -0.09812620282173157,
        0.022193586453795433,
        0.017254890874028206,
        -0.16161838173866272,
        0.014068949036300182,
        -0.059256862848997116,
        0.07488328218460083,
        0.03293483331799507,
        0.058030255138874054,
        0.07677888125181198,
        0.15960441529750824,
        -0.047430023550987244,
        0.0034279508981853724,
        0.028267936781048775,
        0.03707904741168022,
        0.056498244404792786,
        0.02236819826066494,
        0.11423853039741516,
        0.055983733385801315,
        0.0850701853632927,
        0.0017610478680580854,
        0.0807839035987854,
        0.0781790167093277,
        -0.07137870043516159,
        0.023677004501223564,
        -0.12627266347408295,
        -0.0549127422273159,
        -0.10033156722784042,
        -0.02809726819396019,
        -0.05315539240837097,
        0.056428804993629456,
        -0.013514173217117786,
        -0.007447354029864073,
        0.03087206929922104,
        0.07472218573093414,
        -0.11057919263839722,
        -0.0319477804005146,
        0.043333832174539566,
        0.036458566784858704,
        0.04063202068209648,
        0.046664971858263016,
        -0.00022892234846949577,
        0.07406064122915268,
        0.047831449657678604,
        0.018156791105866432,
        -0.0931774154305458,
        -0.0036623121704906225,
        0.03178757056593895,
        -0.11513478308916092,
        -0.10408984124660492,
        -0.05417148768901825,
        -0.072903573513031,
        0.09623076766729355,
        -0.07648506760597229,
        -0.019411928951740265,
        0.08579263836145401,
        0.0500144399702549,
        0.010040977969765663,
        0.03211618959903717
      ]
    },
    {
      "name": "dense_Dense2/kernel",
      "shape": [
        64,
        32
      ],
      "dtype": "float32",
      "data": [
        -0.5242552161216736,
        0.0456794910132885,
        0.2448716163635254,
        -0.32462558150291443,
        0.34732502698898315,
        -0.34485796093940735,
        0.16890108585357666,
        0.03286908566951752,
        -0.28721481561660767,
        -0.504116952419281,
        -0.22625632584095,
        -0.15733513236045837,
        0.4473522901535034,
        -0.23061232268810272,
        -0.3341430723667145,
        -0.13322663307189941,
        -0.06460225582122803,
        0.12914450466632843,
        0.14943590760231018,
        -0.01672068051993847,
        0.08819318562746048,
        -0.2736082673072815,
        -0.10432366281747818,
        -0.33137327432632446,
        -0.017162498086690903,
        0.05719044804573059,
        0.377742737531662,
        -0.014265098609030247,
        0.10026522725820541,
        0.10791542381048203,
        -0.15003997087478638,
        -0.2931128144264221,
        0.07827112823724747,
        0.3425130248069763,
        -0.1474205106496811,
        0.2202889621257782,
        -0.05695033818483353,
        0.41392919421195984,
        -0.6691688299179077,
        0.007665423676371574,
        0.5059372186660767,
        0.34690651297569275,
        -0.1761767864227295,
        -0.09970622509717941,
        -0.6128196716308594,
        0.14682132005691528,
        0.32942694425582886,
        0.10649315267801285,
        0.2630143165588379,
        0.11643709987401962,
        0.03600866347551346,
        -0.04965848848223686,
        0.008745413273572922,
        0.01184631884098053,
        0.05784251168370247,
        -0.19036240875720978,
        0.5318034291267395,
        0.3417907655239105,
        -0.5451128482818604,
        -0.009880407713353634,
        0.024169426411390305,
        0.12920868396759033,
        0.09691190719604492,
        0.07125172019004822,
        0.12069886922836304,
        -0.02799127623438835,
        0.019839823246002197,
        0.23228345811367035,
        -0.044305022805929184,
        0.1676633656024933,
        -0.3334802985191345,
        -0.05363330990076065,
        -0.016731824725866318,
        0.2619546949863434,
        -0.32255157828330994,
        0.08334105461835861,
        -0.04298190772533417,
        0.12300080806016922,
        0.2736307382583618,
        0.3146304488182068,
        0.0858023390173912,
        0.3965683579444885,
        0.005056113936007023,
        -0.17314711213111877,
        0.03217639401555061,
        0.006445721257477999,
        -0.08080092072486877,
        -0.32607021927833557,
        0.06908689439296722,
        0.2077467143535614,
        -0.24285279214382172,
        -0.07276801019906998,
        0.08550600707530975,
        0.041748903691768646,
        -0.14628148078918457,
        0.12276075035333633,
        0.026705142110586166,
        -0.1101415753364563,
        0.16333849728107452,
        -0.09414191544055939,
        -0.017420146614313126,
        0.016384555026888847,
        0.1026453971862793,
        -0.4434163570404053,
        0.07718569785356522,
        0.3901016116142273,
        -0.12957033514976501,
        0.08094201236963272,
        0.1690913885831833,
        -0.03486652299761772,
        0.0178728885948658,
        -0.10957670211791992,
        -0.12068364769220352,
        0.04942963644862175,
        0.04673496261239052,
        -0.16095826029777527,
        0.04038405418395996,
        0.03182213008403778,
        0.08015232533216476,
        -0.04187685623764992,
        0.3040010631084442,
        0.36521264910697937,
        0.056754764169454575,
        -0.003209058428183198,
        0.313005268573761,
        0.0730937123298645,
        -0.1752503216266632,
        -0.05153925344347954,
        -0.2782731056213379,
        0.2851684093475342,
        -0.13894012570381165,
        -0.11288117617368698,
        0.044865887612104416,
        -0.15027867257595062,
        0.49322494864463806,
        -0.27612996101379395,
        0.0055808424949646,
        -0.21147431433200836,
        -0.017268091440200806,
        0.2990661561489105,
        0.3784903585910797,
        -0.03161723166704178,
        -0.2703566551208496,
        0.3110412657260895,
        -0.051088057458400726,
        0.04545997455716133,
        -0.2886144518852234,
        -0.1993735134601593,
        -0.1200212761759758,
        0.06238706782460213,
        0.2329983115196228,
        -0.061976537108421326,
        -0.22405245900154114,
        -0.09132089465856552,
        0.4781118929386139,
        -0.19652117788791656,
        0.3914226293563843,
        -0.24980942904949188,
        -0.22045208513736725,
        -0.38109922409057617,
        -0.10571663081645966,
        0.04099692404270172,
        -0.3615421950817108,
        0.11732939630746841,
        0.04733831435441971,
        0.0750119686126709,
        -0.19034935534000397,
        -0.15140192210674286,
        -0.058057427406311035,
        0.05767322704195976,
        0.15217627584934235,
        -0.028252270072698593,
        -0.19801224768161774,
        0.07915912568569183,
        -0.08216369152069092,
        -0.29131844639778137,
        0.175863578915596,
        -0.011536618694663048,
        -0.5695614218711853,
        -0.037916041910648346,
        0.2955136001110077,
        0.2418522834777832,
        -0.16544011235237122,
        -0.12748360633850098,
        0.13434888422489166,
        0.0012161452323198318,
        -0.11694018542766571,
        -0.36511003971099854,
        -0.060330431908369064,
        -0.19456256926059723,
        -0.018630634993314743,
        -0.14820384979248047,
        -0.17655213177204132,
        0.10569867491722107,
