{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        15,
        128
      ],
      "dtype": "float32",
      "data": [
        -12.636911392211914,
        4.806293487548828,
        -0.44303178787231445,
        4.4288411140441895,
        3.870410203933716,
        -0.9492088556289673,
        -1.034893274307251,
        0.33083462715148926,
        -1.4568661451339722,
        5.698472499847412,
        6.208098411560059,
        0.7409540414810181,
        -0.26183798909187317,
        2.6226646900177,
        -0.01762072555720806,
        -8.645970344543457,
        -0.4127845764160156,
        1.1038874387741089,
        0.71787428855896,
        4.157679080963135,
        -0.018201351165771484,
        3.5368030071258545,
        -1.4423625469207764,
        5.030940532684326,
        4.702353477478027,
        -0.37392985820770264,
        1.07673978805542,
        -2.123619318008423,
        -1.2143906354904175,
        4.7493767738342285,
        -1.507307767868042,
        0.9163900017738342,
        4.400363922119141,
        5.079158306121826,
        1.3416109085083008,
        1.5684301853179932,
        0.5428829789161682,
        3.6736886501312256,
        0.7854203581809998,
        3.6938788890838623,
        -0.3173302412033081,
        0.7065991759300232,
        5.055028915405273,
        -2.7505557537078857,
        0.93194979429245,
        1.513677954673767,
        0.6680037975311279,
        -2.036173105239868,
        0.4232475459575653,
        3.691136121749878,
        -2.328038454055786,
        2.0183968544006348,
        -1.394237995147705,
        -0.9793469905853271,
        -2.8082263469696045,
        -1.233274221420288,
        2.4335851669311523,
        -0.8709205389022827,
        -3.8216593265533447,
        -1.6526790857315063,
        -1.0725384950637817,
        0.2324012964963913,
        3.714885950088501,
        3.853205919265747,
        0.5601091980934143,
        -1.2427018880844116,
        -11.06178092956543,
        0.6099218130111694,
        1.1470698118209839,
        4.464169502258301,
        -0.29162946343421936,
        5.092525959014893,
        -1.0996700525283813,
        0.8463889360427856,
        -1.3742388486862183,
        -1.0541499853134155,
        0.29748663306236267,
        3.8888654708862305,
        4.1035847663879395,
        -6.140819072723389,
        -0.8491063714027405,
        -5.429647445678711,
        -0.24656687676906586,
        0.6189619302749634,
        0.41540682315826416,
        2.6614677906036377,
        0.1768183708190918,
        -12.358891487121582,
        0.9168834686279297,
        -5.706171035766602,
        5.313079833984375,
        -0.30575236678123474,
        0.6270220875740051,
        0.1995459347963333,
        -1.0169605016708374,
        -1.6426949501037598,
        1.464332938194275,
        0.48757973313331604,
        -0.4717005789279938,
        -0.40903598070144653,
        -0.9354363679885864,
        -5.3349928855896,
        3.9182374477386475,
        -1.256546139717102,
        -12.092370986938477,
        -1.4329731464385986,
        -0.6107076406478882,
        0.34633904695510864,
        -0.09063734859228134,
        -0.8131933212280273,
        -0.5625120401382446,
        0.7963286638259888,
        0.9352198243141174,
        0.24043147265911102,
        2.1607983112335205,
        -13.427367210388184,
        7.937565326690674,
        0.4708895981311798,
        1.0166295766830444,
        1.1099398136138916,
        -12.962198257446289,
        5.759277820587158,
        -0.37893325090408325,
        -0.06863193958997726,
        -0.24241267144680023,
        0.7750457525253296,
        3.162904739379883,
        1.0260435342788696,
        -10.167156219482422,
        6.731466293334961,
        -2.9942591190338135,
        4.82231330871582,
        6.239135265350342,
        -4.384580612182617,
        -3.1088929176330566,
        -0.062335193157196045,
        -3.301569700241089,
        6.178309440612793,
        7.997497081756592,
        1.2063068151474,
        -0.9726508259773254,
        1.2439626455307007,
        -8.609724044799805,
        -7.329878807067871,
        -2.5732812881469727,
        0.6683345437049866,
        2.5805325508117676,
        5.851071834564209,
        -2.9506418704986572,
        5.180095672607422,
        0.9341371655464172,
        7.045460224151611,
        6.109279632568359,
        -3.103611707687378,
        2.6314406394958496,
        -2.5698931217193604,
        -3.1943047046661377,
        6.611410140991211,
        -2.8619956970214844,
        0.0028519118204712868,
        3.8434205055236816,
        6.096647262573242,
        -0.42097949981689453,
        -0.6167975068092346,
        -2.076097011566162,
        5.5475993156433105,
        -1.9745471477508545,
        4.415772438049316,
        -0.8083991408348083,
        2.1412761211395264,
        7.22893762588501,
        -1.5210751295089722,
        -2.138343572616577,
        1.983860969543457,
        -1.795456051826477,
        -2.4163804054260254,
        -2.3292343616485596,
        5.900928020477295,
        -3.371316909790039,
        3.7767679691314697,
        -3.1210825443267822,
        -3.234159231185913,
        -2.863797903060913,
        -2.104877233505249,
        4.2019877433776855,
        -2.653813123703003,
        -4.332319736480713,
        -3.155707359313965,
        -1.785948634147644,
        -0.05042371526360512,
        5.745376110076904,
        6.149521827697754,
        -0.1544780135154724,
        -2.828049659729004,
        -10.523604393005371,
        -2.343358278274536,
        0.7511223554611206,
        6.520127296447754,
        -2.4224188327789307,
        6.265238285064697,
        -2.0246825218200684,
        0.018137553706765175,
        -2.330247640609741,
        -6.379608154296875,
        -0.15151441097259521,
        1.7847563028335571,
        6.543577194213867,
        -3.7761425971984863,
        -3.2027440071105957,
        -4.133844375610352,
        0.09473521262407303,
        -2.6586453914642334,
        -0.34676802158355713,
        2.8041489124298096,
        -1.1366642713546753,
        -10.258258819580078,
        0.05415518209338188,
        -3.4207189083099365,
        8.041363716125488,
        -2.2085988521575928,
        2.0747580528259277,
        0.25542140007019043,
        -2.4469356536865234,
        -2.665410041809082,
        1.5788872241973877,
        -3.5090010166168213,
        -2.594060182571411,
        -2.48749041557312,
        -3.15226411819458,
        -3.8913323879241943,
        5.969944953918457,
        -2.9642093181610107,
        -10.451568603515625,
        -3.3364381790161133,
        -1.430853247642517,
        0.093264140188694,
        -2.9705169200897217,
        -2.7342474460601807,
        -0.6641731262207031,
        -0.26190420985221863,
        0.37410879135131836,
        -2.6739165782928467,
        3.307593822479248,
        -10.228466033935547,
        2.2002811431884766,
        -2.807321071624756,
        -2.1129140853881836,
        -3.352391481399536,
        -10.269170761108398,
        6.798121452331543,
        1.2741450071334839,
        0.16858956217765808,
        -2.492581605911255,
        0.14329005777835846,
        3.699972629547119,
        2.528046131134033,
        -13.966506958007812,
        -2.4232821464538574,
        7.979220390319824,
        -1.8139848709106445,
        -1.6585166454315186,
        -3.194469451904297,
        4.427582263946533,
        4.277253150939941,
        5.195179462432861,
        -2.667327642440796,
        -2.362262725830078,
        2.394376516342163,
        12.493849754333496,
        0.051033951342105865,
        6.635642051696777,
        -4.412109851837158,
        3.182004928588867,
        2.5623843669891357,
        -1.6780706644058228,
        -1.6438239812850952,
        7.945632457733154,
        -0.699812114238739,
        6.478641510009766,
        -2.1514813899993896,
        -2.249126672744751,
        6.886091232299805,
        2.1253631114959717,
        3.405240058898926,
        5.2325544357299805,
        -0.9117622375488281,
        4.373388767242432,
        3.301072835922241,
        12.507586479187012,
        -1.6301922798156738,
        -0.24667556583881378,
        5.2313055992126465,
        1.7199654579162598,
        -1.8679108619689941,
        6.448838710784912,
        0.030670493841171265,
        -0.63409423828125,
        -1.4822049140930176,
        -2.447523593902588,
        1.7616170644760132,
        6.475817680358887,
        1.6808604001998901,
        8.056352615356445,
        7.031389236450195,
        7.6797614097595215,
        -1.6294052600860596,
        5.434054374694824,
        1.8329685926437378,
        7.765552520751953,
        7.128523349761963,
        5.657472133636475,
        8.790243148803711,
        -1.9393717050552368,
        6.398599624633789,
        -5.39439582824707,
        8.388592720031738,
        10.79808521270752,
        -0.029079999774694443,
        -1.3656237125396729,
        -2.2054476737976074,
        3.1732826232910156,
        4.569107532501221,
        -12.77750301361084,
        7.08349084854126,
        3.000803232192993,
        -1.8646444082260132,
        8.847728729248047,
        -2.1827776432037354,
        9.3045015335083,
        3.0312764644622803,
        5.5431227684021,
        5.415251731872559,
        3.1828179359436035,
        7.471768856048584,
        -1.8017616271972656,
        0.8623939156532288,
        4.176061153411865,
        0.4609242379665375,
        -0.38865646719932556,
        8.142385482788086,
        3.256073474884033,
        -1.191205382347107,
        0.6668031215667725,
        -5.221378326416016,
        2.896085739135742,
        -7.715522766113281,
        -2.279118299484253,
        9.086771011352539,
        -1.4472991228103638,
        -0.39216384291648865,
        7.684556484222412,
        6.3519287109375,
        1.8498866558074951,
        7.309107780456543,
        3.7001771926879883,
        3.2414803504943848,
        8.781522750854492,
        0.8497867584228516,
        -2.107999563217163,
        6.608740329742432,
        -14.650540351867676,
        5.3976311683654785,
        3.7963781356811523,
        3.0105695724487305,
        2.3237626552581787,
        8.482490539550781,
        10.736176490783691,
        3.1011340618133545,
        3.2089786529541016,
        3.2912564277648926,
        -1.6807971000671387,
        -14.588770866394043,
        13.851564407348633,
        8.676586151123047,
        10.115586280822754,
        8.64832878112793,
        -14.223801612854004,
        -2.034302234649658,
        3.262803792953491,
        0.013884345069527626,
        7.115324974060059,
        4.733819484710693,
        -1.040869951248169,
        -1.3929505348205566,
        -16.258872985839844,
        -3.138735294342041,
        8.70638370513916,
        -2.0959882736206055,
        -2.166700839996338,
        -3.702763557434082,
        1.1073890924453735,
        3.6622886657714844,
        4.382378101348877,
        -2.271761894226074,
        -3.0783743858337402,
        2.648970603942871,
        10.356438636779785,
        -1.3419564962387085,
        7.36414909362793,
        -17.16058349609375,
        3.7307043075561523,
        3.4210734367370605,
        -1.7665196657180786,
        -2.3416106700897217,
        9.157499313354492,
        -1.233567476272583,
        5.765052318572998,
        -3.3943400382995605,
        3.8797640800476074,
        8.189671516418457,
        2.3037025928497314,
        4.721104621887207,
        3.3046345710754395,
        -1.0142163038253784,
        4.715069770812988,
        3.3669779300689697,
        11.021370887756348,
        -2.2304978370666504,
        -0.4199768006801605,
        5.103429317474365,
        1.568770170211792,
        -2.1654725074768066,
        8.147550582885742,
        0.5075688362121582,
        -0.6133882403373718,
        -1.4494892358779907,
        -2.9229025840759277,
        1.9763833284378052,
        7.833416938781738,
        1.8887114524841309,
        7.767523765563965,
        7.684638977050781,
        8.643464088439941,
        -1.8401283025741577,
        7.530855655670166,
        2.5538456439971924,
        8.951277732849121,
        7.873723030090332,
        6.665307521820068,
        8.355718612670898,
        -2.292891263961792,
        6.98243522644043,
        -8.901543617248535,
        9.345294952392578,
        11.70384693145752,
        -0.24824337661266327,
        -1.9549415111541748,
        -2.5893664360046387,
        3.440779447555542,
        5.73052978515625,
        -15.301490783691406,
        7.923656940460205,
        3.320573568344116,
        -2.6009016036987305,
        9.159141540527344,
        -2.369835615158081,
        11.60709285736084,
        3.2722275257110596,
        6.243587493896484,
        6.040654182434082,
        5.666755199432373,
        8.683940887451172,
        -2.5754570960998535,
        1.358278512954712,
        4.330394268035889,
        0.7276282906532288,
        0.05031207948923111,
        8.314120292663574,
        3.6176910400390625,
        1.3514231443405151,
        0.17482459545135498,
        -18.86421775817871,
        3.6858012676239014,
        -9.890900611877441,
        -3.267885684967041,
        9.195786476135254,
        -1.47806715965271,
        -0.041849568486213684,
        8.364350318908691,
        6.731249809265137,
        2.347855806350708,
        7.906421184539795,
        3.9549789428710938,
        3.919273853302002,
        9.104413986206055,
        0.7725187540054321,
        -2.601902723312378,
        7.931502342224121,
        -10.925785064697266,
        5.347679138183594,
        4.114405632019043,
        2.5328903198242188,
        2.4107632637023926,
        8.482610702514648,
        9.907281875610352,
        3.3686630725860596,
        3.0660619735717773,
        3.0430104732513428,
        -1.838536024093628,
        -16.99111557006836,
        10.651573181152344,
        10.376534461975098,
        11.395713806152344,
        10.894386291503906,
        -16.549028396606445,
        -3.0439209938049316,
        4.74506950378418,
        0.0865631029009819,
        8.100106239318848,
        3.8286378383636475,
        -0.696528971195221,
        -1.469959020614624,
        -21.535982131958008,
        -0.6641764044761658,
        5.214434623718262,
        0.31802570819854736,
        -0.533637285232544,
        -5.932174205780029,
        2.596243143081665,
        2.1071043014526367,
        -2.1344211101531982,
        -0.7927685379981995,
        -0.002325691282749176,
        2.359119176864624,
        8.4879732131958,
        -0.03558666259050369,
        4.757730960845947,
        -6.720250129699707,
        2.8716049194335938,
        1.8087364435195923,
        -1.4312701225280762,
        -0.4648294150829315,
        5.861996650695801,
        -0.7223506569862366,
        4.04020881652832,
        -0.8713609576225281,
        3.0096232891082764,
        5.8207197189331055,
        1.4346028566360474,
        1.6136609315872192,
        3.670407295227051,
        -0.11551178246736526,
        2.6684210300445557,
        1.5628907680511475,
        6.672157287597656,
        -0.45852309465408325,
        0.20436270534992218,
        3.495659589767456,
        1.757684588432312,
        2.186434507369995,
        4.759781837463379,
        3.2741036415100098,
        0.12875863909721375,
        -0.7840161323547363,
        -0.3770740032196045,
        2.7217178344726562,
        4.987964630126953,
        1.4578278064727783,
        5.795126914978027,
        7.676619529724121,
        5.294306755065918,
        -0.6364387273788452,
        3.70652437210083,
        2.264160633087158,
        5.517195701599121,
        5.647130966186523,
        7.534844398498535,
        4.801510334014893,
        -0.6146295070648193,
        4.1245222091674805,
        -7.081647872924805,
        5.595770835876465,
        8.008126258850098,
        -0.32275018095970154,
        -0.4018491208553314,
        -0.5894116163253784,
        1.8762470483779907,
        3.809234142303467,
        -18.501556396484375,
        4.890566349029541,
        1.9763686656951904,
        -0.5705202221870422,
        6.481090068817139,
        -0.46565142273902893,
        6.237163066864014,
        1.9453474283218384,
        4.216012001037598,
        3.7590649127960205,
        2.9843709468841553,
        6.253661632537842,
        -0.6033294796943665,
        -0.4441241919994354,
        -5.912605285644531,
        -0.4684881269931793,
        -0.08164875209331512,
        5.891498565673828,
        0.9945195317268372,
        2.576080322265625,
        0.2878727316856384,
        -7.478274345397949,
        1.9594801664352417,
        -13.809874534606934,
        -0.6204384565353394,
        6.363858699798584,
        -0.025508081540465355,
        -0.22906245291233063,
        4.758038520812988,
        4.922834396362305,
        1.5119032859802246,
        5.52260160446167,
        2.6195600032806396,
        2.9971582889556885,
        5.166244983673096,
        -0.11087644100189209,
        -0.5924797654151917,
        5.516445159912109,
        -11.232393264770508,
        3.6546273231506348,
        3.221541166305542,
        2.9459667205810547,
        3.675283432006836,
        2.8660130500793457,
        7.146731376647949,
        1.91285240650177,
        2.0290167331695557,
        2.31626296043396,
        -0.5477996468544006,
        -23.352893829345703,
        10.422942161560059,
        5.862035274505615,
        8.4373140335083,
        7.2198333740234375,
        -22.46315574645996,
        -0.6085496544837952,
        2.5661728382110596,
        -0.1768195629119873,
        5.65228271484375,
        6.47574520111084,
        0.46951499581336975,
        -1.0167231559753418,
        4.224152565002441,
        8.65860652923584,
        -18.82054901123047,
        25.257692337036133,
        -5.236217498779297,
        18.014036178588867,
        15.129707336425781,
        -26.14051055908203,
        13.183469772338867,
        21.80116081237793,
        11.341544151306152,
        -23.943723678588867,
        -0.5794087052345276,
        26.513622283935547,
        15.228275299072266,
        6.772237777709961,
        19.988231658935547,
        -25.331558227539062,
        27.14090919494629,
        -6.819113731384277,
        5.390870094299316,
        -7.723787307739258,
        -22.564117431640625,
        19.58127212524414,
        -9.275256156921387,
        7.498546600341797,
        -19.189592361450195,
        23.88322639465332,
        9.97137451171875,
        -1.0462031364440918,
        17.41547203063965,
        -25.690818786621094,
        -8.888348579406738,
        -3.6090610027313232,
        26.451457977294922,
        -24.289363861083984,
        24.023868560791016,
        -7.236500263214111,
        -21.64227867126465,
        27.165170669555664,
        27.239173889160156,
        27.815488815307617,
        12.593287467956543,
        24.837141036987305,
        -22.50414276123047,
        -23.2332763671875,
        -22.16290855407715,
        14.38464069366455,
        8.710731506347656,
        -5.615325927734375,
        13.081971168518066,
        -16.729223251342773,
        2.7452404499053955,
        8.759780883789062,
        14.898533821105957,
        -19.675819396972656,
        25.582698822021484,
        10.867493629455566,
        11.358141899108887,
        -13.05251407623291,
        8.883177757263184,
        -0.6334089040756226,
        -7.128582000732422,
        23.92157745361328,
        -26.835969924926758,
        13.609786033630371,
        4.967707633972168,
        -21.36989402770996,
        -25.42479133605957,
        4.634394645690918,
        -8.678763389587402,
        -0.6796389222145081,
        -4.273281574249268,
        -26.847930908203125,
        11.479727745056152,
        13.259367942810059,
        -24.583837509155273,
        -20.235368728637695,
        23.492761611938477,
        -7.227316856384277,
        14.411865234375,
        -8.941483497619629,
        0.203573539853096,
        -18.915842056274414,
        -24.07682991027832,
        27.068355560302734,
        27.111616134643555,
        4.395772933959961,
        -25.236604690551758,
        4.534430027008057,
        19.531982421875,
        -5.1296844482421875,
        27.400285720825195,
        0.22860513627529144,
        9.063860893249512,
        7.71061897277832,
        -23.54678726196289,
        -22.363540649414062,
        20.749094009399414,
        20.37772560119629,
        -19.5493221282959,
        -6.5241827964782715,
        24.380765914916992,
        13.098332405090332,
        5.281312942504883,
        13.968576431274414,
        18.859773635864258,
        -25.231380462646484,
        23.337438583374023,
        4.721105098724365,
        -3.026792526245117,
        -26.137939453125,
        -26.47526741027832,
        21.218358993530273,
        25.89722442626953,
        3.752971649169922,
        -5.778493881225586,
        -20.005962371826172,
        -16.832059860229492,
        7.590878486633301,
        4.0394487380981445,
        20.02675437927246,
        -24.5296573638916,
        -0.3696448802947998,
        13.716245651245117,
        23.77737045288086,
        -12.598363876342773,
        26.967512130737305,
        -1.3571949005126953,
        3.144524097442627,
        1.1276150941848755,
        0.028806481510400772,
        3.621183395385742,
        -2.0816187858581543,
        -1.8576997518539429,
        3.7676093578338623,
        -3.505574941635132,
        0.8034385442733765,
        3.9564220905303955,
        3.9533019065856934,
        0.9439444541931152,
        -2.6452155113220215,
        -1.6760472059249878,
        -1.6920472383499146,
        -2.068614959716797,
        4.535991668701172,
        -2.6969826221466064,
        3.7156529426574707,
        -0.2947500944137573,
        3.354520797729492,
        3.974113941192627,
        2.4747188091278076,
        6.066633224487305,
        -1.147027611732483,
        4.224170684814453,
        -3.0292279720306396,
        -1.3612260818481445,
        2.742445945739746,
        -2.1812984943389893,
        4.0768280029296875,
        7.581031799316406,
        4.439925670623779,
        -2.9089927673339844,
        4.3249335289001465,
        -2.978130578994751,
        3.5219290256500244,
        3.671213150024414,
        -0.573888897895813,
        -2.328824996948242,
        -2.466515302658081,
        3.4543874263763428,
        -2.770223617553711,
        4.276820182800293,
        4.79827880859375,
        3.492161273956299,
        -1.8836138248443604,
        -0.7519383430480957,
        4.380919456481934,
        -2.170045852661133,
        4.408885478973389,
        -1.1876716613769531,
        -0.5361450910568237,
        -2.405104875564575,
        2.286414623260498,
        -0.8931270241737366,
        -1.7602043151855469,
        -3.8954532146453857,
        0.9191135764122009,
        0.33201947808265686,
        0.05433117598295212,
        3.5126700401306152,
        0.2533007860183716,
        4.624977111816406,
        -1.949570655822754,
        -2.5281317234039307,
        3.1563174724578857,
        4.715402603149414,
        3.335113525390625,
        2.138477325439453,
        4.003811836242676,
        1.499890685081482,
        4.288029670715332,
        -2.0584805011749268,
        -1.9589884281158447,
        4.419064998626709,
        5.242643356323242,
        0.6458529829978943,
        -2.1611697673797607,
        -2.4555885791778564,
        -1.421917200088501,
        -0.16452310979366302,
        3.1399986743927,
        4.546453952789307,
        -1.653705358505249,
        -2.658418893814087,
        -0.8742997646331787,
        4.019686698913574,
        -6.235785961151123,
        2.4757790565490723,
        0.6942633390426636,
        -2.8880069255828857,
        -0.1447569578886032,
        -0.620854377746582,
        -1.2988756895065308,
        4.405429840087891,
        3.86714768409729,
        -1.6649446487426758,
        -2.185513973236084,
        2.1773183345794678,
        -1.949802279472351,
        -0.09325464069843292,
        -1.4374465942382812,
        -2.0762648582458496,
        -2.0993828773498535,
        -3.6324291229248047,
        4.700897216796875,
        -2.3836116790771484,
        -0.7392435669898987,
        1.0924206972122192,
        4.174370765686035,
        4.335351943969727,
        -2.346597671508789,
        -1.7579575777053833,
        -1.7930350303649902,
        9.165731430053711,
        3.5896565914154053,
        4.298210144042969,
        0.31518474221229553,
        -1.4696736335754395,
        1.60800302028656,
        4.038740634918213,
        0.23627567291259766,
        -0.28963303565979004,
        0.9626613259315491,
        3.974679708480835,
        -2.373394250869751,
        0.8092830777168274,
        3.5391716957092285,
        -1.1371501684188843,
        4.074951171875,
        2.4839415550231934,
        2.5416319370269775,
        1.1895058155059814,
        -1.0088151693344116,
        1.7190862894058228,
        4.261383056640625,
        4.564574241638184,
        -1.2197295427322388,
        1.8172541856765747,
        2.575134515762329,
        1.8182786703109741,
        1.8962398767471313,
        2.0359108448028564,
        -0.32166850566864014,
        1.3709614276885986,
        2.0012471675872803,
        1.2706432342529297,
        1.8200582265853882,
        -0.04396398738026619,
        4.215595245361328,
        3.4977493286132812,
        0.8807604312896729,
        -0.15295502543449402,
        1.9991294145584106,
        0.9888256788253784,
        2.2923121452331543,
        1.195716381072998,
        -0.5402239561080933,
        3.68424916267395,
        2.5033798217773438,
        2.1145529747009277,
        -0.7163546681404114,
        1.6881035566329956,
        1.8857519626617432,
        -0.9106953144073486,
        4.049788951873779,
        1.844939112663269,
        1.2983921766281128,
        3.934614896774292,
        2.119105339050293,
        -0.33077549934387207,
        -0.6849089860916138,
        -1.0524035692214966,
        1.3823292255401611,
        1.2796434164047241,
        2.2169036865234375,
        0.9386252760887146,
        -0.3278804123401642,
        0.25917482376098633,
        1.1232616901397705,
        1.1745318174362183,
        -0.7817305326461792,
        3.11667537689209,
        1.08990478515625,
        3.4903879165649414,
        0.26526570320129395,
        2.409299850463867,
        -0.43358370661735535,
        2.1011784076690674,
        3.848834276199341,
        -0.7566960453987122,
        1.1048675775527954,
        0.6232808232307434,
        -0.6749408841133118,
        -0.6131223440170288,
        2.99910569190979,
        0.10355234146118164,
        2.5530331134796143,
        1.681217074394226,
        -0.8723430633544922,
        0.7662338614463806,
        1.0204771757125854,
        -0.044438861310482025,
        0.894481360912323,
        4.018486976623535,
        -2.6366007328033447,
        0.941548764705658,
        -1.9398131370544434,
        -0.3472234010696411,
        0.10229809582233429,
        -0.3079066872596741,
        3.7770814895629883,
        2.225154399871826,
        1.8638114929199219,
        -1.0721714496612549,
        -1.2416750192642212,
        4.443292140960693,
        0.6812368035316467,
        1.1525744199752808,
        -0.15218138694763184,
        1.1340184211730957,
        0.637258768081665,
        -0.5150531530380249,
        -0.10229630023241043,
        1.8608583211898804,
        1.4039442539215088,
        -0.5758569240570068,
        -3.3977930545806885,
        3.6133668422698975,
        0.8897243738174438,
        1.5344518423080444,
        1.0691168308258057,
        1.4704948663711548,
        -1.1329346895217896,
        2.397895336151123,
        1.2256683111190796,
        1.6433207988739014,
        -0.7756789922714233,
        -0.8102222084999084,
        1.6165000200271606,
        2.833253860473633,
        0.3488132953643799,
        6.65916109085083,
        -0.5665409564971924,
        1.5648150444030762,
        2.6379034519195557,
        0.6652559638023376,
        4.374295711517334,
        -1.360985517501831,
        0.03839422017335892,
        2.3801631927490234,
        5.0681610107421875,
        0.8981947302818298,
        1.5947357416152954,
        1.7156909704208374,
        -0.8170596361160278,
        5.526966094970703,
        -0.9884293079376221,
        -0.6195418834686279,
        1.7712270021438599,
        3.739060640335083,
        2.5551910400390625,
        5.937900066375732,
        -0.7470639944076538,
        -0.9981974363327026,
        1.5409760475158691,
        7.964631080627441,
        -0.5595093369483948,
        5.393624305725098,
        2.426968812942505,
        3.5045840740203857,
        1.4884735345840454,
        -1.0955721139907837,
        -0.506887674331665,
        7.265195369720459,
        -0.8569921851158142,
        4.313973426818848,
        -1.3771066665649414,
        2.7838449478149414,
        6.37299108505249,
        1.1288784742355347,
        2.0183587074279785,
        5.317152976989746,
        -1.3886691331863403,
        3.7489304542541504,
        2.052053689956665,
        7.546132564544678,
        -0.48292088508605957,
        -0.163064643740654,
        3.6277456283569336,
        1.5326632261276245,
        -0.3854636549949646,
        4.730923652648926,
        0.685915470123291,
        -0.09618759900331497,
        -1.0430681705474854,
        -0.9596134424209595,
        1.2382783889770508,
        4.664439678192139,
        1.561506986618042,
        5.1696672439575195,
        6.013421535491943,
        7.205826282501221,
        -0.6167305111885071,
        5.242595672607422,
        -0.6914305090904236,
        5.85232400894165,
        6.258914470672607,
        4.601638317108154,
        5.3419294357299805,
        -1.0883160829544067,
        5.848329067230225,
        1.8905179500579834,
        6.763511657714844,
        7.926117420196533,
        -0.2402064949274063,
        -0.39728492498397827,
        -1.1299240589141846,
        2.3891234397888184,
        3.8757734298706055,
        1.4598064422607422,
        5.47776460647583,
        2.100684642791748,
        -0.8018548488616943,
        6.815855979919434,
        -0.8070797324180603,
        7.789334297180176,
        2.1117563247680664,
        4.84528112411499,
        4.502727508544922,
        3.6592652797698975,
        4.88877010345459,
        -1.1513391733169556,
        -3.519730567932129,
        3.771801233291626,
        -2.5303473472595215,
        -0.48570331931114197,
        5.467732906341553,
        2.8422422409057617,
        0.8587259650230408,
        0.25621286034584045,
        2.4205892086029053,
        1.9530295133590698,
        1.179988145828247,
        -1.3262635469436646,
        7.709587574005127,
        -1.1323113441467285,
        -0.1298235058784485,
        6.386651515960693,
        5.394767761230469,
        1.1770656108856201,
        5.353932857513428,
        2.4318137168884277,
        2.515077829360962,
        6.312581539154053,
        -2.002760410308838,
        -0.978689432144165,
        5.1240925788879395,
        1.7797363996505737,
        4.292392253875732,
        4.5858235359191895,
        1.5996849536895752,
        1.8786207437515259,
        7.997564792633057,
        8.061269760131836,
        2.098287582397461,
        1.853281021118164,
        2.4809951782226562,
        -1.2658997774124146,
        1.306785225868225,
        12.030116081237793,
        5.929021835327148,
        7.214424133300781,
        6.711292743682861,
        1.5633699893951416,
        -1.1054670810699463,
        2.402886390686035,
        -0.5815865397453308,
        6.815165996551514,
        6.5789875984191895,
        0.1764993816614151,
        -0.9244076609611511,
        1.0625406503677368,
        -1.6145442724227905,
        5.923848628997803,
        -1.0128730535507202,
        -1.2962199449539185,
        1.9140864610671997,
        4.400114059448242,
        2.86845326423645,
        6.184607982635498,
        -1.1588629484176636,
        -1.127284049987793,
        1.7219231128692627,
        9.283387184143066,
        -0.6507172584533691,
        5.940305709838867,
        1.6539026498794556,
        3.573845148086548,
        2.02172589302063,
        -0.9233367443084717,
        -1.2157742977142334,
        7.8529438972473145,
        -1.2342860698699951,
        4.710691452026367,
        -1.6916512250900269,
        2.916667938232422,
        6.993865489959717,
        -0.266527384519577,
        2.496211051940918,
        5.843789577484131,
        -3.1281850337982178,
        4.167165756225586,
        1.754919409751892,
        8.42075252532959,
        -1.2828168869018555,
        -0.32465660572052,
        3.352322578430176,
        1.3603986501693726,
        -1.082321047782898,
        5.113193988800049,
        1.0364229679107666,
        0.04929877445101738,
        -1.0007647275924683,
        -1.4677331447601318,
        1.6523716449737549,
        4.986506462097168,
        1.4504060745239258,
        5.4924845695495605,
        6.032787322998047,
        7.649313926696777,
        -1.3344740867614746,
        5.8682708740234375,
        -1.6552770137786865,
        6.69199275970459,
        7.3273725509643555,
        4.87369966506958,
        5.808675765991211,
        -1.0526278018951416,
        6.245292663574219,
        2.222654342651367,
        7.1501898765563965,
        8.210103988647461,
        -0.19652219116687775,
        -1.1574383974075317,
        -1.2555334568023682,
        2.3480286598205566,
        4.576387405395508,
        0.8873822093009949,
        5.704107761383057,
        2.008279323577881,
        -1.7327947616577148,
        7.049654960632324,
        -1.4148436784744263,
        8.89767837524414,
        2.0838918685913086,
        5.392608165740967,
        4.861479759216309,
        3.962785005569458,
        4.86210298538208,
        -1.2895320653915405,
        -5.682496547698975,
        4.363579750061035,
        -4.507511615753174,
        -0.20596306025981903,
        5.927661895751953,
        1.239707112312317,
        1.1499873399734497,
        0.7816545367240906,
        1.7088327407836914,
        1.7620311975479126,
        0.44826191663742065,
        -1.8024004697799683,
        7.868957042694092,
        -0.9879201054573059,
        -0.0462862104177475,
        6.855414867401123,
        5.955749034881592,
        1.1250605583190918,
        5.517403602600098,
        3.205108165740967,
        2.9924614429473877,
        6.527831554412842,
        -4.57381534576416,
        -1.274520754814148,
        5.948787212371826,
        1.11561119556427,
        4.445137977600098,
        5.7072529792785645,
        2.227863311767578,
        2.6280930042266846,
        7.269586086273193,
        8.934622764587402,
        2.0970115661621094,
        1.8561278581619263,
        2.902263641357422,
        -1.10378098487854,
        0.6699603199958801,
        12.863495826721191,
        6.552349090576172,
        7.524156093597412,
        9.281866073608398,
        0.8921667337417603,
        -1.7504955530166626,
        2.373671293258667,
        0.07857514917850494,
        7.515182971954346,
        6.833008289337158,
        0.05917384475469589,
        -0.8330406546592712,
        1.24129056930542,
        2.423720598220825,
        2.4246373176574707,
        1.0350689888000488,
        2.835297107696533,
        1.6617343425750732,
        1.1607624292373657,
        1.9263745546340942,
        2.60778546333313,
        1.1842533349990845,
        3.564298391342163,
        1.928579330444336,
        5.170074939727783,
        -0.16307763755321503,
        2.2928481101989746,
        1.5838537216186523,
        1.0027871131896973,
        1.8965939283370972,
        -0.777383029460907,
        2.659621238708496,
        0.4054794907569885,
        2.9150776863098145,
        3.4077556133270264,
        2.0001144409179688,
        4.81450891494751,
        2.3575832843780518,
        -0.7283303141593933,
        0.5564213991165161,
        1.7211254835128784,
        1.2293916940689087,
        1.1443443298339844,
        2.2149181365966797,
        4.708920001983643,
        3.317962646484375,
        -0.09035451710224152,
        2.963625192642212,
        -0.18478520214557648,
        2.394867420196533,
        3.7852156162261963,
        1.6787046194076538,
        -0.4284847676753998,
        -0.47777384519577026,
        2.1615970134735107,
        0.5991951823234558,
        3.315577983856201,
        1.8067063093185425,
        3.1231696605682373,
        2.345106363296509,
        -1.1162515878677368,
        2.4799718856811523,
        1.4848361015319824,
        -0.792032778263092,
        2.17969012260437,
        2.464146137237549,
        1.2333264350891113,
        3.203692674636841,
        0.42047321796417236,
        1.7551170587539673,
        3.293616533279419,
        2.843371629714966,
        3.8658478260040283,
        -0.30313122272491455,
        2.468261241912842,
        0.9611175656318665,
        2.4740030765533447,
        1.0251868963241577,
        1.3472325801849365,
        3.05460786819458,
        1.941916584968567,
        2.479835271835327,
        3.2241978645324707,
        2.821216106414795,
        3.9603254795074463,
        1.818579077720642,
        1.4077669382095337,
        1.2823747396469116,
        2.778629779815674,
        4.445689678192139,
        1.2051105499267578,
        -6.2177348136901855,
        1.1067646741867065,
        -3.9482152462005615,
        -0.48013725876808167,
        3.0233490467071533,
        0.9879302978515625,
        1.7501864433288574,
        0.544572114944458,
        1.5088905096054077,
        1.810753345489502,
        -0.9601461887359619,
        2.0879173278808594,
        3.050199508666992,
        -0.7751743793487549,
        0.08501015603542328,
        2.565420627593994,
        1.8938368558883667,
        1.7115991115570068,
        3.164747476577759,
        1.007217526435852,
        0.729604959487915,
        3.52886700630188,
        -3.810256004333496,
        0.780206024646759,
        2.084822177886963,
        1.0474196672439575,
        1.0035680532455444,
        2.492579936981201,
        1.9765856266021729,
        0.0866217389702797,
        3.1590521335601807,
        4.263783931732178,
        1.8793463706970215,
        1.9800794124603271,
        0.6926192045211792,
        -0.4075828194618225,
        0.8852203488349915,
        11.397347450256348,
        3.844684362411499,
        5.321653366088867,
        4.95546293258667,
        1.1402559280395508,
        1.7800378799438477,
        2.0080854892730713,
        0.158116415143013,
        3.2221338748931885,
        5.089649200439453,
        2.3350915908813477,
        -0.562245786190033,
        5.429778575897217,
        31.946199417114258,
        -20.86741828918457,
        10.007078170776367,
        31.906536102294922,
        -7.823694229125977,
        -24.701339721679688,
        7.781016826629639,
        -22.118825912475586,
        25.64518165588379,
        30.95861053466797,
        17.231582641601562,
        -22.046031951904297,
        -0.765748143196106,
        -23.14443016052246,
        5.03651237487793,
        -26.700895309448242,
        15.939763069152832,
        -2.2746686935424805,
        30.797889709472656,
        -22.448139190673828,
        31.00016212463379,
        7.251807689666748,
        29.058902740478516,
        30.42580795288086,
        -28.943941116333008,
        19.746706008911133,
        -19.16203498840332,
        -25.652414321899414,
        25.845121383666992,
        -28.15599822998047,
        12.391901016235352,
        24.030786514282227,
        31.908363342285156,
        -9.672464370727539,
        6.555129051208496,
        -19.75356674194336,
        25.515398025512695,
        -5.63006067276001,
        2.6256847381591797,
        -8.456740379333496,
        -3.2864491939544678,
        30.41691017150879,
        -14.72934627532959,
        -8.276822090148926,
        19.598615646362305,
        -8.05473518371582,
        -23.582550048828125,
        -21.973251342773438,
        30.030141830444336,
        -28.189001083374023,
        19.02540397644043,
        -29.70915412902832,
        -28.00286865234375,
        -21.369422912597656,
        -19.79138946533203,
        9.592159271240234,
        -29.611873626708984,
        -0.6713017225265503,
        -25.478530883789062,
        -22.277820587158203,
        -0.06577719002962112,
        31.545669555664062,
        19.243484497070312,
        9.003296852111816,
        -29.852081298828125,
        4.419897556304932,
        -12.018970489501953,
        14.312028884887695,
        31.016103744506836,
        -25.322484970092773,
        31.849401473999023,
        -21.152828216552734,
        8.70304012298584,
        -30.273468017578125,
        -27.228290557861328,
        5.98972749710083,
        6.120721340179443,
        21.53546714782715,
        10.775245666503906,
        -22.456003189086914,
        12.24077320098877,
        0.0021186803933233023,
        -10.081465721130371,
        12.556707382202148,
        -1.2192851305007935,
        -11.077970504760742,
        5.999562740325928,
        10.241497039794922,
        4.853123188018799,
        29.865171432495117,
        -27.003786087036133,
        -3.910947561264038,
        -0.39661887288093567,
        -27.81627082824707,
        -30.227134704589844,
        21.658023834228516,
        -8.145120620727539,
        -26.34646224975586,
        -26.760356903076172,
        -18.322185516357422,
        14.537582397460938,
        17.502361297607422,
        -27.597591400146484,
        5.10943078994751,
        -30.348724365234375,
        -18.30067253112793,
        14.186327934265137,
        -20.383621215820312,
        -23.221769332885742,
        -24.123735427856445,
        7.19069242477417,
        12.382840156555176,
        -25.975662231445312,
        7.06054162979126,
        5.165280342102051,
        21.077938079833984,
        -14.06777572631836,
        -13.620993614196777,
        -20.676517486572266,
        5.375131130218506,
        28.340715408325195,
        12.078432083129883,
        -0.2509666085243225,
        -25.69415283203125,
        -15.255962371826172,
        29.62267303466797,
        -0.9618077874183655,
        1.7129336595535278,
        -6.777725696563721,
        7.762274742126465,
        -3.2581980228424072,
        -7.301122665405273,
        1.5555137395858765,
        5.742417812347412,
        3.4462311267852783,
        6.409359455108643,
        -4.293887615203857,
        -8.64040756225586,
        2.1578545570373535,
        7.85417366027832,
        -1.0345942974090576,
        7.447734832763672,
        1.933691382408142,
        4.450483322143555,
        2.6018521785736084,
        -1.1192585229873657,
        -7.774929046630859,
        8.30390453338623,
        -6.2145514488220215,
        5.953611373901367,
        -4.25547981262207,
        0.7804206609725952,
        7.643548965454102,
        1.2530298233032227,
        3.7220771312713623,
        7.291910648345947,
        -6.827610492706299,
        4.908809185028076,
        2.764220952987671,
        7.052379131317139,
        -8.663460731506348,
        0.19062291085720062,
        4.836190700531006,
        2.146362543106079,
        -6.624261856079102,
        7.120240688323975,
        -0.8894275426864624,
        -0.2789630889892578,
        -1.5381159782409668,
        -5.655759811401367,
        1.5609080791473389,
        4.62276029586792,
        1.0681837797164917,
        6.71655797958374,
        7.108857154846191,
        7.659990310668945,
        -7.227620601654053,
        6.526669502258301,
        1.0342363119125366,
        7.955263614654541,
        8.037066459655762,
        4.966946125030518,
        6.599759578704834,
        -2.075618267059326,
        6.930489540100098,
        1.054868459701538,
        8.372857093811035,
        9.291718482971191,
        -0.2027544230222702,
        -7.545071125030518,
        -3.0825204849243164,
        2.8146400451660156,
        5.437051296234131,
        1.0079959630966187,
        7.069480895996094,
        2.216491222381592,
        -6.996397495269775,
        1.6026643514633179,
        -7.860605716705322,
        10.99910831451416,
        2.677802324295044,
        6.287598133087158,
        6.762895107269287,
        3.9624173641204834,
        5.4072747230529785,
        -3.2814149856567383,
        3.109653949737549,
        5.296311855316162,
        2.772603988647461,
        -0.024615513160824776,
        8.985024452209473,
        2.9124066829681396,
        -0.8659690022468567,
        0.06154228001832962,
        2.3859217166900635,
        2.454648733139038,
        1.4534744024276733,
        -4.569058895111084,
        8.444315910339355,
        -1.58323335647583,
        -0.3336239159107208,
        8.374236106872559,
        7.17896842956543,
        1.3166204690933228,
        6.7402801513671875,
        3.252309560775757,
        3.618993043899536,
        7.822263717651367,
        2.868967056274414,
        -2.8912832736968994,
        7.851047515869141,
        1.5685293674468994,
        5.6640448570251465,
        6.597017288208008,
        2.4695804119110107,
        2.154254674911499,
        8.531217575073242,
        8.970358848571777,
        2.678633689880371,
        2.4213569164276123,
        3.2049126625061035,
        -1.643330693244934,
        1.6316136121749878,
        11.447495460510254,
        6.680616855621338,
