{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        15,
        128
      ],
      "dtype": "float32",
      "data": [
        -0.478920042514801,
        0.4621833562850952,
        0.17211882770061493,
        -0.10765242576599121,
        -0.18231503665447235,
        -0.40530720353126526,
        0.13924036920070648,
        0.1518753468990326,
        0.4649924337863922,
        -0.03769705444574356,
        0.6190937757492065,
        -0.081222303211689,
        -0.11872503906488419,
        -0.3439371883869171,
        -0.28216299414634705,
        0.7998689413070679,
        0.2645304203033447,
        0.2535427212715149,
        0.0484975129365921,
        -0.01274073589593172,
        -0.11071774363517761,
        -0.4152108132839203,
        -0.10092246532440186,
        -1.0856205224990845,
        -0.08321302384138107,
        0.10874363034963608,
        0.15678755939006805,
        0.0179325919598341,
        -0.07626684755086899,
        0.47813040018081665,
        0.5590483546257019,
        0.3352796137332916,
        0.2839222848415375,
        0.5005555152893066,
        -0.26680251955986023,
        -0.6770720481872559,
        0.2402581125497818,
        -0.5770618915557861,
        0.530945360660553,
        0.5474991798400879,
        0.037590526044368744,
        0.2611229121685028,
        0.2943297326564789,
        0.5073378086090088,
        0.13899332284927368,
        -0.15074442327022552,
        -0.22736042737960815,
        -0.6624644994735718,
        0.19925625622272491,
        -0.21494676172733307,
        0.7257250547409058,
        -0.5511173009872437,
        -0.05148697644472122,
        -0.5572685599327087,
        -0.32871299982070923,
        0.6312600374221802,
        0.8101614117622375,
        0.062476519495248795,
        -0.10065269470214844,
        -0.9092685580253601,
        0.9836709499359131,
        0.49612969160079956,
        0.37479111552238464,
        0.6093722581863403,
        -0.4327991008758545,
        -0.0408337377011776,
        0.00047859011101536453,
        0.6541807055473328,
        0.4040801525115967,
        0.014155023731291294,
        -0.038916055113077164,
        0.24632950127124786,
        0.08629567176103592,
        -0.10807900875806808,
        0.31063762307167053,
        -0.02570246532559395,
        0.38708972930908203,
        0.31991714239120483,
        0.369378000497818,
        -0.06256735324859619,
        -0.0620221383869648,
        -0.4593704342842102,
        -0.29398298263549805,
        0.18023231625556946,
        0.837462306022644,
        0.3027494251728058,
        0.23602785170078278,
        0.7262229323387146,
        -0.3956984579563141,
        0.14188197255134583,
        -0.9694132804870605,
        -0.4240381419658661,
        0.40119779109954834,
        -0.23877792060375214,
        0.02912561595439911,
        0.1382107138633728,
        0.055672019720077515,
        0.7803917527198792,
        -0.1234348714351654,
        -0.36172714829444885,
        0.9620360136032104,
        -0.07210824638605118,
        0.23611433804035187,
        0.7350517511367798,
        -0.20839464664459229,
        -0.030648328363895416,
        -0.2245892882347107,
        -0.40490517020225525,
        0.41481244564056396,
        -0.6301462054252625,
        -0.029893269762396812,
        0.2918632924556732,
        0.09805044531822205,
        -0.02214071713387966,
        -0.1358192414045334,
        -0.37638846039772034,
        0.30891919136047363,
        -0.41880249977111816,
        -0.18557985126972198,
        -0.5234795212745667,
        0.00855235755443573,
        0.5277237296104431,
        -0.3344769775867462,
        0.14310646057128906,
        0.2754509747028351,
        0.14162194728851318,
        -0.24832279980182648,
        -0.23291873931884766,
        -0.22713212668895721,
        -0.18015091121196747,
        0.24150450527668,
        0.03599560260772705,
        -0.012996708042919636,
        -0.22562874853610992,
        -0.11685802042484283,
        0.2709319293498993,
        0.42134544253349304,
        -0.4222967028617859,
        0.04517131298780441,
        0.3442500829696655,
        -0.13553275167942047,
        0.15510573983192444,
        -0.23199355602264404,
        -0.16209590435028076,
        0.08732464164495468,
        0.5726994276046753,
        0.25050410628318787,
        -0.23334215581417084,
        0.15609468519687653,
        -0.9360979795455933,
        0.008661909028887749,
        -0.11789202690124512,
        0.5182874798774719,
        -0.26816216111183167,
        0.05433061718940735,
        -0.515304446220398,
        0.3373296856880188,
        0.022405793890357018,
        0.49899929761886597,
        -0.11482422798871994,
        0.4256659150123596,
        0.6817731261253357,
        -0.03060809150338173,
        -0.433718204498291,
        -0.38324737548828125,
        -0.5901821851730347,
        0.4849138855934143,
        -0.09692177176475525,
        -0.5542916059494019,
        -0.05467740446329117,
        0.1052541583776474,
        -0.43677496910095215,
        -0.1675461232662201,
        0.023812906816601753,
        -0.5800992846488953,
        -0.5861222147941589,
        -0.47506746649742126,
        -0.06017589569091797,
        0.16772618889808655,
        -1.480907917022705,
        -0.07633765786886215,
        -0.4170090854167938,
        0.2727300226688385,
        0.3601491153240204,
        0.22566679120063782,
        0.05209473893046379,
        -0.053350549191236496,
        0.15298065543174744,
        0.3286897540092468,
        0.39373886585235596,
        0.2274089902639389,
        0.1362888216972351,
        -0.11331836134195328,
        -0.028207238763570786,
        0.2413802146911621,
        -0.24967844784259796,
        -0.6228094696998596,
        0.30972108244895935,
        0.036777276545763016,
        0.10861308127641678,
        0.47799035906791687,
        -0.5550398230552673,
        -0.5816004276275635,
        -0.4595752954483032,
        -0.2225322425365448,
        0.423527330160141,
        0.24073709547519684,
        -0.5863309502601624,
        -0.19035425782203674,
        -0.3036600947380066,
        -0.2972964942455292,
        -0.004172568209469318,
        0.423936128616333,
        -0.29423192143440247,
        0.11374005675315857,
        0.5242196917533875,
        -0.698998212814331,
        -0.4622562825679779,
        -0.8168891668319702,
        -0.17633743584156036,
        0.08487705886363983,
        -0.24674735963344574,
        -0.9262552857398987,
        -0.030701138079166412,
        0.08076842874288559,
        0.7097663283348083,
        -0.1485292911529541,
        0.09168779104948044,
        0.46047234535217285,
        0.044994235038757324,
        0.07626353204250336,
        0.20295386016368866,
        0.1818908154964447,
        0.3735870122909546,
        -0.3592005670070648,
        0.1064741387963295,
        -0.27576789259910583,
        0.22629176080226898,
        -0.335060715675354,
        0.27380746603012085,
        -0.04428081214427948,
        0.140193372964859,
        0.13393503427505493,
        -0.1338241994380951,
        0.04031932353973389,
        -0.4892770051956177,
        0.4835711419582367,
        -0.1497337818145752,
        -0.26966869831085205,
        -0.008889979682862759,
        -0.09200305491685867,
        -0.4220251739025116,
        0.27062588930130005,
        -0.13396033644676208,
        0.45224228501319885,
        0.7546360492706299,
        -0.2557753622531891,
        0.04569898545742035,
        0.19514532387256622,
        0.4860323965549469,
        0.4153023064136505,
        0.0795956403017044,
        0.2145443558692932,
        0.577187180519104,
        0.615646243095398,
        -0.6575528383255005,
        0.13623836636543274,
        0.04675360023975372,
        0.18864116072654724,
        -0.5607798099517822,
        -0.10007142275571823,
        0.16246512532234192,
        -0.645541787147522,
        0.25566768646240234,
        0.11087226122617722,
        0.5492356419563293,
        -0.340809166431427,
        -0.10904886573553085,
        0.2848830223083496,
        -0.6474040746688843,
        -0.1665143370628357,
        0.1957179754972458,
        -0.03399756923317909,
        0.0895412266254425,
        -0.025309201329946518,
        0.2198903113603592,
        -0.026001358404755592,
        0.19267840683460236,
        -0.18309123814105988,
        0.20400355756282806,
        -0.5615167617797852,
        0.23441623151302338,
        0.3281676471233368,
        -0.19590748846530914,
        0.4006224274635315,
        0.3864787220954895,
        0.2673456072807312,
        0.2316322773694992,
        0.5143360495567322,
        -0.04797716438770294,
        0.7907320857048035,
        -0.10819298028945923,
        0.48664921522140503,
        -0.346840500831604,
        0.6754593849182129,
        0.3090406060218811,
        0.14248298108577728,
        -1.3537763357162476,
        0.3164854347705841,
        -0.2818581759929657,
        -0.1080971360206604,
        0.20852358639240265,
        0.7043541073799133,
        0.04168218374252319,
        0.2943957448005676,
        -0.3783983886241913,
        0.3296831548213959,
        0.22873535752296448,
        0.10748378932476044,
        0.6181488037109375,
        -0.8468351364135742,
        0.051397304981946945,
        0.12011345475912094,
        -0.15819789469242096,
        -0.11337807774543762,
        -0.2188958376646042,
        0.21144655346870422,
        0.4754636883735657,
        -0.4404318034648895,
        -0.32836857438087463,
        0.42919424176216125,
        0.6408849954605103,
        -0.23395295441150665,
        -0.2392449676990509,
        -0.31098634004592896,
        -0.5156897306442261,
        0.2491261512041092,
        -0.42799344658851624,
        -0.0936957597732544,
        0.5382202863693237,
        0.5733075141906738,
        0.32541707158088684,
        -0.0807112455368042,
        0.33935174345970154,
        -0.42290616035461426,
        -0.3715366721153259,
        -1.217350721359253,
        -0.8773146867752075,
        -0.2652357220649719,
        -0.09558676928281784,
        0.07688841223716736,
        0.21512523293495178,
        -0.08344246447086334,
        -0.1854221075773239,
        -0.4663931727409363,
        0.39715343713760376,
        -0.08683940023183823,
        -0.1315287947654724,
        -0.011955976486206055,
        0.6317455172538757,
        0.08535462617874146,
        0.16829952597618103,
        0.5035651326179504,
        0.42040154337882996,
        -0.1583014577627182,
        -0.06870882958173752,
        0.28419989347457886,
        -0.5046449303627014,
        0.10358292609453201,
        0.13726185262203217,
        -0.09839777648448944,
        -0.1966363489627838,
        -0.9037142395973206,
        -0.08433743566274643,
        -0.24977163970470428,
        0.20682813227176666,
        0.34839221835136414,
        0.5783492922782898,
        0.27674731612205505,
        -0.8219594359397888,
        -0.18051615357398987,
        -0.0040472340770065784,
        0.05257600545883179,
        -0.7392550706863403,
        -0.5110588073730469,
        0.6428331732749939,
        0.2390175610780716,
        0.06375978142023087,
        -0.15316522121429443,
        0.49331286549568176,
        0.15054696798324585,
        -0.006870444398373365,
        0.09223327040672302,
        -0.4982025921344757,
        -0.07098598778247833,
        -0.13191980123519897,
        0.24950963258743286,
        0.6120832562446594,
        -0.05262831225991249,
        0.504692018032074,
        0.19430552423000336,
        0.3998771607875824,
        0.4649004638195038,
        0.40104880928993225,
        -0.5584568977355957,
        -0.06548412144184113,
        -0.35020607709884644,
        -1.1965739727020264,
        0.7172854542732239,
        -0.5754256844520569,
        -0.36044201254844666,
        -0.15526427328586578,
        -0.43267184495925903,
        -0.21255283057689667,
        0.12441165745258331,
        0.4679442048072815,
        0.16201773285865784,
        0.1150876060128212,
        -0.3493823707103729,
        0.31407177448272705,
        0.3737581670284271,
        -0.5233827829360962,
        0.3186156153678894,
        0.011333640664815903,
        -0.3988317847251892,
        0.5175334215164185,
        0.24691976606845856,
        0.155564084649086,
        0.029853155836462975,
        0.3738938271999359,
        -0.5256447196006775,
        0.23227378726005554,
        -0.5116641521453857,
        0.3757341206073761,
        0.17616426944732666,
        -0.8961712718009949,
        -0.31790801882743835,
        -0.5624038577079773,
        0.2030315399169922,
        -0.2798783779144287,
        0.7261720299720764,
        -0.08580214530229568,
        -0.14199410378932953,
        -0.32975101470947266,
        0.2754482924938202,
        0.06895556300878525,
        -0.27310362458229065,
        0.2561355233192444,
        -0.8279878497123718,
        -0.4885355830192566,
        0.05385471507906914,
        0.17835135757923126,
        0.23341597616672516,
        0.2984693646430969,
        -0.2875773012638092,
        0.14633724093437195,
        0.603468656539917,
        -0.12621386349201202,
        0.23947449028491974,
        0.442848801612854,
        -0.12694647908210754,
        -0.3645797669887543,
        -0.14146985113620758,
        -0.031151030212640762,
        -0.038649577647447586,
        -0.3407284617424011,
        0.1705472618341446,
        -0.2747180759906769,
        0.42319434881210327,
        0.10490529984235764,
        0.7379452586174011,
        0.06362025439739227,
        -0.6003193259239197,
        -0.1243748813867569,
        -0.8309792876243591,
        -0.8627637028694153,
        0.03450026363134384,
        -0.23047201335430145,
        0.9651490449905396,
        -0.19689182937145233,
        -0.10673818737268448,
        0.4697514772415161,
        -0.2846386730670929,
        0.03742223232984543,
        0.3573141098022461,
        -0.2544932961463928,
        0.4145511984825134,
        0.6332473158836365,
        0.43078136444091797,
        -0.2937638461589813,
        0.047482769936323166,
        -0.24193115532398224,
        0.28777819871902466,
        0.18107035756111145,
        0.10552270710468292,
        0.2394869178533554,
        -0.2164757251739502,
        0.22425968945026398,
        0.004037587437778711,
        0.14566196501255035,
        -1.1830977201461792,
        -0.43965569138526917,
        0.2935476303100586,
        -0.21066130697727203,
        0.34286338090896606,
        0.5427684783935547,
        0.12786325812339783,
        0.027480365708470345,
        0.48913538455963135,
        -0.024668080732226372,
        -0.1456131637096405,
        -0.6256481409072876,
        -0.17485378682613373,
        0.21365272998809814,
        -0.2782806158065796,
        -0.47211745381355286,
        0.6631416082382202,
        -0.07462213188409805,
        -0.1893043965101242,
        0.038602448999881744,
        -0.39506983757019043,
        0.5018097758293152,
        -0.17129263281822205,
        -0.15871547162532806,
        0.6082111597061157,
        0.259226530790329,
        -0.7350379228591919,
        0.10779762268066406,
        0.5847926139831543,
        0.6647010445594788,
        0.1754118800163269,
        -0.47702527046203613,
        -0.057610560208559036,
        -1.201758623123169,
        -0.3882312774658203,
        -0.6630522608757019,
        -0.3371061086654663,
        -0.5235628485679626,
        0.03165402635931969,
        0.021768851205706596,
        -0.08648034930229187,
        0.11296384781599045,
        0.8048869371414185,
        0.30876871943473816,
        0.25179287791252136,
        -0.5044374465942383,
        0.3333565592765808,
        -0.014449672773480415,
        0.3444465696811676,
        -0.7621740698814392,
        0.41686978936195374,
        0.286111444234848,
        -0.2546576261520386,
        0.5288359522819519,
        -0.57688307762146,
        -0.03706119954586029,
        -0.14019300043582916,
        -0.062071461230516434,
        0.3145262598991394,
        -0.03812633082270622,
        -0.06711141765117645,
        0.7242563366889954,
        -0.102464459836483,
        -1.01933753490448,
        0.3734837770462036,
        0.4181412160396576,
        0.08006457984447479,
        -0.46182119846343994,
        0.8798355460166931,
        0.20934151113033295,
        0.12415541708469391,
        0.15517233312129974,
        0.3487222194671631,
        -0.17879481613636017,
        0.2685316205024719,
        0.1412171870470047,
        -0.6890900731086731,
        -0.3157185912132263,
        -0.09779064357280731,
        -0.08904880285263062,
        0.0010317829437553883,
        0.10264547169208527,
        -0.5648669600486755,
        0.29674676060676575,
        -0.16164909303188324,
        -0.4118298888206482,
        0.3914840817451477,
        -0.0030579697340726852,
        0.06502837687730789,
        -0.0048450264148414135,
        -0.20347943902015686,
        0.15830345451831818,
        -0.49744898080825806,
        0.15244832634925842,
        -0.18216827511787415,
        -0.10706588625907898,
        -0.47146132588386536,
        0.3812646269798279,
        0.32816240191459656,
        0.25396719574928284,
        -0.1848457306623459,
        -0.466258704662323,
        -1.054093599319458,
        -0.804749608039856,
        -0.5608969330787659,
        0.014353848062455654,
        -0.328914612531662,
        -0.13415975868701935,
        -0.08965223282575607,
        0.8021655678749084,
        0.018797578290104866,
        0.6922303438186646,
        0.407120019197464,
        -0.8301838040351868,
        -0.019442927092313766,
        0.36501407623291016,
        0.026667514815926552,
        0.5096732378005981,
        0.8638395071029663,
        0.18281418085098267,
        0.14284902811050415,
        -0.31142422556877136,
        0.20396257936954498,
        -0.25678253173828125,
        0.3527785539627075,
        0.5933862328529358,
        -0.5119808316230774,
        -0.1941870152950287,
        -0.5627017021179199,
        -0.41765427589416504,
        -0.06995150446891785,
        0.3206178545951843,
        0.37809398770332336,
        0.06984889507293701,
        -0.7610025405883789,
        -1.0137238502502441,
        -0.14595188200473785,
        -0.05714580789208412,
        0.08894933760166168,
        -0.2757922410964966,
        0.08226571977138519,
        -0.055840954184532166,
        0.08894549310207367,
        -0.06151247397065163,
        -0.31938886642456055,
        -0.23920656740665436,
        0.07763518393039703,
        0.4336552321910858,
        -0.18216495215892792,
        0.15763647854328156,
        0.5859054327011108,
        0.6356450319290161,
        -0.32382023334503174,
        -0.12760822474956512,
        -0.6515778303146362,
        0.2345910519361496,
        0.1753663271665573,
        0.31927576661109924,
        0.14910423755645752,
        0.3094630837440491,
        0.2787978947162628,
        0.3706431984901428,
        -0.5365633368492126,
        0.31652095913887024,
        -0.14420445263385773,
        -0.05038271099328995,
        0.670129120349884,
        -0.12556444108486176,
        0.4123632609844208,
        -0.034457091242074966,
        0.19548487663269043,
        0.01319835614413023,
        0.0853605642914772,
        0.09005241841077805,
        -0.06542325764894485,
        -0.11857551336288452,
        -0.45378488302230835,
        0.23349447548389435,
        -0.50071120262146,
        -0.1001192256808281,
        0.20988599956035614,
        0.12243962287902832,
        0.17472335696220398,
        -0.7013760805130005,
        -0.210970938205719,
        0.07116222381591797,
        -0.5385472774505615,
        0.614098072052002,
        -0.5579910278320312,
        -0.05664941295981407,
        0.46754899621009827,
        0.29739803075790405,
        0.08518660813570023,
        -0.983746349811554,
        -0.7741445302963257,
        0.11342372000217438,
        -0.07730864733457565,
        -0.25609108805656433,
        0.03149516507983208,
        -0.5499358773231506,
        0.2829279899597168,
        0.11974587291479111,
        -0.9879363179206848,
        -0.05923546850681305,
        0.5974826812744141,
        -0.4006381630897522,
        -0.03887235000729561,
        -0.5687828063964844,
        -0.5165091156959534,
        -0.4309867322444916,
        -0.1249275654554367,
        -0.4014110863208771,
        0.17698004841804504,
        -0.39904019236564636,
        -0.2132728397846222,
        -0.7994280457496643,
        -0.7117571234703064,
        0.29179468750953674,
        -0.8148488402366638,
        0.026082029566168785,
        -0.766897439956665,
        -1.037367820739746,
        0.14273343980312347,
        0.2803305983543396,
        -0.09892570972442627,
        -0.07506555318832397,
        -0.5027904510498047,
        0.2467365562915802,
        -0.14552251994609833,
        0.3669988214969635,
        -0.4289150536060333,
        0.003657171968370676,
        0.4859391450881958,
        0.13549195230007172,
        -0.19757676124572754,
        -0.22312059998512268,
        0.1383964568376541,
        0.3263789117336273,
        0.05986408144235611,
        -0.14679637551307678,
        -0.06462431699037552,
        -0.6303738355636597,
        0.1528378129005432,
        -0.05533596873283386,
        -0.344877153635025,
        -0.0008284482755698264,
        0.7047248482704163,
        0.34959080815315247,
        0.10774771124124527,
        -0.36623141169548035,
        0.1144203394651413,
        0.49852362275123596,
        -0.19174134731292725,
        0.01085631176829338,
        -0.17763173580169678,
        -0.32745781540870667,
        0.1461988389492035,
        0.2848424017429352,
        -0.6066111326217651,
        -0.5246487259864807,
        0.659371554851532,
        -0.02488481067121029,
        0.767734944820404,
        -0.07294559478759766,
        -0.21632236242294312,
        -0.2677783966064453,
        -0.12456310540437698,
        0.033866435289382935,
        -0.465169221162796,
        0.16874960064888,
        -0.28325992822647095,
        -0.39316412806510925,
        -0.5290847420692444,
        -0.3445599377155304,
        0.00215437775477767,
        0.12089963257312775,
        0.12946411967277527,
        -0.4418953061103821,
        -0.1764431744813919,
        0.814527690410614,
        0.5691647529602051,
        -0.4211311936378479,
        0.1408945769071579,
        -0.5263909697532654,
        -0.18331289291381836,
        -0.6893966197967529,
        0.0701981633901596,
        0.27373605966567993,
        0.6913801431655884,
        -0.06052228808403015,
        0.09077819436788559,
        -0.30863919854164124,
        -0.16962473094463348,
        0.17135600745677948,
        -0.7535736560821533,
        0.013501630164682865,
        0.007715317886322737,
        0.0866900086402893,
        -0.26755547523498535,
        0.22149410843849182,
        0.3480381369590759,
        -1.1704444885253906,
        -0.011331743560731411,
        -0.785224199295044,
        -0.17451325058937073,
        -0.24161802232265472,
        0.06420735269784927,
        0.22269882261753082,
        -0.20723921060562134,
        -0.458975225687027,
        0.5637009739875793,
        -0.5907912850379944,
        -0.1743398904800415,
        0.48236706852912903,
        0.16371141374111176,
        0.020557144656777382,
        -0.38488465547561646,
        0.43651801347732544,
        0.013522099703550339,
        0.31549763679504395,
        -0.6874865889549255,
        0.4748060405254364,
        0.10929887741804123,
        -0.31574156880378723,
        -0.1648789793252945,
        0.4832037687301636,
        0.18392539024353027,
        -0.31412944197654724,
        -0.19559252262115479,
        0.10239138454198837,
        -0.19157655537128448,
        -0.37843650579452515,
        0.21819700300693512,
        -0.2416776418685913,
        -0.37660062313079834,
        0.24387004971504211,
        0.36476755142211914,
        0.025607379153370857,
        0.25245237350463867,
        0.42685577273368835,
        -0.3241898715496063,
        0.26061299443244934,
        -0.3325028717517853,
        -0.3796261250972748,
        0.5835728645324707,
        -0.23444505035877228,
        0.04701891914010048,
        0.35241782665252686,
        0.06168539449572563,
        0.7338084578514099,
        0.055834658443927765,
        -1.0250296592712402,
        0.011973503045737743,
        -0.4673343002796173,
        -0.041619159281253815,
        0.3639511466026306,
        0.3311710059642792,
        -0.5184870958328247,
        0.21348103880882263,
        0.26637595891952515,
        -0.2071884423494339,
        -0.3104972243309021,
        -0.23605681955814362,
        -0.15318697690963745,
        -0.6398066878318787,
        -0.4844529926776886,
        0.0006792731583118439,
        -0.5040102005004883,
        0.19995225965976715,
        0.25714582204818726,
        0.07285836338996887,
        0.20857708156108856,
        -0.31381937861442566,
        -0.28313496708869934,
        -0.49634650349617004,
        -0.07646767795085907,
        -0.5399231314659119,
        0.4501309096813202,
        0.6493116021156311,
        -0.028165537863969803,
        -0.3386070132255554,
        -0.2799474596977234,
        -0.4250081777572632,
        0.4675552248954773,
        0.7309203147888184,
        0.5626345276832581,
        0.060457926243543625,
        0.7148265838623047,
        -0.38598257303237915,
        -0.17329607903957367,
        -0.0176845770329237,
        0.27975091338157654,
        -0.7167630791664124,
        0.26677727699279785,
        0.07310935854911804,
        -0.12478090822696686,
        0.4951219856739044,
        -0.12899097800254822,
        0.14592237770557404,
        -0.21073751151561737,
        -0.20460718870162964,
        0.43179795145988464,
        0.01680290885269642,
        -0.18627946078777313,
        -0.2601942718029022,
        0.5289704203605652,
        0.08481871336698532,
        0.2675032317638397,
        -0.7309389710426331,
        -0.0614798367023468,
        0.273146390914917,
        -0.8333561420440674,
        -0.2649654448032379,
        -0.03175702691078186,
        -0.3938731253147125,
        -0.07609687745571136,
        0.49257692694664,
        0.12100403755903244,
        0.24992384016513824,
        0.25555863976478577,
        -0.38518938422203064,
        -0.09260855615139008,
        0.1462663859128952,
        0.38100236654281616,
        0.22223913669586182,
        -0.24863454699516296,
        0.10829909890890121,
        -0.17953433096408844,
        0.3881337642669678,
        -0.27410203218460083,
        0.16250059008598328,
        0.10716725140810013,
        0.3583287000656128,
        0.06870752573013306,
        -0.20723438262939453,
        0.22762784361839294,
        -0.4279673099517822,
        -0.21645587682724,
        0.10589637607336044,
        0.1447487473487854,
        0.38084691762924194,
        -0.40229880809783936,
        0.295354962348938,
        0.2824326753616333,
        -0.05238938331604004,
        0.15758398175239563,
        -0.04033166915178299,
        0.27018922567367554,
        -0.28994694352149963,
        -0.06593907624483109,
        0.7738704681396484,
        0.006939548533409834,
        -0.08196944743394852,
        -0.08586528897285461,
        -0.25650063157081604,
        -0.047927360981702805,
        -0.05303703993558884,
        0.04497183486819267,
        0.5562619566917419,
        -0.1028079092502594,
        0.6796340346336365,
        0.6345525979995728,
        -0.2591288983821869,
        0.6067225337028503,
        0.15487529337406158,
        0.02880910038948059,
        -0.32958388328552246,
        0.03744014352560043,
        0.1699167788028717,
        0.36652418971061707,
        0.6119776368141174,
        -0.15026290714740753,
        0.3746216595172882,
        0.06577356904745102,
        -0.10660482197999954,
        0.6084282398223877,
        0.25064903497695923,
        0.060209501534700394,
        0.010615911334753036,
        0.2698291540145874,
        0.32750073075294495,
        -0.7675551176071167,
        -0.458625853061676,
        -0.01727362722158432,
        -0.26654091477394104,
        0.3276507556438446,
        0.14426515996456146,
        0.13690946996212006,
        0.2806461453437805,
        -0.524245023727417,
        -0.5714046955108643,
        -0.4532402753829956,
        -0.39011937379837036,
        0.12971743941307068,
        -0.2627047002315521,
        -0.7877631783485413,
        0.03434419259428978,
        0.17022721469402313,
        -0.41638869047164917,
        -0.01724153384566307,
        -0.8383598327636719,
        -0.11845272779464722,
        0.22927124798297882,
        0.2242075800895691,
        0.10808726400136948,
        -0.3711528480052948,
        0.17826002836227417,
        0.36906012892723083,
        -0.2702752947807312,
        -0.4627758264541626,
        0.10449565947055817,
        0.046510472893714905,
        -0.06091941148042679,
        -0.2979195713996887,
        0.3536912500858307,
        -0.6927425265312195,
        0.30803945660591125,
        -0.04533987492322922,
        0.15989942848682404,
        0.26273271441459656,
        -0.539787769317627,
        -0.4651654362678528,
        0.346103310585022,
        0.1851254403591156,
        0.3671807050704956,
        -0.4155145287513733,
        0.3248675465583801,
        0.17760124802589417,
        -0.7306697964668274,
        -0.22264263033866882,
        -0.18094402551651,
        -0.3491738736629486,
        -0.32948043942451477,
        -0.3710574805736542,
        -0.0790402814745903,
        -0.058513883501291275,
        -0.5193356275558472,
        0.31949883699417114,
        0.22947800159454346,
        -1.0519776344299316,
        -0.41034770011901855,
        -0.26016029715538025,
        -0.2890810966491699,
        0.2973948121070862,
        0.10761770606040955,
        0.5363905429840088,
        -0.12517261505126953,
        -0.2505073845386505,
        -0.35711854696273804,
        -0.649584949016571,
        -0.055277034640312195,
        0.17007692158222198,
        -0.11024797707796097,
        0.7367233037948608,
        -0.1171427071094513,
        -0.2151927500963211,
        0.2637392282485962,
        -0.6174044013023376,
        -0.28538286685943604,
        0.5198444724082947,
        0.2776035964488983,
        -0.09308969974517822,
        -0.08732316642999649,
        -0.04273358732461929,
        0.5216525793075562,
        0.16186115145683289,
        -0.360381156206131,
        0.04756554961204529,
        -0.626430332660675,
        -0.24329005181789398,
        0.11094855517148972,
        0.6099777817726135,
        -0.40793123841285706,
        -0.04114731028676033,
        0.5545831322669983,
        0.20556151866912842,
        -0.6921976804733276,
        0.5675387978553772,
        0.36741188168525696,
        -0.4476456046104431,
        0.1530432105064392,
        0.4586654603481293,
        -0.4032793343067169,
        0.27253028750419617,
        -0.46299076080322266,
        -0.07271618396043777,
        0.40304481983184814,
        0.13980643451213837,
        0.33501386642456055,
        -0.4531490206718445,
        -0.7695604562759399,
        -0.5720682144165039,
        0.3301733136177063,
        0.699902355670929,
        -0.5427592992782593,
        0.4698824882507324,
        -0.45037898421287537,
        0.5889682173728943,
        0.027682818472385406,
        0.3453514277935028,
        0.05144760012626648,
        0.1286214292049408,
        0.5785665512084961,
        0.10302224010229111,
        0.2012266218662262,
        -0.5235729217529297,
        -0.3233020603656769,
        -0.5338332653045654,
        -0.04614466801285744,
        0.004262165166437626,
        0.14109162986278534,
        0.004469630308449268,
        0.29010868072509766,
        -0.33126989006996155,
        0.30771777033805847,
        0.2024485170841217,
        -0.7817794680595398,
        -0.4934241771697998,
        0.21876280009746552,
        0.035290490835905075,
        -0.41678112745285034,
        -0.06659210473299026,
        0.08413034677505493,
        -0.28339001536369324,
        -0.24864597618579865,
        -0.12353761494159698,
        -0.18105943500995636,
        -0.16528724133968353,
        -0.5135087966918945,
        -0.12857688963413239,
        -0.09999734163284302,
        -0.02222122997045517,
        0.0187761802226305,
        0.4283062815666199,
        0.6134350895881653,
        0.2003975361585617,
        -0.23374435305595398,
        0.40605536103248596,
        -0.46552664041519165,
        0.6800801753997803,
        -0.2597445249557495,
        -0.5778895020484924,
        -0.013776237145066261,
        0.5186129808425903,
        0.30662065744400024,
        -0.9111066460609436,
        -0.058020979166030884,
        0.38368096947669983,
        -0.44354990124702454,
        0.11938753724098206,
        0.015038379468023777,
        -0.24680015444755554,
        -0.2600337862968445,
        0.021092301234602928,
        0.3011140823364258,
        -0.010617779567837715,
        -0.0560368075966835,
        -0.14775924384593964,
        -0.5500582456588745,
        -0.39580583572387695,
        0.16967231035232544,
        -0.1056119054555893,
        -0.08109903335571289,
        0.4365788996219635,
        0.3555969297885895,
        0.11787932366132736,
        0.03695812448859215,
        -1.0094820261001587,
        -0.01798638515174389,
        -0.20807942748069763,
        0.19727537035942078,
        0.4960842430591583,
        -0.02933705598115921,
        -0.032421331852674484,
        0.06431757658720016,
        -0.0009936282876878977,
        -0.3797954022884369,
        0.11372023075819016,
        -0.09957285225391388,
        -0.306138277053833,
        -0.3697940409183502,
        -0.22766593098640442,
        -0.3668057322502136,
        0.2949114739894867,
        -0.005497854668647051,
        -1.2949751615524292,
        0.22653000056743622,
        -0.03510558232665062,
        0.7081829905509949,
        0.33361300826072693,
        -0.18254360556602478,
        -0.11332765966653824,
        -0.3264063000679016,
        0.04551426321268082,
        0.7684175372123718,
        -0.2759736180305481,
        0.01888682134449482,
        -0.449309766292572,
        0.14699988067150116,
        0.4973706007003784,
        -0.2272750437259674,
        -0.030853603035211563,
        0.27954527735710144,
        0.33594390749931335,
        -0.7598718404769897,
        -0.21564516425132751,
        0.006558711174875498,
        0.02341901697218418,
        0.03374551236629486,
        -0.24405315518379211,
        0.23548200726509094,
        -0.49514779448509216,
        -0.41001105308532715,
        -0.5275765061378479,
        -0.05271288380026817,
        -0.12342321127653122,
        -0.42773398756980896,
        0.5753200054168701,
        0.5947043895721436,
        0.02184782177209854,
        0.35189303755760193,
        -0.07328388094902039,
        0.14452455937862396,
        0.489769846200943,
        0.24010339379310608,
        -0.07460247725248337,
        0.16437311470508575,
        -0.7043868899345398,
        -0.44466885924339294,
        -0.5664169192314148,
        -0.17565898597240448,
        -0.006507332902401686,
        -0.02399022877216339,
        0.12375975400209427,
        -0.8832249045372009,
        -0.2472337931394577,
        -0.3614828586578369,
        0.015844712033867836,
        0.2988765835762024,
        -0.22965094447135925,
        -0.1341613382101059,
        0.18762759864330292,
        0.5289872288703918,
        0.5241857171058655,
        -1.0546965599060059,
        -0.3155598044395447,
        0.19105921685695648,
        -0.20628704130649567,
        -1.2603410482406616,
        -0.23287010192871094,
        0.03670835122466087,
        0.521586000919342,
        -0.3118650019168854,
        0.14698831737041473,
        -0.5076979994773865,
        -0.25523632764816284,
        -0.8062767386436462,
        -0.15898004174232483,
        0.04344725236296654,
        -0.25927263498306274,
        -0.29166674613952637,
        -0.25855743885040283,
        0.014794652350246906,
        0.20358045399188995,
        -0.14907163381576538,
        -0.5132901668548584,
        -0.5621469020843506,
        0.5387867093086243,
        0.2745346128940582,
        0.001483662286773324,
        0.12101801484823227,
        0.09888807684183121,
        -0.008752940222620964,
        -1.0621330738067627,
        -0.041501663625240326,
        -0.0017763706855475903,
        0.06502876430749893,
        -0.37056052684783936,
        -0.016538143157958984,
        -0.31663382053375244,
        -0.03461065888404846,
        -0.2992487847805023,
        -0.18320542573928833,
        0.2730039060115814,
        -0.2545868754386902,
        -0.28897491097450256,
        0.33743250370025635,
        0.41134682297706604,
        -0.1622542291879654,
        -0.5639912486076355,
        0.04991326853632927,
        0.5283787846565247,
        -0.08765096217393875,
        0.15896905958652496,
        0.668293833732605,
        -0.755474865436554,
        -0.39911842346191406,
        0.0009495238773524761,
        0.31143930554389954,
        -0.4596128761768341,
        0.005868860986083746,
        0.1616533100605011,
        -0.16722631454467773,
        -0.2134425938129425,
        -0.4531891644001007,
        -0.2767437696456909,
        0.13716019690036774,
        0.18732856214046478,
        -0.532383143901825,
        -0.055642269551754,
        0.14492399990558624,
        -0.3359031081199646,
        0.18226930499076843,
        0.11498422175645828,
        -0.20207718014717102,
        -0.052037563174963,
        0.44118672609329224,
        -0.6916228532791138,
        -0.34951213002204895,
        0.004281026776880026,
        -0.2951345443725586,
        -0.3199318051338196,
        0.36195024847984314,
        -0.2321859747171402,
        0.15855655074119568,
        -0.11214566975831985,
        0.022172560915350914,
        0.3093390464782715,
        -0.12063657492399216,
        -0.3342205584049225,
        0.4110592007637024,
        0.6584814786911011,
        0.08881960809230804,
        0.358951598405838,
        -0.2238166481256485,
        0.2644921839237213,
        0.5090488195419312,
        -0.08946134895086288,
        0.6836491823196411,
        -0.7239118814468384,
        0.24330048263072968,
        -0.5858104228973389,
        -0.14271165430545807,
        -0.41073936223983765,
        0.28444892168045044,
        0.18806473910808563,
        -0.03866935521364212,
        0.08645810186862946,
        -0.15199726819992065,
        0.30989494919776917,
        -0.5688515901565552,
        -0.29381775856018066,
        0.1632874310016632,
        -0.2942923307418823,
        0.4692701995372772,
        0.4211874008178711,
        -0.06023828312754631,
        -0.37182289361953735,
        -0.014099032618105412,
        -0.26660674810409546,
        0.05470312014222145,
        0.04357033222913742,
        -0.9676334261894226,
        -0.9334384799003601,
        -0.5899390578269958,
        -0.8067085146903992,
        0.3095209300518036,
        -0.08847758919000626,
        -0.08925501257181168,
        0.1825471967458725,
        0.12414252012968063,
        0.2693363130092621,
        -0.3442327380180359,
        0.4832038879394531,
        0.6938095688819885,
        0.12470073997974396,
        -0.31064391136169434,
        -0.3199494183063507,
        0.7403638362884521,
        -0.34193503856658936,
        -0.10912472009658813,
        0.4335620701313019,
        0.15481483936309814,
        -0.00859647523611784,
        -0.18205781280994415,
        -0.19168008863925934,
        -0.4648418426513672,
        0.15408802032470703,
        -0.32672274112701416,
        0.33638811111450195,
        0.0008920623222365975,
        -0.4437997043132782,
        -0.12301026284694672,
        -0.6990824341773987,
        -0.6678744554519653,
        -0.1631021499633789,
        0.17344383895397186,
        -0.09152725338935852,
        -0.0948367714881897,
        0.5300465822219849,
        -0.38600605726242065,
        -0.8717396855354309,
        0.3855404853820801,
        0.39473870396614075,
        -0.47051143646240234,
        -0.14949874579906464,
        -0.6191318035125732,
        -0.02403656207025051,
        -0.011676554568111897,
        -0.22441771626472473,
        -0.08639528602361679,
        -0.12887319922447205,
        -0.07297233492136002,
        0.14211052656173706,
        0.15821045637130737,
        -0.5114061832427979,
        -0.17920546233654022,
        0.05362723022699356,
        -0.09127185493707657,
        -0.33010146021842957,
        -0.016955284401774406,
        -0.35461536049842834,
        -0.17607726156711578,
        0.2151407152414322,
        -0.5854840874671936,
        -0.14251677691936493,
        -0.2207961529493332,
        0.47272613644599915,
        -0.28158271312713623,
        -0.10963456332683563,
        -0.01656457968056202,
        0.17514993250370026,
        -0.012891908176243305,
        0.4021141529083252,
        -0.18798132240772247,
        -0.026198534294962883,
        -0.2953326404094696,
        -0.14836432039737701,
        -0.0020754076540470123,
        0.5551800727844238,
        -0.011971556581556797,
        -0.38708728551864624,
        -0.1562313735485077,
        0.01916447840631008,
        -0.3007746636867523,
        0.5731175541877747,
        -0.21952003240585327,
        -0.4401001036167145,
        -0.10398592799901962,
        -0.07968217879533768,
        0.41718950867652893,
        0.5431897640228271,
        -0.4712262451648712,
        -0.3434624671936035,
        -0.6385447978973389,
        0.10245133936405182,
        -0.1752297431230545,
        -0.05414433404803276,
        -0.19532018899917603,
        0.3723081946372986,
        0.4051050543785095,
        0.5138376355171204,
        0.04111120104789734,
        -0.10789390653371811,
        -0.31213003396987915,
        -0.34128671884536743,
        0.15525147318840027,
        0.6099904179573059,
        0.05607350543141365,
        0.12329302728176117,
        0.15222781896591187,
        0.24592550098896027,
        -0.037259798496961594,
        -0.06349372118711472,
        -0.11131025105714798,
        -0.5909008979797363,
        -0.31751441955566406,
        0.2906467020511627,
        -0.5798951387405396,
        -0.1489112675189972,
        -0.00746435672044754,
        -0.25950226187705994,
        0.5539697408676147,
        -0.5772314071655273,
        0.23835419118404388,
        -0.43851348757743835,
        0.14021703600883484,
        -0.08552379161119461,
        0.09796161204576492,
        0.28811538219451904,
        0.0512530617415905,
        0.15527227520942688,
        0.11984450370073318,
        0.08359654247760773,
        -0.039490651339292526,
        0.2839382588863373,
        0.2573951780796051,
        0.5519775748252869,
        0.07817733287811279,
        0.14616842567920685,
        -0.13741730153560638,
        0.2622145414352417,
        -0.22404853999614716,
        -0.33847346901893616,
        -0.08759421110153198,
        0.009653313085436821,
        -0.38805878162384033,
        0.2620258927345276,
        -0.12930472195148468,
        -0.04489166662096977,
        -0.2065490335226059,
        0.0054760342463850975,
        0.35049235820770264,
        -0.25282832980155945,
        -0.18810079991817474,
        -0.060921747237443924,
        0.5514675378799438,
        -0.11513222008943558,
        -0.08353543281555176,
        -0.5056367516517639,
        -0.10371700674295425,
        -0.2700420320034027,
        -0.6322076320648193,
        -0.4927568733692169,
        0.6631156802177429,
        0.23455823957920074,
        -0.0041122171096503735,
        0.4047089219093323,
        -0.11535169929265976,
        0.6938495635986328,
        0.14881838858127594,
        -0.012647583149373531,
        0.05748780816793442,
        -0.264654278755188,
        -0.6020857095718384,
        -0.6349824070930481,
        -0.11315323412418365,
        0.06200406327843666,
        0.053728509694337845,
        0.4650776982307434,
        0.23106610774993896,
        -0.539969801902771,
        -0.08929411321878433,
        -0.25599536299705505,
        0.3663574755191803,
        0.17894935607910156,
        -0.3923277258872986,
        0.052948251366615295,
        0.49324852228164673,
        -0.36622512340545654,
        -0.2714006006717682,
        -0.2061081975698471,
        -0.2555467486381531,
        0.3974367082118988,
        0.46489235758781433,
        0.035899143666028976,
        -0.258269339799881,
        0.564850389957428,
        -0.17655931413173676,
        0.2139991968870163,
        0.30149614810943604,
        0.06359013170003891,
        -0.5156034231185913,
        0.5961986184120178,
        0.5857545137405396,
        -0.0554235614836216,
        0.06719319522380829,
        -0.6072194576263428,
        0.07552843540906906,
        -0.015626490116119385,
        -0.35933902859687805,
        0.35420018434524536,
        -0.38253509998321533,
        0.11003313958644867,
        0.0529279001057148,
        0.10171116143465042,
        -0.3981218934059143,
        -0.08322988450527191,
        -0.5216878056526184,
        -0.39953914284706116,
        0.5085855722427368,
        0.6788037419319153,
        0.07544092833995819,
        -0.21541036665439606,
        -0.38765910267829895,
        0.16910243034362793,
        -0.1929548978805542,
        -0.2871612012386322,
