{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        15,
        64
      ],
      "dtype": "float32",
      "data": [
        -0.430683434009552,
        0.22751279175281525,
        -0.41421136260032654,
        -0.16990360617637634,
        0.020157746970653534,
        0.3441043198108673,
        0.2815716564655304,
        0.37090590596199036,
        0.216147318482399,
        0.11479061841964722,
        -0.33832961320877075,
        0.261802613735199,
        -0.02242364175617695,
        0.052966322749853134,
        -0.07510580867528915,
        -0.2536526024341583,
        0.1998557448387146,
        -0.6598786115646362,
        0.2145046591758728,
        -0.251746267080307,
        -0.6496158242225647,
        0.4212530553340912,
        -0.3309355080127716,
        -0.07865070551633835,
        0.15352441370487213,
        -0.08357509225606918,
        -0.25488582253456116,
        0.12699654698371887,
        -0.10796910524368286,
        -0.4756495952606201,
        -0.05583345517516136,
        -0.003913598600775003,
        0.22713078558444977,
        0.08010754734277725,
        -0.4511421322822571,
        0.08898768573999405,
        0.08284297585487366,
        -0.0799112394452095,
        0.12667058408260345,
        -0.14174562692642212,
        -0.04132356122136116,
        -0.24875369668006897,
        -0.5983756184577942,
        -0.05454912781715393,
        -0.19329142570495605,
        -0.15968281030654907,
        -0.2827998101711273,
        -0.39262503385543823,
        -0.5200291872024536,
        -0.5112372636795044,
        0.3743405342102051,
        -0.09618747234344482,
        0.0009233375312760472,
        0.4445370137691498,
        0.12521199882030487,
        0.11888542771339417,
        0.28031647205352783,
        -0.34307488799095154,
        0.07033758610486984,
        0.45486801862716675,
        -0.052291467785835266,
        -0.06707971543073654,
        0.06357205659151077,
        0.19061218202114105,
        0.051729150116443634,
        0.040638893842697144,
        0.6531605124473572,
        0.2410832941532135,
        0.03784782066941261,
        0.10907531529664993,
        -0.4836742877960205,
        0.5357142686843872,
        -0.07932733744382858,
        -0.08156315982341766,
        0.057984814047813416,
        -0.004180304240435362,
        -0.12871722877025604,
        0.5280298590660095,
        -0.14153972268104553,
        0.14683941006660461,
        0.20612893998622894,
        -0.598496675491333,
        -0.29909905791282654,
        0.07852337509393692,
        -0.15177541971206665,
        -0.2777019441127777,
        0.06253904104232788,
        0.03320365771651268,
        -0.10664021223783493,
        -0.37747877836227417,
        0.10331117361783981,
        0.6271927952766418,
        -0.5329437851905823,
        -0.3220033645629883,
        -0.08698766678571701,
        -0.01905653439462185,
        -0.044077370315790176,
        -0.5338336229324341,
        -0.02684817649424076,
        -0.053752172738313675,
        -0.0062783886678516865,
        -0.2616588771343231,
        0.1477034091949463,
        0.25130483508110046,
        -0.05148071423172951,
        0.6766833066940308,
        0.13036714494228363,
        0.6108262538909912,
        -0.4223777651786804,
        -0.18540945649147034,
        0.0617629811167717,
        -0.07466713339090347,
        0.567843496799469,
        0.056131958961486816,
        -0.19316983222961426,
        0.04847438633441925,
        -0.4975466728210449,
        0.4205314815044403,
        -0.011741796508431435,
        0.3364369869232178,
        -0.22448991239070892,
        -0.46918120980262756,
        0.5675787329673767,
        0.29358235001564026,
        -0.3282460570335388,
        -0.4245726466178894,
        -0.33395159244537354,
        -0.4464063048362732,
        0.36022061109542847,
        -0.007472732104361057,
        -0.26690876483917236,
        0.506196141242981,
        0.019388390704989433,
        -0.17498931288719177,
        -0.1349802315235138,
        -0.3970172107219696,
        -0.21480385959148407,
        -0.051133181899785995,
        -0.29892611503601074,
        0.4446408450603485,
        0.3908131420612335,
        -0.3010062873363495,
        -0.15391792356967926,
        -0.4146575629711151,
        0.019094137474894524,
        0.18376906216144562,
        -0.48428377509117126,
        0.08891119062900543,
        -0.5493720173835754,
        -0.31461018323898315,
        0.07375846058130264,
        0.36508557200431824,
        0.16821615397930145,
        0.4865807890892029,
        -0.15215246379375458,
        0.19420799612998962,
        0.15797775983810425,
        0.061779383569955826,
        -0.2534792423248291,
        -0.4593367874622345,
        -0.13148553669452667,
        0.09996102750301361,
        0.33375483751296997,
        -0.3435208797454834,
        -0.005613498855382204,
        -0.620018482208252,
        0.028367282822728157,
        -0.1661376804113388,
        0.4382767975330353,
        -0.04075560346245766,
        -0.25668275356292725,
        -0.25084590911865234,
        -0.38803017139434814,
        0.21588429808616638,
        -0.00006174090958666056,
        0.015274254605174065,
        -0.37401658296585083,
        0.5051413178443909,
        -0.37756386399269104,
        -0.08133641630411148,
        0.0913761705160141,
        0.05161292105913162,
        0.13448719680309296,
        -0.4296427369117737,
        -0.9148107767105103,
        0.02602384239435196,
        -0.3622135519981384,
        0.2641350328922272,
        0.1462348848581314,
        0.29823994636535645,
        -0.3551101088523865,
        0.02715960331261158,
        0.17553845047950745,
        -0.12938588857650757,
        0.42512109875679016,
        0.09625785797834396,
        0.6804875731468201,
        -0.33062639832496643,
        -0.057336077094078064,
        -0.611653745174408,
        0.2570658326148987,
        0.21854493021965027,
        -0.008706721477210522,
        0.45866072177886963,
        -0.529290497303009,
        -0.07862231880426407,
        0.1115880161523819,
        0.019888460636138916,
        0.3078819215297699,
        -0.1769035905599594,
        0.6520513892173767,
        -0.4850958287715912,
        -0.2483455240726471,
        0.17897865176200867,
        0.4384445250034332,
        -0.4528113603591919,
        -0.03413199633359909,
        0.41712456941604614,
        -0.39671143889427185,
        0.24802570044994354,
        0.21031570434570312,
        -0.18764272332191467,
        -0.08300464600324631,
        0.27554765343666077,
        0.325666218996048,
        0.1678379625082016,
        0.22138169407844543,
        -0.11381788551807404,
        0.41924428939819336,
        -0.2404775470495224,
        0.12504395842552185,
        -0.006901614833623171,
        0.5678341388702393,
        0.020313166081905365,
        -0.21199937164783478,
        -0.11214549839496613,
        0.052817825227975845,
        -0.1960640698671341,
        -0.3413580656051636,
        -0.00915517657995224,
        -0.025612596422433853,
        -0.35126951336860657,
        0.07705036550760269,
        -0.03405086323618889,
        -0.246324360370636,
        -0.08240676671266556,
        -0.007240236736834049,
        0.05681970715522766,
        -0.6159558296203613,
        0.44762900471687317,
        -0.6205888986587524,
        0.3166230022907257,
        0.2493695467710495,
        -0.15859077870845795,
        -0.11101961135864258,
        -0.16097432374954224,
        0.2509656250476837,
        0.07102758437395096,
        -0.08692417293787003,
        -0.363793283700943,
        0.7276515960693359,
        -0.26218003034591675,
        -0.056520987302064896,
        0.36711427569389343,
        0.27441394329071045,
        0.22978980839252472,
        0.22450457513332367,
        0.06393832713365555,
        -0.37791886925697327,
        -0.43122267723083496,
        -0.17821180820465088,
        -0.5946914553642273,
        0.039483461529016495,
        0.2699049413204193,
        -0.2864885628223419,
        0.02554422803223133,
        -0.25255122780799866,
        0.029230942949652672,
        0.5439512729644775,
        0.6863850355148315,
        0.6142758727073669,
        -0.3340758979320526,
        -0.08313523232936859,
        0.10884988307952881,
        -0.3443583846092224,
        -0.07011335343122482,
        -0.5839741826057434,
        -0.4712219536304474,
        0.11708471179008484,
        0.41666826605796814,
        0.46685415506362915,
        -0.11992023140192032,
        0.09454821050167084,
        0.370745986700058,
        -0.3384038805961609,
        0.7384636402130127,
        -0.3222011923789978,
        -0.06652216613292694,
        -0.08890623599290848,
        -0.18325605988502502,
        0.1375083029270172,
        0.0855686366558075,
        0.0005781801883131266,
        -0.2084788978099823,
        -0.3396078944206238,
        -0.3965578079223633,
        0.05954026058316231,
        0.420440137386322,
        -0.010897508822381496,
        0.22577503323554993,
        -0.33121028542518616,
        -0.6212454438209534,
        -0.5447601079940796,
        -0.08942551165819168,
        -0.33808350563049316,
        0.07269036769866943,
        -0.2320840209722519,
        -0.16062940657138824,
        0.32427796721458435,
        0.6273775696754456,
        -0.3941519558429718,
        -0.16261626780033112,
        -0.09680873900651932,
        -0.10883703827857971,
        0.09553063660860062,
        0.4220803380012512,
        0.3472360372543335,
        0.1329396665096283,
        -0.48407796025276184,
        0.16212019324302673,
        -0.20481723546981812,
        -0.34301021695137024,
        0.13442844152450562,
        -0.2022080421447754,
        -0.48690399527549744,
        0.45327821373939514,
        0.1972123682498932,
        0.25932395458221436,
        -0.05487203970551491,
        -0.3383609652519226,
        0.030505739152431488,
        -0.0009149999241344631,
        -0.25965389609336853,
        0.24462060630321503,
        -0.3691233694553375,
        0.5144523978233337,
        -0.0461299903690815,
        0.05913570150732994,
        0.17430472373962402,
        -0.6115440130233765,
        -0.22140303254127502,
        -0.06852970272302628,
        0.29403984546661377,
        -0.42769932746887207,
        -0.3668458163738251,
        0.3497885465621948,
        -0.41306108236312866,
        -0.05467689037322998,
        0.041916944086551666,
        -0.15680409967899323,
        0.5939532518386841,
        0.562152624130249,
        -0.0851571336388588,
        0.6427637934684753,
        -0.35619693994522095,
        0.11231838166713715,
        -0.4471355378627777,
        0.6103643774986267,
        -0.10848371684551239,
        0.312447726726532,
        -0.6062667965888977,
        0.08896379917860031,
        -0.4787077307701111,
        0.2936900854110718,
        0.257816344499588,
        -0.008513630367815495,
        0.09830023348331451,
        -0.1313771903514862,
        0.4062856435775757,
        0.1302614063024521,
        0.3281033933162689,
        -0.41314277052879333,
        -0.18885363638401031,
        0.769138514995575,
        0.0708928033709526,
        -0.5546276569366455,
        0.05480452999472618,
        0.09586808830499649,
        -0.3248497247695923,
        0.4345732629299164,
        0.20222815871238708,
        -0.5031360387802124,
        0.15326012670993805,
        -0.2534627616405487,
        0.059915319085121155,
        0.022808263078331947,
        0.15111713111400604,
        0.43901705741882324,
        0.3978537321090698,
        -0.43438521027565,
        0.6901488900184631,
        0.1318497359752655,
        -0.4519036114215851,
        -0.2633444666862488,
        -0.37225762009620667,
        -0.4622116982936859,
        -0.3194099962711334,
        0.1515188217163086,
        -0.2850531339645386,
        0.00035422356449998915,
        -0.043004315346479416,
        -0.22675585746765137,
        -0.021039962768554688,
        0.4135153591632843,
        -0.35374870896339417,
        0.2598183751106262,
        0.2247161716222763,
        -0.2472846806049347,
        -0.13535717129707336,
        0.2276998609304428,
        -0.018954863771796227,
        0.2871679961681366,
        -0.3570575714111328,
        -0.32583507895469666,
        -0.012471193447709084,
        0.7574250102043152,
        -0.23513595759868622,
        0.19321714341640472,
        0.7510722279548645,
        0.4849507808685303,
        -0.10807495564222336,
        -0.3613351583480835,
        -0.4864850640296936,
        -0.20789124071598053,
        -0.4428248405456543,
        -0.08331698924303055,
        0.046168431639671326,
        0.3565598130226135,
        0.09353607892990112,
        -0.19129154086112976,
        0.1967146098613739,
        0.22400923073291779,
        -0.3420146405696869,
        0.35954928398132324,
        0.6766955852508545,
        0.3119240701198578,
        -0.26871806383132935,
        0.12679459154605865,
        0.16718511283397675,
        0.22381944954395294,
        -0.266120046377182,
        0.21488288044929504,
        0.2315676063299179,
        -0.3010190725326538,
        -0.2389097660779953,
        0.1941511034965515,
        -0.052497498691082,
        -0.40140432119369507,
        -0.5165449380874634,
        -0.16418516635894775,
        0.17423173785209656,
        0.001334129716269672,
        -0.4760421812534332,
        0.09398578107357025,
        0.07594408094882965,
        -0.0019435628782957792,
        0.30658861994743347,
        0.18464453518390656,
        -0.09365331381559372,
        0.10162990540266037,
        -0.1641804575920105,
        0.5044687986373901,
        -0.08308620005846024,
        0.46582385897636414,
        -0.1527681201696396,
        -0.5626369118690491,
        0.14208397269248962,
        -0.15405046939849854,
        -0.009217232465744019,
        -0.4190210998058319,
        -0.017989186570048332,
        0.14220213890075684,
        -0.2789885103702545,
        -0.33026567101478577,
        0.002039880957454443,
        0.004277489613741636,
        0.08105914294719696,
        -0.581136167049408,
        0.02156156674027443,
        0.5386735796928406,
        0.0704895406961441,
        -0.37511977553367615,
        0.22980833053588867,
        0.3160637617111206,
        0.48029473423957825,
        0.5518128275871277,
        -0.03599386662244797,
        0.4073761999607086,
        -0.18117490410804749,
        0.011420079506933689,
        -0.05756964161992073,
        -0.22511667013168335,
        -0.12282635271549225,
        0.5174538493156433,
        -0.016666777431964874,
        0.037837717682123184,
        -0.5040895342826843,
        -0.4593120813369751,
        0.31056079268455505,
        0.5347520112991333,
        0.3703280985355377,
        -0.26313337683677673,
        -0.39071670174598694,
        0.5224770307540894,
        -0.11165761202573776,
        -0.014647899195551872,
        -0.3663799464702606,
        -0.2794715464115143,
        0.17981590330600739,
        0.021343709900975227,
        -0.2614322006702423,
        0.23880386352539062,
        0.6650387048721313,
        -0.12039129436016083,
        0.016468672081828117,
        -0.23808205127716064,
        -0.3369523882865906,
        -0.22679932415485382,
        0.4731003940105438,
        -0.18946194648742676,
        0.5065361857414246,
        0.31626883149147034,
        0.6090556383132935,
        -0.4571402668952942,
        -0.26565074920654297,
        -0.4422847032546997,
        0.193268820643425,
        -0.627021312713623,
        -0.3038010895252228,
        0.1674136221408844,
        0.09689919650554657,
        0.0908031016588211,
        -0.02745938114821911,
        0.33804935216903687,
        0.3691466152667999,
        -0.21566416323184967,
        0.5868133902549744,
        0.4067520201206207,
        -0.4153329133987427,
        -0.33253759145736694,
        0.004133701790124178,
        -0.13174715638160706,
        0.00020705643692053854,
        -0.2555580735206604,
        -0.23694179952144623,
        0.5553018450737,
        -0.12104441225528717,
        0.39494627714157104,
        -0.11327998340129852,
        0.3153599500656128,
        -0.37002286314964294,
        0.2902498245239258,
        -0.49613532423973083,
        0.5934416651725769,
        -0.12015124410390854,
        -0.37257686257362366,
        -0.04603031277656555,
        0.171297088265419,
        0.29095515608787537,
        0.11235816031694412,
        -0.4823850393295288,
        0.13993589580059052,
        0.19490110874176025,
        -0.5966336131095886,
        -0.013637040741741657,
        0.3207356631755829,
        0.32396069169044495,
        -0.06527737528085709,
        -0.3647902309894562,
        0.039844635874032974,
        -0.08918090909719467,
        -0.16166280210018158,
        -0.5919740796089172,
        -0.3561016917228699,
        0.15009711682796478,
        0.2456858605146408,
        0.5811076164245605,
        -0.04516356438398361,
        0.08807830512523651,
        -0.04228416830301285,
        0.2537791430950165,
        -0.34265121817588806,
        -0.45894238352775574,
        -0.24023039638996124,
        -0.030627934262156487,
        0.6948044300079346,
        -0.38280999660491943,
        -0.5728938579559326,
        0.07355767488479614,
        0.1472141444683075,
        -0.3722321391105652,
        0.17557910084724426,
        -0.2718510627746582,
        0.15064115822315216,
        0.5706380009651184,
        0.2732456624507904,
        0.43186527490615845,
        0.29519495368003845,
        -0.49415168166160583,
        -0.1549416184425354,
        -0.22878311574459076,
        -0.5206773281097412,
        -0.39954692125320435,
        0.07985052466392517,
        -0.004972304683178663,
        -0.04265369847416878,
        0.41847339272499084,
        0.1165895164012909,
        -0.2933797836303711,
        0.18824614584445953,
        0.2602055072784424,
        -0.4879964590072632,
        -0.43980634212493896,
        -0.2751729488372803,
        0.22762621939182281,
        -0.025735121220350266,
        -0.08879534155130386,
        0.6598251461982727,
        0.30815115571022034,
        0.015426372177898884,
        -0.2094801515340805,
        -0.682628333568573,
        -0.18956781923770905,
        0.21227917075157166,
        -0.6409211158752441,
        0.028978684917092323,
        0.04901667684316635,
        -0.14538568258285522,
        0.044252026826143265,
        -0.22238492965698242,
        0.19135093688964844,
        0.4234359562397003,
        0.5594861507415771,
        -0.2221112698316574,
        0.32359951734542847,
        0.5430812239646912,
        0.5885648131370544,
        0.0968005508184433,
        -0.38289621472358704,
        -0.32497233152389526,
        -0.285104364156723,
        -0.24836693704128265,
        -0.41960564255714417,
        0.15864215791225433,
        0.6789902448654175,
        -0.04646036773920059,
        0.2758949398994446,
        0.05161229893565178,
        0.3718186318874359,
        -0.27161237597465515,
        0.019046131521463394,
        0.3377370238304138,
        -0.5498996376991272,
        0.06672737002372742,
        0.2296307235956192,
        -0.2280568778514862,
        0.3209221363067627,
        -0.4827374815940857,
        -0.015557345002889633,
        -0.2950691282749176,
        0.18176287412643433,
        0.009890466928482056,
        -0.2647232413291931,
        -0.6882461905479431,
        -0.12789031863212585,
        -0.06807108968496323,
        -0.2613684833049774,
        0.38874679803848267,
        -0.3774667978286743,
        0.0057869842275977135,
        0.2810211479663849,
        0.44847553968429565,
        -0.28136691451072693,
        0.27019038796424866,
        0.27757370471954346,
        0.04676514118909836,
        0.48536786437034607,
        -0.3123142719268799,
        0.10142290592193604,
        0.07527858018875122,
        0.13921073079109192,
        0.14952287077903748,
        -0.5029099583625793,
        -0.43141424655914307,
        0.3138618767261505,
        -0.2269584685564041,
        -0.00021061560255475342,
        0.27179715037345886,
        -0.16359826922416687,
        -0.07375212758779526,
        -0.3760645091533661,
        0.07477574795484543,
        0.003911553882062435,
        -0.5188547372817993,
        0.2697448432445526,
        -0.2962853014469147,
        -0.047740623354911804,
        -0.046646490693092346,
        0.44494572281837463,
        0.248320534825325,
        0.05490472540259361,
        -0.22250811755657196,
        0.09004418551921844,
        -0.11928655207157135,
        0.12542153894901276,
        -0.1838228702545166,
        -0.30246448516845703,
        -0.003542400663718581,
        -0.24653013050556183,
        0.4761282503604889,
        -0.36488038301467896,
        0.040561288595199585,
        0.5209252238273621,
        -0.2323382943868637,
        -0.5466505885124207,
        0.2583875060081482,
        -0.23633548617362976,
        0.3906783163547516,
        0.015435764566063881,
        -0.5914404988288879,
        -0.4690183997154236,
        0.5168644785881042,
        0.1045624390244484,
        0.0733507052063942,
        -0.37103942036628723,
        -0.5706512928009033,
        -0.2920338213443756,
        -0.39491090178489685,
        -0.3320322334766388,
        0.07603457570075989,
        -0.46845993399620056,
        -0.5361413359642029,
        -0.10437582433223724,
        0.10639555752277374,
        -0.050441887229681015,
        0.25867268443107605,
        0.23097747564315796,
        -0.23011340200901031,
        0.08558367937803268,
        0.31240907311439514,
        0.05805301293730736,
        -0.020782392472028732,
        -0.0820380449295044,
        0.5794006586074829,
        0.3756776452064514,
        -0.2347363829612732,
        0.43823879957199097,
        -0.281707227230072,
        0.25061893463134766,
        -0.00949141476303339,
        0.06378483772277832,
        0.3065764307975769,
        0.16595859825611115,
        -0.11846505105495453,
        -0.10839304327964783,
        0.008294663392007351,
        0.33340421319007874,
        0.1338212490081787,
        -0.435237318277359,
        -0.3144335150718689,
        -0.4920572340488434,
        -0.13881582021713257,
        0.2689163386821747,
        0.014603221789002419,
        -0.7582859992980957,
        0.17862537503242493,
        0.4013657569885254,
        -0.12710344791412354,
        0.1473476141691208,
        -0.19222871959209442,
        0.41674086451530457,
        0.30363109707832336,
        -0.19068701565265656,
        0.4109784960746765,
        0.00431476254016161,
        -0.1079508438706398,
        -0.3115074932575226,
        -0.4759751558303833,
        0.36496639251708984,
        -0.2752731442451477,
        -0.21050001680850983,
        -0.1217157244682312,
        -0.2802775800228119,
        0.11914025992155075,
        -0.09916862100362778,
        -0.6865195631980896,
        -0.15711276233196259,
        -0.11860194057226181,
        0.19898171722888947,
        -0.32427459955215454,
        -0.07685056328773499,
        0.30195340514183044,
        0.11050976812839508,
        0.5161945223808289,
        0.5192482471466064,
        0.7479140162467957,
        -0.6768215298652649,
        0.3093901574611664,
        0.25899991393089294,
        0.6917775869369507,
        -0.689879298210144,
        0.44495534896850586,
        -0.33322402834892273,
        -0.21017417311668396,
        0.5201748013496399,
        0.14977489411830902,
        -0.09779029339551926,
        -0.06678282469511032,
        -0.2745867073535919,
        0.07642728090286255,
        0.40084561705589294,
        -0.1995958536863327,
        -0.3593160808086395,
        0.2575766444206238,
        -0.0428793840110302,
        0.1580180674791336,
        0.49469414353370667,
        0.0806642398238182,
        0.1468745470046997,
        0.13723726570606232,
        -0.5507188439369202,
        -0.392391562461853,
        0.11632426083087921,
        0.6348146200180054,
        0.14775854349136353,
        0.23432236909866333,
        0.1161782369017601,
        0.3041902780532837,
        -0.6198793649673462,
        0.6365054845809937,
        -0.4238858222961426,
        -0.3713149130344391,
        0.4015582501888275,
        0.09440258890390396,
        0.3399670720100403,
        -0.14014925062656403,
        0.5318925976753235,
        -0.31186339259147644,
        -0.08136985450983047,
        -0.08744917064905167,
        0.43550121784210205,
        -0.11085940152406693,
        0.48735830187797546,
        -0.30430564284324646,
        0.033619534224271774,
        0.1298283189535141,
        0.4636719822883606,
        -0.2617010474205017,
        -0.6033368110656738,
        -0.371260404586792,
        -0.16229237616062164,
        -0.15029840171337128,
        0.1403929591178894,
        0.6668540835380554,
        0.13894206285476685,
        -0.07664253562688828,
        0.40150314569473267,
        -0.4207654893398285,
        0.445968896150589,
        0.002011289820075035,
        0.01121323462575674,
        0.6222454309463501,
        -0.14740656316280365,
        -0.22764702141284943,
        0.18326342105865479,
        0.28760385513305664,
        -0.15962453186511993,
        0.13785435259342194,
        -0.16441604495048523,
        0.02125561237335205,
        -0.41508620977401733,
        -0.1282498836517334,
        -0.04921114072203636,
        0.5284648537635803,
        -0.2592484652996063,
        0.2004876732826233,
        0.42906278371810913,
        -0.07079102843999863,
        0.25463762879371643,
        0.4154875576496124,
        0.45735618472099304,
        -0.1312030553817749,
        -0.00145732460077852,
        0.41402140259742737,
        0.12567609548568726,
        0.23793944716453552,
        0.19707907736301422,
        0.3135949969291687,
        0.2544183135032654,
        0.5246495604515076,
        0.006187218241393566,
        0.38021883368492126,
        0.2985430955886841,
        0.07086632400751114,
        0.43105772137641907,
        -0.17461378872394562,
        -0.01864033378660679,
        0.20211073756217957,
        0.15432147681713104,
        -0.16343961656093597,
        0.42592939734458923,
        -0.42947983741760254,
        0.21806453168392181,
        -0.501849353313446,
        0.22060292959213257,
        0.320700079202652,
        -0.17587457597255707,
        -0.1610204130411148,
        0.4250521957874298,
        -0.08959749341011047,
        0.20167109370231628,
        0.00951983593404293,
        -0.08657176047563553,
        0.35907381772994995,
        -0.34510254859924316,
        0.19502557814121246,
        -0.33578649163246155,
        -0.16233763098716736,
        -0.36066168546676636,
        0.045875709503889084,
        0.130532369017601,
        0.11617671698331833,
        0.0753573551774025,
        -0.12386659532785416,
        -0.0718826875090599,
        0.07264655828475952,
        0.40724220871925354,
        0.19881416857242584,
        0.5515374541282654,
        -0.07286166399717331,
        -0.12047132104635239,
        0.35996881127357483,
        -0.19426961243152618,
        0.6039285659790039,
        -0.24478769302368164,
        0.411268949508667,
        0.037388723343610764,
        0.22880801558494568,
        0.20239946246147156,
        -0.0477859228849411,
        -0.037565771490335464,
        0.5477427244186401,
        0.1297183334827423,
        0.008316446095705032,
        -0.3329218924045563,
        0.41142529249191284,
        -0.31050288677215576,
        0.13133801519870758,
        0.07827930897474289,
        0.18184754252433777
      ]
    },
    {
      "name": "dense_Dense1/bias",
      "shape": [
        64
      ],
      "dtype": "float32",
      "data": [
        0.016776863485574722,
        -0.003628670936450362,
        0.026578053832054138,
        -0.008629399351775646,
        -0.023795899003744125,
        -0.008945739828050137,
        -0.036158107221126556,
        -0.027813682332634926,
        0.06059951335191727,
        0.06157468631863594,
        -0.0073350341990590096,
        -0.036731619387865067,
        -0.005911479704082012,
        -0.025041410699486732,
        -0.028203235939145088,
        -0.027986858040094376,
        0.04352661967277527,
        0,
        -0.0025896199513226748,
        -0.009147373959422112,
        -0.012876507826149464,
        0.003910075407475233,
        -0.006890508346259594,
        0.024105586111545563,
        0.024313464760780334,
        0.03901001438498497,
        -0.007528370246291161,
        0.01387722883373499,
        -0.031216630712151527,
        0.02521248534321785,
        -0.02103024534881115,
        0.0033378612715750933,
        -0.018382467329502106,
        -0.028176244348287582,
        -0.024806473404169083,
        -0.003845740342512727,
        -0.03994994983077049,
        -0.0012862879084423184,
        -0.005693311803042889,
        -0.005737310275435448,
        -0.018614253029227257,
        -0.013919121585786343,
        -0.040299657732248306,
        -0.0325106605887413,
        0.029501069337129593,
        -0.005456034559756517,
        -0.009742307476699352,
        -0.020771527662873268,
        -0.040768880397081375,
        -0.0008532247156836092,
        -0.03334622457623482,
        0.001852808054536581,
        0.005485180765390396,
        -0.01867392286658287,
        0.033206574618816376,
        0.002296865452080965,
        0.008924832567572594,
        -0.014767070300877094,
        -0.034287091344594955,
        -0.035670094192028046,
        0.012275151908397675,
        0.0036420575343072414,
        -0.01591247133910656,
        0.06742221117019653
      ]
    },
    {
      "name": "dense_Dense2/kernel",
      "shape": [
        64,
        64
      ],
      "dtype": "float32",
      "data": [
        -0.047053225338459015,
        -0.03969660401344299,
        0.10361891239881516,
        0.19647805392742157,
        -0.0761023685336113,
        -0.014526572078466415,
        -0.19550088047981262,
        -0.060034818947315216,
        -0.24442081153392792,
        0.05822746828198433,
        0.10306811332702637,
        -0.27558979392051697,
        0.03417383134365082,
        0.041096899658441544,
        0.22742938995361328,
        0.21818888187408447,
        0.35129597783088684,
        -0.15374399721622467,
        -0.08981931954622269,
        0.05932993069291115,
        -0.11082011461257935,
        -0.08616972714662552,
        0.2352401465177536,
        0.03613905981183052,
        0.10433536022901535,
        0.3072887361049652,
        0.061696961522102356,
        0.14461396634578705,
        -0.15876366198062897,
        -0.253467321395874,
        0.09667014330625534,
        0.019001726061105728,
        -0.19576495885849,
        0.15056483447551727,
        -0.03286876529455185,
        0.18542806804180145,
        -0.02228272333741188,
        0.03218339383602142,
        -0.17278848588466644,
        0.14513830840587616,
        0.017283888533711433,
        0.021221021190285683,
        0.258036732673645,
        0.03356654569506645,
        0.29216766357421875,
        0.07076424360275269,
        0.3798844516277313,
        -0.21487848460674286,
        0.037218496203422546,
        -0.11933155357837677,
        0.15197452902793884,
        -0.05856635794043541,
        0.0995652824640274,
        0.04059299826622009,
        0.16853010654449463,
        0.04554599151015282,
        -0.009173981845378876,
        -0.09751079976558685,
        -0.2409859448671341,
        0.12851382791996002,
        -0.10365140438079834,
        0.09290637075901031,
        -0.09158105403184891,
        0.09852688759565353,
        -0.26874446868896484,
        0.26192647218704224,
        -0.23705026507377625,
        -0.2938966155052185,
        -0.015295677818357944,
        0.22159063816070557,
        -0.13585186004638672,
        0.2546458840370178,
        -0.06941365450620651,
        -0.1677800416946411,
        -0.15558744966983795,
        -0.19336560368537903,
        -0.329399436712265,
        -0.03829606622457504,
        -0.14416281878948212,
        -0.3245733678340912,
        -0.14360958337783813,
        -0.37160924077033997,
        0.21347184479236603,
        -0.1561419516801834,
        0.3299911916255951,
        0.3685484826564789,
        0.2037850171327591,
        -0.13780134916305542,
        0.10003706067800522,
        -0.08988344669342041,
        0.10944629460573196,
        0.2697451710700989,
        0.01173236221075058,
        0.030972758308053017,
        -0.033441491425037384,
        0.25772643089294434,
        -0.23838815093040466,
        0.19138135015964508,
        0.13921548426151276,
        -0.07791127264499664,
        -0.006435186602175236,
        0.3399360179901123,
        -0.10207272320985794,
        0.020918793976306915,
        0.3036509156227112,
        0.06247617304325104,
        -0.05049299821257591,
        -0.047337956726551056,
        0.13322345912456512,
        -0.11842631548643112,
        -0.3269505500793457,
        -0.11084183305501938,
        0.07407918572425842,
        0.2668706476688385,
        0.09084435552358627,
        -0.005482305772602558,
        -0.0013780316803604364,
        -0.15023007988929749,
        -0.046506259590387344,
        0.1928718090057373,
        0.07416550070047379,
        0.23209863901138306,
        -0.14108116924762726,
        0.00288832513615489,
        -0.1646042913198471,
        -0.06568814814090729,
        0.17575642466545105,
        0.16567833721637726,
        0.03350649029016495,
        0.2199075073003769,
        -0.007533748634159565,
        -0.09528972208499908,
        0.24183031916618347,
        0.023203367367386818,
        -0.19403289258480072,
        -0.1385004222393036,
        0.03291632607579231,
        -0.2211523801088333,
        0.30410781502723694,
        -0.04024277254939079,
        -0.04710723087191582,
        -0.1975908875465393,
        0.07018637657165527,
        -0.18812978267669678,
        -0.20788854360580444,
        0.07788096368312836,
        -0.19943282008171082,
        -0.16681407392024994,
        -0.08351095765829086,
        0.11674685776233673,
        -0.20039087533950806,
        0.054922934621572495,
        -0.15151375532150269,
        -0.09886157512664795,
        -0.06597163528203964,
        -0.10021185129880905,
        -0.16898445785045624,
        -0.02981778420507908,
        -0.08286690711975098,
        -0.15783239901065826,
        -0.08083166182041168,
        -0.08862815052270889,
        0.2762943506240845,
        0.15961188077926636,
        0.03514070436358452,
        0.07523103803396225,
        -0.18054375052452087,
        0.010433833114802837,
        -0.15419691801071167,
        0.19651228189468384,
        0.14861497282981873,
        0.09240902960300446,
        0.06311676651239395,
        -0.03714236989617348,
        0.14708635210990906,
        -0.301505446434021,
        0.02955051325261593,
        -0.1359131783246994,
        -0.03796406462788582,
        0.0942286029458046,
        -0.1295335590839386,
        0.12666404247283936,
        -0.11179982125759125,
        -0.0578768365085125,
        -0.25570473074913025,
        0.1230471283197403,
        0.07484707236289978,
        0.15361061692237854,
        0.07915536314249039,
        -0.004762270022183657,
        -0.21703577041625977,
        -0.33010295033454895,
        -0.2758929133415222,
        0.06627209484577179,
        -0.24102212488651276,
        0.17259538173675537,
        0.0708978995680809,
        0.031872257590293884,
        0.16103018820285797,
        -0.19636893272399902,
        0.24677957594394684,
        -0.1431698054075241,
        0.026664238423109055,
        -0.08861581981182098,
        -0.03921297937631607,
        0.1105826199054718,
        0.18241417407989502,
        0.10057562589645386,
        -0.19476455450057983,
        -0.3688061833381653,
        -0.03391525149345398,
        0.24732930958271027,
        0.09759464859962463,
        0.05643034726381302,
        0.09614638984203339,
        0.16448038816452026,
        0.04473581910133362,
        -0.2833902835845947,
        0.09478354454040527,
        -0.02701696939766407,
        0.16875043511390686,
        -0.14303646981716156,
        -0.2555074691772461,
        -0.08603758364915848,
        -0.12322164326906204,
        -0.06516013294458389,
        -0.18949520587921143,
        0.07444369047880173,
        0.22135929763317108,
        0.20601217448711395,
        -0.030239146202802658,
        0.1089433878660202,
        0.08051491528749466,
        -0.23782049119472504,
        -0.3122186064720154,
        0.020920628681778908,
        -0.008458482101559639,
        0.04766035079956055,
        -0.10782354325056076,
        -0.02760379947721958,
        -0.08023565262556076,
        -0.014913998544216156,
        -0.04623402655124664,
        -0.08116768300533295,
        -0.03670117259025574,
        0.11910703778266907,
        0.09082602709531784,
        -0.05341774597764015,
        -0.10961264371871948,
        -0.09661918878555298,
        -0.25630414485931396,
        0.060968078672885895,
        -0.3104363679885864,
        -0.03139835596084595,
        0.1463213413953781,
        -0.17913924157619476,
        -0.10984843969345093,
        -0.07540887594223022,
        -0.06349162757396698,
        0.022328399121761322,
        0.035764552652835846,
        0.3224502205848694,
        -0.22632662951946259,
        -0.2344234734773636,
        -0.33753255009651184,
        0.22997041046619415,
        0.16308404505252838,
        0.14240340888500214,
        0.04416496306657791,
        0.3486734926700592,
        -0.35378891229629517,
        -0.059617310762405396,
        0.11471438407897949,
        -0.035550929605960846,
        0.03923217952251434,
        -0.025895981118083,
        -0.18290868401527405,
        0.22039192914962769,
        0.1143340915441513,
        -0.23201188445091248,
        -0.2556433081626892,
        0.25062742829322815,
        -0.014376437291502953,
        0.15110883116722107,
        0.2396681159734726,
        0.12034011632204056,
        0.22630248963832855,
        -0.1354362517595291,
        -0.08363588154315948,
        0.23980113863945007,
        -0.07296440005302429,
        -0.18117296695709229,
        0.062269262969493866,
        -0.16701297461986542,
        0.29203155636787415,
        0.1712082475423813,
        -0.343563050031662,
        -0.009539851918816566,
        0.18447503447532654,
        -0.05826717987656593,
        0.18986205756664276,
        0.04004719480872154,
        0.017861558124423027,
        0.13746169209480286,
        0.10490411520004272,
        0.1038367748260498,
        -0.14211399853229523,
        0.036751989275217056,
        0.16435770690441132,
        -0.032007038593292236,
        0.01925819180905819,
        0.2287699282169342,
        0.019323619082570076,
        -0.27276962995529175,
        0.2540053725242615,
        0.03470650315284729,
        0.2035478949546814,
        0.01872643455862999,
        -0.04877076670527458,
        0.11368582397699356,
        0.28094199299812317,
        0.0011998125119134784,
        0.15513384342193604,
        -0.13100974261760712,
        0.039950959384441376,
        -0.21350520849227905,
        0.12294670194387436,
        -0.2402971088886261,
        0.17719848453998566,
        0.09339630603790283,
        -0.020342987030744553,
        0.08094458281993866,
        0.027707062661647797,
        0.024309394881129265,
        -0.20569652318954468,
        -0.07273941487073898,
        0.12251763045787811,
        0.07670873403549194,
        0.06172080710530281,
        -0.12244376540184021,
        0.0278785303235054,
        0.3096703886985779,
        -0.11407965421676636,
        -0.07344967126846313,
        -0.09903319180011749,
        -0.12535226345062256,
        -0.18201202154159546,
        0.01905173249542713,
        -0.15418842434883118,
        -0.04055586829781532,
        0.17253369092941284,
        -0.03996127471327782,
        -0.07842753827571869,
        -0.16632549464702606,
        0.0348208025097847,
        0.19337770342826843,
        -0.07404858618974686,
        0.050703614950180054,
        -0.10817322880029678,
        0.09586458653211594,
        -0.063597671687603,
        -0.022100573405623436,
        -0.3080194890499115,
        0.08428891003131866,
        0.21185831725597382,
        0.02763690985739231,
        -0.12118076533079147,
        -0.1406804770231247,
        -0.058351777493953705,
        0.07852841168642044,
        -0.29102978110313416,
        -0.014705780893564224,
        0.029977502301335335,
        -0.19429510831832886,
        -0.22897692024707794,
        -0.057011280208826065,
        0.09435226768255234,
        0.1634325236082077,
        0.07077635824680328,
        0.30415618419647217,
        0.07898370921611786,
        0.22742094099521637,
        0.04451249539852142,
        -0.1419941782951355,
        0.1292777955532074,
        -0.10121488571166992,
        -0.10447883605957031,
        0.2039642333984375,
        0.15613730251789093,
        -0.10020922124385834,
        -0.06481292843818665,
        0.05572463944554329,
        -0.22527852654457092,
        0.17399707436561584,
        -0.14033205807209015,
        0.061397019773721695,
        -0.1405627727508545,
        -0.1568533480167389,
        -0.16185103356838226,
        0.08471870422363281,
        0.019595550373196602,
        0.3005196750164032,
        -0.21674759685993195,
        -0.045075174421072006,
        0.09320037066936493,
        -0.02995193749666214,
        0.13628792762756348,
        -0.18083299696445465,
        0.11681850999593735,
        0.17406612634658813,
        -0.07509409636259079,
        0.08614840358495712,
        0.16075798869132996,
        -0.22790369391441345,
        -0.10678035020828247,
        0.2585931718349457,
        -0.09209827333688736,
        0.08735956251621246,
        0.031791362911462784,
        -0.1865229308605194,
        -0.16049866378307343,
        -0.09216538071632385,
        -0.11053885519504547,
        -0.020791318267583847,
        -0.020677443593740463,
        0.18224260210990906,
        0.10333894938230515,
        0.11375763267278671,
        -0.06223205849528313,
        0.0047297230921685696,
        0.04911847785115242,
        -0.02982521988451481,
        -0.20690961182117462,
        -0.07776080816984177,
        -0.05556230992078781,
        -0.1310228854417801,
        -0.25374123454093933,
        0.1071636751294136,
        -0.0014151593204587698,
        0.04955232888460159,
        0.264872282743454,
        -0.17355525493621826,
        -0.04808685928583145,
        -0.13985224068164825,
        0.1371627151966095,
        -0.0810261070728302,
        0.07785793393850327,
        -0.0844326913356781,
        -0.08869435638189316,
        0.2952333092689514,
        0.06081916019320488,
        -0.04882602393627167,
        0.0450298897922039,
        -0.17904838919639587,
        0.019296590238809586,
        0.016772285103797913,
        -0.11966406553983688,
        0.21689386665821075,
        0.1214057058095932,
        -0.04726776108145714,
        -0.026146600022912025,
        -0.02069474197924137,
        -0.03947345167398453,
        -0.09828781336545944,
        -0.22394035756587982,
        -0.1758931577205658,
        0.13505540788173676,
        -0.10677902400493622,
        0.0323341079056263,
        0.31401023268699646,
        0.22599951922893524,
        0.25940847396850586,
        -0.20843148231506348,
        -0.04664364829659462,
        -0.0016345309559255838,
        -0.04700286686420441,
        0.18606139719486237,
        -0.19160881638526917,
        -0.1703493893146515,
        0.11726100742816925,
        -0.10262826830148697,
        -0.04891088604927063,
        0.07954507321119308,
        0.1011829674243927,
        0.1893826425075531,
        0.13076134026050568,
        0.11339927464723587,
        0.02854812704026699,
        0.053248435258865356,
        0.3559665381908417,
        -0.240314781665802,
        0.24162940680980682,
        -0.19129055738449097,
        0.10028626769781113,
        0.12479864805936813,
        0.12113974988460541,
        0.03852422535419464,
        -0.14246806502342224,
        0.13764604926109314,
        0.01495261862874031,
        -0.06018596142530441,
        0.1414564847946167,
        0.1338975429534912,
        0.05911553278565407,
        0.03543059527873993,
        0.1982317715883255,
        0.08093476295471191,
        -0.04910992830991745,
        0.17059972882270813,
        -0.040708523243665695,
        0.18255923688411713,
        0.22345268726348877,
        0.20986074209213257,
        -0.2360406368970871,
        0.1554795801639557,
        -0.25241097807884216,
        0.05396820604801178,
        0.03077995404601097,
        0.18388669192790985,
        0.29581984877586365,
        0.021531401202082634,
        0.28672435879707336,
        -0.10905051976442337,
        0.17942072451114655,
        -0.015208007767796516,
        0.12259190529584885,
        0.08325977623462677,
        0.008953404612839222,
        -0.1867961287498474,
        0.027373624965548515,
        -0.36859750747680664,
        -0.1349623203277588,
        -0.023195408284664154,
        0.1798705905675888,
        -0.07315284013748169,
        0.10889812558889389,
        0.16123542189598083,
        -0.1360962986946106,
        -0.15705212950706482,
        -0.20529188215732574,
        0.1008254736661911,
        -0.27096793055534363,
        -0.06898967176675797,
        0.1161428838968277,
