{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        15,
        128
      ],
      "dtype": "float32",
      "data": [
        0.6452659368515015,
        -0.3071635067462921,
        -0.18542203307151794,
        0.14322586357593536,
        -0.26003167033195496,
        0.13153891265392303,
        0.17254261672496796,
        0.46803590655326843,
        0.30232200026512146,
        0.004747800994664431,
        -0.24354515969753265,
        -0.3121219575405121,
        -0.7050120234489441,
        -0.21747219562530518,
        -0.18865440785884857,
        0.5570877194404602,
        -0.15359705686569214,
        0.5488666296005249,
        -0.16391727328300476,
        1.0129249095916748,
        0.4866008460521698,
        0.11695465445518494,
        0.1654750406742096,
        -0.2625526487827301,
        -1.3872419595718384,
        0.25633153319358826,
        -2.414915084838867,
        0.28370317816734314,
        0.01635066792368889,
        0.33695608377456665,
        0.5046660304069519,
        -0.16130498051643372,
        0.3960329294204712,
        0.7314040660858154,
        0.05524652078747749,
        -0.05660553649067879,
        0.02237868495285511,
        0.12316326051950455,
        0.9594283699989319,
        0.15033812820911407,
        0.709709644317627,
        0.36093851923942566,
        0.18821436166763306,
        0.5464085340499878,
        -0.29160019755363464,
        0.05287061259150505,
        -0.44055166840553284,
        -1.8191823959350586,
        0.33714601397514343,
        0.9070162773132324,
        -0.44572293758392334,
        -0.22171372175216675,
        -0.07120151817798615,
        0.8112714290618896,
        -0.7244464755058289,
        -0.13845519721508026,
        -0.3632708787918091,
        -0.02745787240564823,
        0.2060558795928955,
        0.2904706597328186,
        0.7901200652122498,
        0.5465691089630127,
        0.6746914982795715,
        0.335811048746109,
        0.01265349518507719,
        0.08503664284944534,
        -2.687541961669922,
        -0.16798049211502075,
        -0.46006712317466736,
        0.33430927991867065,
        -0.4749830365180969,
        0.5502837896347046,
        -0.14703691005706787,
        -0.5482886433601379,
        -2.5004212856292725,
        -0.658483624458313,
        -0.5266562104225159,
        0.05471310764551163,
        0.17608746886253357,
        0.27148374915122986,
        -0.13620877265930176,
        0.08264585584402084,
        0.04263998195528984,
        0.2648141086101532,
        0.18375472724437714,
        -0.21572601795196533,
        0.05216819792985916,
        0.3499915599822998,
        0.6199069619178772,
        -0.24945802986621857,
        -0.3289230167865753,
        -0.32904645800590515,
        0.10942988097667694,
        -0.07513905316591263,
        0.6386697888374329,
        -0.7092515826225281,
        -1.6605298519134521,
        -0.003414582461118698,
        0.12068086117506027,
        -0.34526729583740234,
        -0.5121492743492126,
        -0.021506620571017265,
        -1.8501135110855103,
        0.13930071890354156,
        0.4046556353569031,
        -0.5258947014808655,
        -0.07317850738763809,
        -0.005709795746952295,
        -0.38603663444519043,
        0.6754643321037292,
        0.3246690034866333,
        -1.3147432804107666,
        0.3778453767299652,
        0.42502519488334656,
        0.4439905285835266,
        -0.06818448752164841,
        0.3315638601779938,
        0.5670610666275024,
        -1.5084693431854248,
        -2.274388074874878,
        0.5192776918411255,
        0.39449745416641235,
        -0.1983475536108017,
        0.8920029401779175,
        1.2984271049499512,
        0.7899746894836426,
        0.18763549625873566,
        -0.19903312623500824,
        -0.2597135901451111,
        -0.05398447439074516,
        0.6423407196998596,
        -0.4789734184741974,
        -0.2864302396774292,
        -0.8256091475486755,
        0.627981424331665,
        0.34474796056747437,
        -0.002095557749271393,
        0.25634318590164185,
        0.057560034096241,
        0.8928711414337158,
        -0.15285737812519073,
        0.4800490438938141,
        -0.012255593203008175,
        0.8059002161026001,
        0.6812936067581177,
        -0.4455142319202423,
        0.5675169229507446,
        0.2415992021560669,
        -0.12016094475984573,
        -0.5247747898101807,
        0.4242550730705261,
        0.5481205582618713,
        -0.15082301199436188,
        0.575716495513916,
        -2.411336898803711,
        0.09072002023458481,
        -0.016687121242284775,
        -0.14017492532730103,
        0.08003128319978714,
        0.24589629471302032,
        0.2962653636932373,
        -0.12130256742238998,
        -0.10283217579126358,
        -0.0865926668047905,
        -0.6697722673416138,
        -0.0919303223490715,
        0.6647451519966125,
        0.31382399797439575,
        -0.1978762000799179,
        -0.0335533581674099,
        -0.08074114471673965,
        -1.1335251331329346,
        -0.5272547006607056,
        0.17404071986675262,
        0.42688435316085815,
        -1.9419833421707153,
        -0.18498416244983673,
        -0.12854254245758057,
        -0.07506101578474045,
        0.6242297887802124,
        -0.23989403247833252,
        0.2044268250465393,
        0.2110673189163208,
        -0.5880506038665771,
        -0.48680564761161804,
        0.7119843363761902,
        0.15445394814014435,
        0.44350823760032654,
        0.5061595439910889,
        0.7692410349845886,
        -1.6356770992279053,
        -0.42723628878593445,
        -0.18916068971157074,
        0.42162391543388367,
        0.6392163038253784,
        0.19263598322868347,
        0.6399544477462769,
        0.1177428811788559,
        0.24687503278255463,
        0.350238174200058,
        -0.3683781027793884,
        -1.0244113206863403,
        -2.209352970123291,
        -0.2112891674041748,
        -0.017295807600021362,
        0.004303826950490475,
        -0.4029698967933655,
        -0.19753345847129822,
        0.16112616658210754,
        -0.2674323618412018,
        -0.3146899938583374,
        0.9230814576148987,
        -0.20580999553203583,
        -0.4532397985458374,
        0.060123004019260406,
        -0.026661673560738564,
        -0.007035353686660528,
        0.4635477662086487,
        -1.772233486175537,
        -1.6348012685775757,
        -0.14543505012989044,
        -0.079426608979702,
        0.8268574476242065,
        -0.016239231452345848,
        -1.460253357887268,
        0.028005069121718407,
        -0.35426026582717896,
        0.6446738839149475,
        0.7337062358856201,
        0.30434995889663696,
        -0.8191475868225098,
        0.0703769251704216,
        -0.13287904858589172,
        0.1173233687877655,
        -0.40676331520080566,
        0.28897005319595337,
        0.6125344038009644,
        -0.03577901050448418,
        -0.748232901096344,
        -1.7594096660614014,
        0.32953986525535583,
        -0.057858191430568695,
        0.5825517773628235,
        0.28803813457489014,
        -0.49572843313217163,
        0.4637443423271179,
        0.4371844530105591,
        -2.1399953365325928,
        0.07215479016304016,
        1.1639833450317383,
        -0.2239103764295578,
        -0.47737690806388855,
        -0.614855945110321,
        -0.18955375254154205,
        0.6570079326629639,
        -0.04143604263663292,
        0.05200083926320076,
        0.13602744042873383,
        0.4519466757774353,
        -0.24360433220863342,
        0.04446067661046982,
        0.08646951615810394,
        0.12925471365451813,
        0.08830913156270981,
        0.046389780938625336,
        -0.3180793821811676,
        -0.3050568401813507,
        -0.06366325914859772,
        0.780925989151001,
        -0.18865932524204254,
        0.7686204314231873,
        0.13086478412151337,
        0.606174647808075,
        0.04039577394723892,
        0.6357699632644653,
        0.4584849178791046,
        -0.18950489163398743,
        -0.025225592777132988,
        0.15693333745002747,
        -0.23359814286231995,
        -2.2068302631378174,
        0.16358032822608948,
        -2.5865187644958496,
        0.41903942823410034,
        -0.09790041297674179,
        0.15982069075107574,
        0.03610430657863617,
        -0.004181616008281708,
        0.45029565691947937,
        0.1508885771036148,
        0.3774551451206207,
        0.08027209341526031,
        0.422172874212265,
        -0.13391759991645813,
        -0.20084959268569946,
        0.20067588984966278,
        0.1950950026512146,
        0.14018182456493378,
        0.47210654616355896,
        0.29406142234802246,
        0.009640106931328773,
        0.12887921929359436,
        0.027121376246213913,
        -1.8625729084014893,
        -0.23717699944972992,
        0.18683116137981415,
        0.13454881310462952,
        -0.6964197754859924,
        -0.06393791735172272,
        -0.3250480592250824,
        0.5346322059631348,
        -0.03283620625734329,
        -0.27524715662002563,
        -0.3891415596008301,
        -0.6146002411842346,
        0.1451246738433838,
        0.30114197731018066,
        0.16335615515708923,
        -0.2906239628791809,
        0.5530420541763306,
        0.5323331356048584,
        0.25200703740119934,
        -0.3457423150539398,
        0.274575799703598,
        -0.18679553270339966,
        0.2394358515739441,
        0.23515987396240234,
        0.049270953983068466,
        -0.2561981976032257,
        -1.446911334991455,
        -2.2246594429016113,
        0.739251971244812,
        -0.07616090774536133,
        0.4345851540565491,
        0.22501161694526672,
        0.0665767639875412,
        -0.025793161243200302,
        0.0017099598189815879,
        0.13016240298748016,
        0.29588600993156433,
        1.2359868288040161,
        -0.0383218489587307,
        -0.0012555981520563364,
        0.3107602894306183,
        0.2879747450351715,
        1.1201930046081543,
        -1.6790962219238281,
        -2.4224743843078613,
        0.14279821515083313,
        -0.17603060603141785,
        0.487898051738739,
        0.1460907757282257,
        -1.9806246757507324,
        0.1395386904478073,
        -0.8261430859565735,
        0.7151911854743958,
        0.3813725411891937,
        0.4555584192276001,
        0.07014855742454529,
        -0.04863362014293671,
        0.2165328860282898,
        0.9060170650482178,
        0.1383683830499649,
        -0.24608206748962402,
        0.18133965134620667,
        0.29402390122413635,
        -0.08849529176950455,
        -0.36136701703071594,
        0.31297212839126587,
        -0.1744304597377777,
        -0.37273138761520386,
        0.6087523102760315,
        0.4548843502998352,
        -0.9326636791229248,
        -0.475624144077301,
        -2.517822742462158,
        0.41263148188591003,
        -0.6196056008338928,
        -0.20515182614326477,
        0.07146745175123215,
        -0.7771832346916199,
        0.2353801727294922,
        0.4393441379070282,
        0.4321945309638977,
        0.4101339876651764,
        0.4382811486721039,
        0.29795560240745544,
        0.023814287036657333,
        0.052338797599077225,
        0.10547062754631042,
        0.30886754393577576,
        0.4043118953704834,
        0.00046825746539980173,
        0.2426898330450058,
        -0.32106685638427734,
        -0.3356573283672333,
        0.42590999603271484,
        -0.44196152687072754,
        -0.5926913022994995,
        0.09496358036994934,
        -0.08328401297330856,
        -0.36579689383506775,
        0.47502490878105164,
        -0.3507445752620697,
        0.09201630204916,
        0.625416100025177,
        0.570025622844696,
        -0.03853021562099457,
        -0.2201898694038391,
        -0.11790090799331665,
        -2.6270153522491455,
        -0.21005350351333618,
        0.585367739200592,
        0.14597530663013458,
        0.11365703493356705,
        -0.20259787142276764,
        -0.0012935156701132655,
        -0.03534897416830063,
        -0.3294534385204315,
        0.4549584686756134,
        0.2576521039009094,
        0.2111486792564392,
        -0.3493447005748749,
        0.4115525186061859,
        0.343517005443573,
        -0.15529680252075195,
        0.05283842608332634,
        0.7367205023765564,
        0.8100119829177856,
        -0.37408363819122314,
        0.16780424118041992,
        -2.346316337585449,
        -0.15943928062915802,
        -0.43827182054519653,
        0.46563655138015747,
        0.08140969276428223,
        -0.4257572591304779,
        -0.36222952604293823,
        0.4064740538597107,
        -0.55484539270401,
        -0.18542969226837158,
        0.12006226927042007,
        -0.14787138998508453,
        -0.026362629607319832,
        0.08478153496980667,
        -0.05628330633044243,
        0.6217252016067505,
        -0.9171872138977051,
        0.041967783123254776,
        0.020364785566926003,
        0.3001185357570648,
        -0.24603749811649323,
        0.26421231031417847,
        0.5312554240226746,
        -0.4177549481391907,
        0.34272894263267517,
        -0.1424756944179535,
        -1.1961345672607422,
        -2.5220699310302734,
        0.24374648928642273,
        0.27448174357414246,
        0.2890641689300537,
        -0.1911340057849884,
        -0.06447730958461761,
        -0.02010115049779415,
        -0.09490408003330231,
        0.4999586045742035,
        -0.17536476254463196,
        0.012474646791815758,
        0.22927460074424744,
        0.2034233957529068,
        0.5418902039527893,
        -0.8353126645088196,
        0.20165754854679108,
        -1.9141854047775269,
        -2.199984550476074,
        -0.06729316711425781,
        0.016270464286208153,
        -0.05564866587519646,
        -0.13134251534938812,
        -1.2506481409072876,
        -0.14600634574890137,
        -1.7177259922027588,
        -0.7947297692298889,
        0.5303885340690613,
        0.16317753493785858,
        -1.5454078912734985,
        0.448356032371521,
        0.05294005200266838,
        0.8718099594116211,
        0.20717047154903412,
        0.1641899198293686,
        0.18755660951137543,
        0.4941537082195282,
        -0.5304610729217529,
        -1.9613227844238281,
        0.026326756924390793,
        -0.26703834533691406,
        0.3278962969779968,
        0.13511084020137787,
        0.9203000068664551,
        0.2976873815059662,
        -0.06417026370763779,
        -3.2854223251342773,
        0.17976884543895721,
        -0.04239673167467117,
        -0.28480929136276245,
        -0.3371034860610962,
        -0.7253119945526123,
        -0.04348072409629822,
        0.23947836458683014,
        0.3678883910179138,
        -0.3213137090206146,
        -0.09387404471635818,
        0.36836668848991394,
        0.4292200207710266,
        0.34163323044776917,
        0.7132782936096191,
        0.3694329261779785,
        -0.05287110432982445,
        0.21096372604370117,
        -0.135124072432518,
        -0.22630363702774048,
        0.27647554874420166,
        0.3152640163898468,
        0.0038912701420485973,
        0.23010261356830597,
        0.5924738645553589,
        -0.028191937133669853,
        0.5406867861747742,
        0.24211843311786652,
        -0.3543376326560974,
        0.5073404312133789,
        0.33219000697135925,
        0.24476781487464905,
        0.5840374827384949,
        -0.20927469432353973,
        0.4504263997077942,
        -3.6813881397247314,
        0.17396998405456543,
        0.5963742136955261,
        0.24908941984176636,
        0.47467881441116333,
        -0.590757429599762,
        0.25978347659111023,
        0.27528318762779236,
        -0.08495459705591202,
        0.3301432132720947,
        0.18899179995059967,
        0.13102644681930542,
        -0.022309405729174614,
        0.19964838027954102,
        -0.2777366042137146,
        0.1692357063293457,
        -0.16868259012699127,
        0.4964914321899414,
        0.2908165156841278,
        0.2203272432088852,
        0.6560348272323608,
        -2.7291312217712402,
        -0.48553532361984253,
        0.4398781359195709,
        0.16171066462993622,
        -0.23109233379364014,
        -0.13967807590961456,
        0.04754010587930679,
        -0.3149130344390869,
        0.08089738339185715,
        -0.16518361866474152,
        0.262822687625885,
        -0.9051530361175537,
        0.02075406163930893,
        0.041589826345443726,
        0.40966448187828064,
        0.2621517777442932,
        0.027736661955714226,
        -0.022153468802571297,
        -0.17174240946769714,
        0.1732458472251892,
        -0.35542911291122437,
        -0.6330563426017761,
        0.16873443126678467,
        -0.5961116552352905,
        0.22234635055065155,
        0.8680250644683838,
        0.5314807891845703,
        -3.4786605834960938,
        -1.2558765411376953,
        0.38731661438941956,
        0.23930713534355164,
        0.5708302855491638,
        0.07611056417226791,
        -1.7152585983276367,
        -0.06880464404821396,
        -0.040761884301900864,
        -0.07223232090473175,
        0.3840794563293457,
        -0.03622303530573845,
        0.5884801149368286,
        -0.04844803735613823,
        0.6237727999687195,
        0.4928436279296875,
        0.3500657379627228,
        -0.7135195732116699,
        -0.15178459882736206,
        0.39403480291366577,
        0.18807320296764374,
        -0.019183238968253136,
        -2.5805795192718506,
        -0.014819763600826263,
        -0.7690656781196594,
        0.6794479489326477,
        -0.15790551900863647,
        0.05218079313635826,
        -2.262367010116577,
        0.34451422095298767,
        0.06923715770244598,
        -0.06485763937234879,
        0.10663863271474838,
        0.12876516580581665,
        -0.173128142952919,
        0.14842697978019714,
        -0.2142099142074585,
        -3.0127053260803223,
        0.10107100754976273,
        -0.0635751485824585,
        -0.27694928646087646,
        0.45892369747161865,
        0.5548712611198425,
        0.13434164226055145,
        1.1007845401763916,
        -0.7254137396812439,
        0.4152451157569885,
        0.6093027591705322,
        1.3227523565292358,
        -0.27767422795295715,
        -0.7647503018379211,
        0.347598135471344,
        0.011823063716292381,
        0.5983205437660217,
        2.1080048084259033,
        -0.6967562437057495,
        1.2708001136779785,
        1.2010518312454224,
        0.9547752141952515,
        -0.27989888191223145,
        -0.34347474575042725,
        -0.0238406490534544,
        0.0276948194950819,
        -0.4431411027908325,
        2.2128589153289795,
        -0.6391180753707886,
        -0.21542751789093018,
        1.2564102411270142,
        1.4131207466125488,
        -1.1884444952011108,
        -2.0700459480285645,
        0.1159639060497284,
        -1.6017519235610962,
        -0.16309000551700592,
        0.5561122894287109,
        1.6503962278366089,
        -1.7999707460403442,
        -1.7081431150436401,
        -0.44910576939582825,
        -0.45871323347091675,
        -0.12159844487905502,
        0.1426265984773636,
        -0.4835738241672516,
        0.3342554569244385,
        -1.1707158088684082,
        -0.20077283680438995,
        0.42771750688552856,
        -1.9334989786148071,
        0.771590530872345,
        0.2102547436952591,
        -1.481730580329895,
        0.5088261961936951,
        0.3019094169139862,
        0.04922351613640785,
        2.3271420001983643,
        1.5949238538742065,
        0.9595025777816772,
        0.8098638653755188,
        -0.061496950685977936,
        1.0564156770706177,
        -1.5420854091644287,
        0.28448498249053955,
        0.14926855266094208,
        -0.5832921862602234,
        -0.3905954957008362,
        1.088667392730713,
        1.3014988899230957,
        -0.005414576735347509,
        -0.021275902166962624,
        2.4075546264648438,
        -0.10433467477560043,
        1.7270361185073853,
        1.4435312747955322,
        0.8074917793273926,
        -0.8115430474281311,
        -1.5970479249954224,
        -0.10773013532161713,
        -1.6417549848556519,
        0.8905283808708191,
        -1.9436836242675781,
        0.05781424790620804,
        -0.6755666136741638,
        0.39538970589637756,
        0.006160439923405647,
        0.04975622519850731,
        -2.2609026432037354,
        0.3160087764263153,
        0.6750046014785767,
        -0.12529535591602325,
        0.39610883593559265,
        0.169574573636055,
        -0.029502710327506065,
        0.8976554870605469,
        -0.6525372266769409,
        0.019018853083252907,
        -0.4220944344997406,
        -1.7504653930664062,
        0.6935039758682251,
        -0.43343332409858704,
        0.12178202718496323,
        -2.3470513820648193,
        -0.8103055953979492,
        0.17901286482810974,
        0.22992199659347534,
        -0.7120145559310913,
        0.12259770929813385,
        -0.26999741792678833,
        1.0753872394561768,
        0.4659956991672516,
        0.22494392096996307,
        0.04652732238173485,
        -1.0415277481079102,
        -0.0736139714717865,
        -0.013355967588722706,
        0.47187280654907227,
        -0.16314178705215454,
        0.15367679297924042,
        -0.18003785610198975,
        -2.607957601547241,
        -0.08883983641862869,
        1.573048710823059,
        0.1629759818315506,
        0.024209914728999138,
        -2.1246304512023926,
        -0.37725648283958435,
        0.33439522981643677,
        -2.439573287963867,
        0.5823339819908142,
        1.9188973903656006,
        -1.5195021629333496,
        0.2804623246192932,
        -1.2931017875671387,
        0.314011812210083,
        -0.17820137739181519,
        -1.2110862731933594,
        -0.6328421831130981,
        -0.1666686236858368,
        -0.3888614773750305,
        -0.08283813297748566,
        -1.4666136503219604,
        -2.378307342529297,
        -0.01704484224319458,
        -0.41450509428977966,
        -0.6222873330116272,
        -0.04935672506690025,
        0.4457423985004425,
        0.13759852945804596,
        0.06928007304668427,
        0.2440268099308014,
        -0.27006465196609497,
        0.4503536820411682,
        0.1689676195383072,
        0.40376824140548706,
        0.16077418625354767,
        -0.05103958025574684,
        -0.008353542536497116,
        -0.32903289794921875,
        0.027721762657165527,
        0.14670823514461517,
        -1.0368852615356445,
        0.5665950179100037,
        -0.03331613168120384,
        -0.19061161577701569,
        -0.34265249967575073,
        0.1849130392074585,
        -0.13177794218063354,
        -0.10632520169019699,
        0.4832819700241089,
        0.3765616714954376,
        -0.9272716641426086,
        0.4209374189376831,
        0.023709801957011223,
        -0.0245481189340353,
        -0.5678514242172241,
        -1.3884109258651733,
        -0.10239788144826889,
        0.002803331008180976,
        0.018648674711585045,
        0.7202684879302979,
        -0.2502904534339905,
        0.19826078414916992,
        -1.0129457712173462,
        -0.07795093208551407,
        0.07925167679786682,
        0.436103880405426,
        -0.1963404268026352,
        -0.4659876823425293,
        0.21154950559139252,
        -0.000858451530802995,
        0.42894119024276733,
        0.41376402974128723,
        -0.17502780258655548,
        0.45746102929115295,
        -0.3109826445579529,
        -0.34020906686782837,
        0.49372708797454834,
        -0.22924965620040894,
        -0.4500565230846405,
        0.25539159774780273,
        -0.1327946037054062,
        0.43613529205322266,
        -0.05314374715089798,
        0.3187846541404724,
        0.47489219903945923,
        -0.4676271677017212,
        0.4041745960712433,
        0.12248184531927109,
        -0.11603821069002151,
        0.3213566243648529,
        -0.048338863998651505,
        0.201221764087677,
        0.23442311584949493,
        0.17967574298381805,
        -0.0464247390627861,
        -0.5669724345207214,
        0.480980783700943,
        0.4087511897087097,
        0.3150615394115448,
        -0.061618395149707794,
        0.5838593244552612,
        0.6034029722213745,
        0.09878571331501007,
        0.2881227433681488,
        -0.5029245018959045,
        0.17226411402225494,
        -0.3938473165035248,
        -0.6731931567192078,
        0.03938879072666168,
        -0.02620450221002102,
        0.2000395953655243,
        -0.8812375068664551,
        -0.03997625410556793,
        -0.6423060297966003,
        0.10343512892723083,
        0.34492209553718567,
        -0.17551454901695251,
        -0.04512743279337883,
        0.13878175616264343,
        0.08344234526157379,
        0.012355170212686062,
        0.4589734971523285,
        -0.08170998096466064,
        -0.6332330107688904,
        -0.07873153686523438,
        0.25304698944091797,
        0.08872859179973602,
        0.5210984349250793,
        -0.1072893962264061,
        -0.6216306090354919,
        0.43678343296051025,
        -0.4633907973766327,
        0.08331745117902756,
        0.6340247988700867,
        0.41753700375556946,
        0.14449293911457062,
        0.5628470778465271,
        -0.36460861563682556,
        0.09828227758407593,
        -0.0769248679280281,
        0.389589786529541,
        -0.19108271598815918,
        0.47672024369239807,
        -0.2713695168495178,
        -0.2296152263879776,
        -0.25494909286499023,
        0.09993069618940353,
        0.467944860458374,
        0.15505003929138184,
        0.11605393141508102,
        0.07814385741949081,
        0.3840353786945343,
        -1.036994218826294,
        -0.42185017466545105,
        -0.18450497090816498,
        -0.005293199792504311,
        0.6257985830307007,
        0.0740322694182396,
        -0.2948269844055176,
        0.10227633267641068,
        -0.015586109831929207,
        0.11404069513082504,
        -0.06944458931684494,
        0.2736073136329651,
        0.07049769163131714,
        -0.6238213181495667,
        0.018500948324799538,
        0.5209539532661438,
        -1.496423363685608,
        -0.033196479082107544,
        0.053884558379650116,
        -0.14420296251773834,
        -0.18431363999843597,
        0.028112346306443214,
        -0.04334554076194763,
        0.45933371782302856,
        0.549568235874176,
        0.38897937536239624,
        0.20370040833950043,
        0.1087440550327301,
        -0.27039065957069397,
        0.17096225917339325,
        -0.4367417097091675,
        -0.7469738125801086,
        0.08935046195983887,
        -0.14752624928951263,
        -0.37291571497917175,
        0.4291073679924011,
        0.10058684647083282,
        0.34332039952278137,
        -0.9610316753387451,
        0.3418985605239868,
        -0.32001829147338867,
        0.45061540603637695,
        0.049378588795661926,
        -0.34516641497612,
        0.1545637845993042,
        0.2545716464519501,
        0.35884660482406616,
        0.5651989579200745,
        0.3587830364704132,
        0.3165052831172943,
        -0.5091346502304077,
        0.3199841380119324,
        -0.010999863035976887,
        0.6755388379096985,
        -0.30707088112831116,
        -0.030121123418211937,
        -0.22021356225013733,
        0.12530377507209778,
        0.16491688787937164,
        0.2880832552909851,
        0.15928152203559875,
        0.2654193043708801,
        -0.15536892414093018,
        -0.07265109568834305,
        0.2329893261194229,
        0.2714427709579468,
        -0.29180803894996643,
        -0.22662107646465302,
        0.386100709438324,
        -0.37982022762298584,
        0.20815537869930267,
        0.22034278512001038,
        -0.12700428068637848,
        0.4084875285625458,
        -0.05828388035297394,
        0.15159741044044495,
        0.16101576387882233,
        -0.3807116448879242,
        0.1411978006362915,
        0.08982537686824799,
        0.307181179523468,
        -0.013742536306381226,
        -0.41154244542121887,
        -0.4285297393798828,
        0.09533501416444778,
        0.16201777756214142,
        0.5157490968704224,
        -0.46900928020477295,
        0.3661535978317261,
        -0.03501657769083977,
        0.30011633038520813,
        0.3176579177379608,
        0.06163758784532547,
        0.3262292742729187,
        0.20981664955615997,
        0.3720192611217499,
        0.08418536186218262,
        0.4541374146938324,
        -0.4936964511871338,
        -0.30388644337654114,
        0.0859106257557869,
        0.10476711392402649,
        0.49420616030693054,
        0.26395779848098755,
        0.08452890068292618,
        -0.19185766577720642,
        0.18064434826374054,
        0.11737286299467087,
        0.031272511929273605,
        -0.06107807531952858,
        0.381335586309433,
        0.41672345995903015,
        -0.048309117555618286,
        -0.011585084721446037,
        -0.20726458728313446,
        0.007643604185432196,
        0.04788438603281975,
        -0.1471235603094101,
        0.4727780222892761,
        0.29990941286087036,
        -0.0975680872797966,
        -0.4133647084236145,
        0.12865278124809265,
        0.24208217859268188,
        0.2345687448978424,
        0.2847064733505249,
        -0.15544402599334717,
        -0.18309339880943298,
        -1.0730397701263428,
        -0.423224538564682,
        -0.21537089347839355,
        -0.0072318799793720245,
        0.16403643786907196,
        0.436697393655777,
        0.11112377047538757,
        -0.02443811483681202,
        -0.23877468705177307,
        0.41345253586769104,
        0.21008184552192688,
        0.14685600996017456,
        0.2278614491224289,
        0.17270809412002563,
        0.03344877436757088,
        -0.25315535068511963,
        -0.8981219530105591,
        0.048298899084329605,
        0.08569090068340302,
        0.2443309724330902,
        -0.3480592668056488,
        -0.25186195969581604,
        0.5052967667579651,
        0.1235259622335434,
        0.10854398459196091,
        0.2689827084541321,
        0.22189636528491974,
        0.2794273793697357,
        0.05758965015411377,
        0.07419552654027939,
        0.017631787806749344,
        -0.9017469882965088,
        -0.1579420119524002,
        0.14669150114059448,
        -0.06966591626405716,
        0.36160603165626526,
        0.5165296196937561,
        0.31976962089538574,
        -1.2212021350860596,
        -0.054298270493745804,
        -0.367147296667099,
        0.3479641377925873,
        0.16913150250911713,
        0.7462479472160339,
        0.1630096286535263,
        0.4397582411766052,
        0.4782101511955261,
        0.29027947783470154,
        -0.25743407011032104,
        0.19234362244606018,
        0.08430776745080948,
        -0.11827941238880157,
        0.08634480834007263,
        0.18657220900058746,
        -0.13291522860527039,
        0.532907247543335,
        -0.30823656916618347,
        -0.2530389428138733,
        0.2702897787094116,
        0.1955958753824234,
        0.22241513431072235,
        -0.14821261167526245,
        0.17256978154182434,
        -0.04832903668284416,
        0.2850254774093628,
        0.08864086121320724,
        -0.03913702815771103,
        -0.5530077219009399,
        0.19820834696292877,
        -0.17188335955142975,
        0.11624757945537567,
        -0.20089590549468994,
        0.05720660090446472,
        0.38025128841400146,
        -0.0599808469414711,
        0.23925042152404785,
        0.2942732572555542,
        -0.7292428612709045,
        0.3446696996688843,
        0.2535165250301361,
        0.255586713552475,
        -0.14101900160312653,
        -0.8460059762001038,
        0.011413868516683578,
        -0.07121510803699493,
        0.3230012059211731,
        0.6711073517799377,
        0.2980014383792877,
        0.13523182272911072,
        0.3778334856033325,
        0.2789228558540344,
        -0.544720470905304,
        -0.07764069736003876,
        0.19205999374389648,
        -0.16923999786376953,
        0.6016882061958313,
        -0.1271539330482483,
        0.5097247362136841,
        0.4717938303947449,
        -0.100545734167099,
        -0.29594600200653076,
        0.2288668304681778,
        0.12410514801740646,
        0.19382670521736145,
        0.23301668465137482,
        -0.3260294497013092,
        -0.36326032876968384,
        0.2522328495979309,
        0.1455926150083542,
        0.5284128785133362,
        0.3391154408454895,
        0.0545329712331295,
        0.07405442744493484,
        -0.20171232521533966,
        -0.13578982651233673,
        0.21760596334934235,
        0.43572714924812317,
        0.021071908995509148,
        0.4494895935058594,
        0.5328096151351929,
        0.02457498200237751,
        -0.238821342587471,
        0.5546082258224487,
        -0.3534529209136963,
        0.03064214624464512,
        0.5118679404258728,
        0.3835238218307495,
        -0.08840316534042358,
        -0.14982205629348755,
        -0.10157949477434158,
        -0.19465430080890656,
        0.027758101001381874,
        0.3097168803215027,
        0.27106910943984985,
        -0.5388014912605286,
        0.2940026819705963,
        0.00591127248480916,
        0.3734263479709625,
        -0.24203017354011536,
        -0.10055240243673325,
        0.02570311911404133,
        -0.3880539536476135,
        -0.19106636941432953,
        0.40265434980392456,
        0.24871677160263062,
        -0.037683773785829544,
        0.16638332605361938,
        0.1371496617794037,
        -0.1378890872001648,
        0.1615036427974701,
        -0.06716559827327728,
        -0.16444796323776245,
        0.36495745182037354,
        0.3978305757045746,
        0.06216481328010559,
        0.5643355250358582,
        -0.09653724730014801,
        -0.043843407183885574,
        0.38692641258239746,
        -1.9515513181686401,
        0.045327018946409225,
        -0.4657597243785858,
        -0.025461416691541672,
        0.6262844800949097,
        -0.14927218854427338,
        0.054531171917915344,
        -1.5111771821975708,
        0.26155346632003784,
        -0.13968518376350403,
        0.14350491762161255,
        -0.4185712933540344,
        -0.3593354821205139,
        -0.05783490836620331,
        0.5805865526199341,
        0.4208662509918213,
        -0.04243674501776695,
        -0.5866156220436096,
        0.02014121413230896,
        0.41360709071159363,
        0.43238601088523865,
        -0.035390496253967285,
        -0.09579946845769882,
        -0.5034488439559937,
        0.5617773532867432,
        -0.061588503420352936,
        -0.09172812849283218,
        -0.1462278962135315,
        0.43721088767051697,
        0.19997051358222961,
        0.10676144063472748,
        0.10034328699111938,
        -0.2960122227668762,
        0.2987169325351715,
        0.06354900449514389,
        0.20337703824043274,
        -0.2625817060470581,
        0.2246132493019104,
        0.45834052562713623,
        0.05767108500003815,
        -0.13303181529045105,
        0.21758389472961426,
        0.36254507303237915,
        -0.04179329052567482,
        -0.014306244440376759,
        -0.2967073917388916,
        -0.475029319524765,
        0.14238080382347107,
        0.28968870639801025,
        0.38950115442276,
        -0.16363310813903809,
        0.07153930515050888,
        0.04621025174856186,
        0.08503905683755875,
        0.22786422073841095,
        -0.09811936318874359,
        0.12938007712364197,
        0.24131760001182556,
        0.39497292041778564,
        0.2733059525489807,
        -0.04620884358882904,
        0.04593762755393982,
        0.263604998588562,
        0.12034706771373749,
        0.3286532163619995,
        0.01950904354453087,
        0.6380367875099182,
        0.23743140697479248,
        -0.6152258515357971,
        0.07850449532270432,
        0.2087920904159546,
        0.3121415972709656,
        0.3283925950527191,
        -0.02340329810976982,
        -0.16681508719921112,
        0.08010807633399963,
        -0.1420489400625229,
        0.15172097086906433,
        0.06137241795659065,
        0.31372231245040894,
        0.025188526138663292,
        -0.03950244560837746,
        0.05551769584417343,
        0.07926112413406372,
        0.3518504798412323,
        0.06325175613164902,
        -0.3414253294467926,
        0.4897019565105438,
        0.06818434596061707,
        0.27157509326934814,
        -0.21825790405273438,
        -0.10831951349973679,
        -0.3503931760787964,
        0.34485334157943726,
        0.3084190785884857,
        0.39125749468803406,
        0.1984141618013382,
        0.04084956273436546,
        -0.6143498420715332,
        -0.18973101675510406,
        0.22857540845870972,
        0.1577322781085968,
        0.3679182827472687,
        -0.29857751727104187,
        0.3310747444629669,
        0.22453567385673523,
        0.21043817698955536,
        0.37678658962249756,
        0.4259171783924103,
        0.14561991393566132,
        -0.46400877833366394,
        0.22400343418121338,
        0.303975909948349,
        0.2671053111553192,
        0.38008543848991394,
        -0.6910279393196106,
        -0.17004837095737457,
        -0.20168554782867432,
        -0.20336833596229553,
        0.05935800075531006,
        0.6555728316307068,
        0.07580877095460892,
        0.37175989151000977,
        0.2190910428762436,
        0.7419863939285278,
        0.21328386664390564,
        -0.20532338321208954,
        -0.08215656876564026,
        -2.170224189758301,
        -0.028402846306562424,
        0.20302563905715942,
        -0.11047891527414322,
        0.5115635991096497,
        0.20560799539089203,
        0.13212278485298157,
        -1.580045461654663,
        -0.0008960864506661892,
        0.3310058116912842,
        0.14568808674812317,
        -0.6104223132133484,
        -0.3821016848087311,
        -0.34911197423934937,
        0.17161685228347778,
        0.32529154419898987,
        0.08675076812505722,
        0.04269420728087425,
        0.20641635358333588,
        -0.09830930083990097,
        -0.3273417055606842,
        0.07062232494354248,
        -0.9383746385574341,
        -0.3550732135772705,
        -0.45892783999443054,
        -0.4547959566116333,
        -0.19312766194343567,
        0.06703539937734604,
        0.366023451089859,
        0.02388882264494896,
        0.44660133123397827,
        -0.6049309968948364,
        0.44896528124809265,
        0.36034464836120605,
        0.5015561580657959,
        0.13276244699954987,
        -0.2860584557056427,
        0.08583854883909225,
        0.07656251639127731,
        0.1191713809967041,
        -0.14994855225086212,
        0.09376697987318039,
        0.391580194234848,
        -0.2804924547672272,
        -0.6151275038719177,
        0.1498408317565918,
        0.12962839007377625,
        -0.006687430199235678,
        0.46401116251945496,
        0.054501429200172424,
        -0.04420711100101471,
        -0.16518302261829376,
        0.4263150990009308,
        -0.3147370517253876,
        0.12268636375665665,
        0.06424645334482193,
        0.17712749540805817,
        0.20867885649204254,
        0.22241747379302979,
        0.3197440803050995,
        -0.5712709426879883,
        0.012681557796895504,
        -0.10736332833766937,
        0.00007349082443397492,
        0.3659423589706421,
        0.0005767683614976704,
        0.7124060988426208,
        0.15096887946128845,
        0.04595363512635231,
        -0.16348372399806976,
        -0.05489256978034973,
        0.21105262637138367,
        0.37543097138404846,
        -0.8342947363853455,
        0.30768871307373047,
        0.24185216426849365,
        0.12492375075817108,
        0.19472292065620422,
        0.7820203304290771,
        0.44101032614707947,
        -0.12994396686553955,
        0.08759544044733047,
        -0.34062284231185913,
        -0.05791929364204407,
        0.13131725788116455,
        0.04351789876818657,
        0.08558891713619232,
        0.47880780696868896,
        0.3500897288322449,
        0.12699578702449799,
        -0.26825016736984253,
        0.20277315378189087,
        -0.14836318790912628,
        0.16953864693641663,
        0.2299475222826004,
        0.11153235286474228,
        -0.833487331867218,
        0.52571702003479,
        -0.0013026334345340729,
        -1.1377583742141724,
        1.8262053728103638,
        -1.510959267616272,
        -2.998835325241089,
        2.075270175933838,
        -3.3333380222320557,
        -2.7530369758605957,
        0.0029699974693357944,
        0.4157044589519501,
        -1.1093087196350098,
        -1.8216779232025146,
        0.17914259433746338,
        0.12318210303783417,
        0.037227075546979904,
        -1.028733491897583,
        -0.6616834998130798,
        0.29601889848709106,
        -1.2109241485595703,
        0.19895799458026886,
        1.6078646183013916,
        -0.06469188630580902,
        -0.3312440812587738,
        -3.2805421352386475,
        0.15203595161437988,
        2.593352794647217,
        -1.746290683746338,
        -2.7656660079956055,
        1.2957000732421875,
        -0.4721969664096832,
        -0.5564101338386536,
        -0.3917669355869293,
        2.034625768661499,
        -2.7985658645629883,
        0.7562025785446167,
        -1.7659567594528198,
        0.6527016162872314,
        -0.5176072120666504,
        -0.07407765835523605,
        -0.21429386734962463,
        1.234265923500061,
        0.6011494398117065,
        -0.41500282287597656,
        -2.4637768268585205,
        -1.1226258277893066,
        0.2886602282524109,
        3.016906261444092,
        -0.1294255554676056,
        -1.2801486253738403,
        0.7911083102226257,
        -0.6654444932937622,
        -0.6567353010177612,
        -0.04317339137196541,
        0.11215831339359283,
        0.846794605255127,
        -0.27485519647598267,
        -0.4036862552165985,
        -2.617403030395508,
        -1.7361334562301636,
        -0.5449345707893372,
        0.5908007621765137,
        0.9551759362220764,
        -2.4114139080047607,
        1.1299175024032593,
        0.2228391468524933,
        2.14047908782959,
        1.424438714981079,
        -3.1889381408691406,
        0.4887183904647827,
        0.9544823169708252,
        1.303023338317871,
        0.06177278980612755,
        0.07486443966627121,
        0.8911873698234558,
        2.5678505897521973,
        -2.293422222137451,
        1.3323591947555542,
        -2.779252767562866,
        -1.3568428754806519,
        -0.14426782727241516,
        0.9057982563972473,
        0.43835994601249695,
        -0.503856897354126,
        -0.014993786811828613,
        0.9385420680046082,
        -0.8822262287139893,
        1.3387058973312378,
        -0.8593465089797974,
        0.35467156767845154,
        0.349921852350235,
        0.14694304764270782,
        2.2143161296844482,
        -2.969810962677002,
        -2.323050022125244,
        0.8710819482803345,
        2.863992929458618,
        -0.7727039456367493,
        0.9365585446357727,
        0.6566776037216187,
        -2.0410373210906982,
        -0.14717327058315277,
        -2.5587873458862305,
        0.3987470865249634,
        0.483086496591568,
        1.121328353881836,
        2.5706145763397217,
        -1.5521184206008911,
        -0.07927221804857254,
        0.6212576031684875,
        -1.2924655675888062,
        0.13752712309360504,
        1.3200148344039917,
        0.9597532749176025,
        -1.0812486410140991,
        1.283748984336853,
        0.01128351129591465,
        -0.19388212263584137,
        0.08427712321281433,
        -1.874605655670166,
        -0.21682868897914886,
        0.7417147159576416,
        -0.2878364622592926,
        0.23100990056991577,
        -0.3120095729827881,
        -0.29710134863853455,
        -2.152768850326538,
        0.4723019003868103,
        0.622700035572052,
        0.42151933908462524,
        0.11489777266979218,
        -0.04464482143521309,
        0.2030455768108368,
        -0.15129055082798004,
        0.3363978862762451,
        0.37951043248176575,
        0.352631151676178,
        -0.25371041893959045,
        -0.3916482627391815,
        0.08909148722887039,
        -0.18807965517044067,
        -0.05678679794073105,
        -0.5136392116546631,
        0.19952107965946198,
        0.23387649655342102,
        0.8431164622306824,
        -0.24006307125091553,
        0.5218173265457153,
        -0.1587388664484024,
        0.5592975616455078,
        0.5207120180130005,
        0.3700392544269562,
        0.34663885831832886,
        0.17903536558151245,
        0.0556100532412529,
        0.308824747800827,
        0.6562991142272949,
        -0.054076917469501495,
        0.38805022835731506,
        0.5181666612625122,
        0.3400190472602844,
        -0.12058866769075394,
        -0.03383275493979454,
        0.36876189708709717,
        0.789648711681366,
        -0.8439537882804871,
        0.35641852021217346,
        -0.37018463015556335,
        -0.06142834573984146,
        -0.555206835269928,
        -0.43897345662117004,
        -0.0004685081948991865,
        0.0703585147857666,
        -0.22942081093788147,
        0.4460129737854004,
        -0.2751012146472931,
        0.4370311200618744,
        0.2907848358154297,
        -0.4982791841030121,
        -0.1973024159669876,
        -0.09345738589763641,
        0.0027481571305543184,
        -0.07114193588495255,
        0.16132742166519165,
        0.16853444278240204,
        0.509729266166687,
        0.26953965425491333,
