{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        15,
        128
      ],
      "dtype": "float32",
      "data": [
        -1.0745338201522827,
        0.29676058888435364,
        -0.29880303144454956,
        -0.006232208572328091,
        0.24308869242668152,
        -1.9963531494140625,
        -0.3986479938030243,
        0.22219261527061462,
        0.1711554080247879,
        -0.24841193854808807,
        -1.0562055110931396,
        0.3179004192352295,
        -0.2797917425632477,
        -0.5109742879867554,
        -0.284086138010025,
        -0.6732564568519592,
        -0.036765601485967636,
        -0.3752187192440033,
        0.5424727201461792,
        -0.4519081711769104,
        -0.2958819270133972,
        0.21226105093955994,
        0.20501494407653809,
        0.1883341521024704,
        0.31901052594184875,
        0.7439514994621277,
        0.8661565184593201,
        -0.08890023827552795,
        -0.16723927855491638,
        0.6273150444030762,
        0.114011749625206,
        0.7670592069625854,
        0.2993353009223938,
        0.11121615767478943,
        -1.1602554321289062,
        0.25286582112312317,
        -0.27530771493911743,
        -1.8911536931991577,
        -0.3734477162361145,
        -0.35951918363571167,
        0.35915154218673706,
        -0.9621624946594238,
        -0.3472248613834381,
        0.2741914689540863,
        -1.0766631364822388,
        -1.4469707012176514,
        -0.3877580761909485,
        -0.01248207874596119,
        -1.6069313287734985,
        -0.17447739839553833,
        0.435698002576828,
        -0.06134384870529175,
        0.31166478991508484,
        0.01231303159147501,
        0.4414766728878021,
        0.43668076395988464,
        0.044337403029203415,
        -0.2307802438735962,
        -0.1709163635969162,
        0.2395402193069458,
        0.01969585008919239,
        -0.04416501894593239,
        0.3790755569934845,
        -0.047205615788698196,
        0.16676892340183258,
        0.07084473222494125,
        -0.795268714427948,
        -0.0057285744696855545,
        0.5649727582931519,
        0.4811488389968872,
        0.34793388843536377,
        0.5712915062904358,
        -0.18544141948223114,
        0.004581685643643141,
        0.0038313206750899553,
        0.31353792548179626,
        1.083011269569397,
        0.16458943486213684,
        -0.21385599672794342,
        0.16152848303318024,
        0.24261078238487244,
        0.06729751825332642,
        -0.14644555747509003,
        -0.02795291133224964,
        0.6172727346420288,
        -0.2502326965332031,
        0.3348170518875122,
        0.42481696605682373,
        -0.6793642640113831,
        0.7538179755210876,
        -0.9209181070327759,
        0.006935346871614456,
        0.2877531349658966,
        -0.49445489048957825,
        -0.02476329170167446,
        -0.8245921730995178,
        -0.1269751489162445,
        0.32368606328964233,
        -0.41445133090019226,
        0.762664258480072,
        0.21772944927215576,
        0.26390165090560913,
        0.2949887812137604,
        -0.1430302858352661,
        -0.05102375149726868,
        0.4243738651275635,
        -0.03960844501852989,
        0.3522106111049652,
        -0.062204983085393906,
        -0.2558404803276062,
        -0.6639499068260193,
        0.22963093221187592,
        -0.013660346157848835,
        0.34559133648872375,
        -0.15656588971614838,
        0.410794198513031,
        -0.04909718781709671,
        -0.27308520674705505,
        0.44226863980293274,
        0.11937225610017776,
        1.2764513492584229,
        -1.0686589479446411,
        0.15029750764369965,
        -0.3775691092014313,
        -1.2911350727081299,
        0.2242385894060135,
        0.42760729789733887,
        -0.1755572259426117,
        -0.20089079439640045,
        -0.5013967156410217,
        -0.4412798285484314,
        -0.2722379267215729,
        0.5039142966270447,
        -1.5539753437042236,
        -0.18154409527778625,
        -1.032738208770752,
        0.3058302402496338,
        0.013311888091266155,
        -0.14087527990341187,
        -0.272108256816864,
        -0.007334593217819929,
        -0.14400042593479156,
        -0.059767790138721466,
        -0.5498162508010864,
        0.35100242495536804,
        -0.21587958931922913,
        0.25829043984413147,
        -0.14564046263694763,
        -0.23758552968502045,
        -0.6001233458518982,
        0.3430456221103668,
        -0.22893904149532318,
        -0.3627243936061859,
        -0.4580899477005005,
        0.3463324308395386,
        0.31984442472457886,
        -0.39233559370040894,
        -0.19677504897117615,
        0.08964001387357712,
        0.1756783425807953,
        -1.7217625379562378,
        -0.20036716759204865,
        -0.2532724142074585,
        0.21698500216007233,
        0.19962728023529053,
        -1.2311604022979736,
        0.057218629866838455,
        -0.22335731983184814,
        -0.5235625505447388,
        0.5169087648391724,
        -0.1696571409702301,
        -0.04143844544887543,
        0.7335885167121887,
        -1.7505110502243042,
        0.06187175214290619,
        0.957189679145813,
        -1.1485941410064697,
        0.08906470239162445,
        0.178444966673851,
        -0.20480608940124512,
        0.3163244128227234,
        -0.34708482027053833,
        0.08203157037496567,
        0.19669261574745178,
        -0.2366289347410202,
        0.12475038319826126,
        0.19290269911289215,
        0.07526107132434845,
        0.6291554570198059,
        0.09969466179609299,
        -0.2985107898712158,
        -0.9284425973892212,
        -0.11932449787855148,
        0.718146800994873,
        0.6809357404708862,
        -0.04308655485510826,
        0.8327253460884094,
        0.3521845042705536,
        -0.10141175240278244,
        0.24589942395687103,
        -0.029106738045811653,
        0.17131589353084564,
        0.4057798385620117,
        0.6015400886535645,
        -0.6481086611747742,
        -0.009618319571018219,
        0.12179122120141983,
        -0.5265379548072815,
        0.1907891482114792,
        0.41610783338546753,
        0.052384115755558014,
        -0.03873010352253914,
        -0.1750785857439041,
        -0.17418986558914185,
        -0.5738289952278137,
        1.0048929452896118,
        -0.4412425756454468,
        -0.13504640758037567,
        0.4210582375526428,
        -1.1823887825012207,
        0.036983098834753036,
        0.0332796610891819,
        0.16953231394290924,
        -0.2124606966972351,
        -0.7571498155593872,
        -0.2347017526626587,
        -0.4687585234642029,
        -0.15757869184017181,
        0.2862872779369354,
        0.21234457194805145,
        0.1397264152765274,
        -0.1648419052362442,
        0.6096658706665039,
        0.42263826727867126,
        0.3471473455429077,
        0.384364515542984,
        -0.21937242150306702,
        0.11610008031129837,
        -0.125269815325737,
        0.5760653614997864,
        -0.010119722224771976,
        0.37601637840270996,
        0.10764485597610474,
        0.17093481123447418,
        -0.22899875044822693,
        -0.4733271598815918,
        -0.6152125000953674,
        -0.5711569786071777,
        -0.304050087928772,
        -0.7048338055610657,
        0.039996448904275894,
        -0.19557127356529236,
        -1.84467613697052,
        0.37033042311668396,
        0.22502179443836212,
        0.5070496201515198,
        0.21209320425987244,
        -0.47177088260650635,
        0.7469746470451355,
        -0.18550093472003937,
        0.5652433037757874,
        0.0723084807395935,
        0.08220621198415756,
        -0.8110463619232178,
        -0.3050702214241028,
        0.012362448498606682,
        -0.19922713935375214,
        -0.6846889853477478,
        0.0001369132223771885,
        -0.4558812379837036,
        -0.3129135072231293,
        0.18180643022060394,
        -0.004666848573833704,
        -0.33035343885421753,
        0.0334041453897953,
        -0.03455501049757004,
        -0.964530348777771,
        0.13007433712482452,
        -0.07122205197811127,
        -0.21552813053131104,
        0.08825608342885971,
        -0.23135150969028473,
        0.7049034237861633,
        0.2940971851348877,
        0.34697458148002625,
        -0.09030543267726898,
        0.08178871870040894,
        0.27663227915763855,
        0.12351086735725403,
        0.015199754387140274,
        -0.8626739978790283,
        0.24547693133354187,
        -0.31521371006965637,
        -1.8205151557922363,
        0.3312799334526062,
        0.3647714853286743,
        0.024148400872945786,
        0.26388901472091675,
        -1.6181013584136963,
        0.5050044655799866,
        -0.172684445977211,
        -2.1488871574401855,
        0.12943607568740845,
        0.42860081791877747,
        -0.44910353422164917,
        0.0811939612030983,
        -0.5052976012229919,
        -0.21358713507652283,
        -0.1308005005121231,
        0.48977765440940857,
        0.29973486065864563,
        -0.0900384709239006,
        0.48952820897102356,
        0.2056359052658081,
        0.18603210151195526,
        0.009475450962781906,
        -0.20119760930538177,
        0.2549121677875519,
        0.5107403993606567,
        -0.7949135303497314,
        -0.011841488070786,
        0.19454646110534668,
        0.05345812812447548,
        -0.11522673815488815,
        0.5408268570899963,
        0.3094711899757385,
        0.7144935131072998,
        -0.18128401041030884,
        1.1687852144241333,
        -0.03818381205201149,
        -0.21289783716201782,
        0.3308393955230713,
        0.42472755908966064,
        -0.34336692094802856,
        0.6581982374191284,
        -0.1827225238084793,
        -0.15525412559509277,
        -0.12611524760723114,
        0.08570203185081482,
        -0.068257175385952,
        -0.033940285444259644,
        0.2540806531906128,
        -0.2161950320005417,
        -0.3869727849960327,
        -0.81828773021698,
        -0.0409642718732357,
        0.27270835638046265,
        0.1522863656282425,
        -0.4317692518234253,
        -0.9824542999267578,
        0.59580397605896,
        -1.134195327758789,
        -0.23264142870903015,
        -0.38375240564346313,
        -0.07201267033815384,
        -0.04598284885287285,
        -1.2045124769210815,
        -0.006331442855298519,
        -0.17178507149219513,
        0.41625213623046875,
        -0.06807000190019608,
        0.3666929304599762,
        0.12287627905607224,
        0.1259220689535141,
        -0.05335025116801262,
        0.1000417023897171,
        -0.6454387903213501,
        0.17412319779396057,
        -0.040357109159231186,
        -0.7320368885993958,
        -0.15307891368865967,
        -0.015477177686989307,
        0.18930038809776306,
        0.10034886747598648,
        -0.19322718679904938,
        -0.45744580030441284,
        -0.4322865307331085,
        -0.9031561017036438,
        0.019164927303791046,
        0.334649920463562,
        -2.000821828842163,
        0.4149635136127472,
        -0.22423480451107025,
        0.15673841536045074,
        -0.8563728928565979,
        0.4710240364074707,
        0.11249500513076782,
        0.4048596918582916,
        -0.08512863516807556,
        -1.4915655851364136,
        -0.4381186068058014,
        0.4305509924888611,
        0.4153271019458771,
        -0.5636579394340515,
        0.24801157414913177,
        0.10370974987745285,
        -0.2861262559890747,
        -0.4690169095993042,
        0.27953821420669556,
        0.4222368597984314,
        -0.13522395491600037,
        -0.2867198586463928,
        0.051263194531202316,
        -0.44884103536605835,
        -0.46191367506980896,
        -0.3616120517253876,
        -0.4648609161376953,
        -0.02980363368988037,
        0.20492708683013916,
        -0.05178959295153618,
        -0.1254163533449173,
        0.5206887125968933,
        0.0120512330904603,
        0.19545800983905792,
        -0.4209066331386566,
        -0.3721958100795746,
        0.2620101571083069,
        0.18624821305274963,
        -0.24532917141914368,
        0.2792884409427643,
        -0.3921099603176117,
        -1.3252747058868408,
        -0.2996586859226227,
        -0.29950565099716187,
        -1.092414140701294,
        -0.25106143951416016,
        -0.11050531268119812,
        0.06329289823770523,
        0.438094824552536,
        -2.1020286083221436,
        0.5516382455825806,
        -0.33467110991477966,
        -2.0858957767486572,
        -0.009940442629158497,
        0.22988274693489075,
        -0.43511301279067993,
        -0.08383523672819138,
        0.2801024317741394,
        0.3114091455936432,
        0.43340975046157837,
        0.6420824527740479,
        -0.3465513288974762,
        -0.17047019302845,
        0.6208182573318481,
        0.08819100260734558,
        0.14746151864528656,
        0.0607462078332901,
        -1.101016879081726,
        0.5529923439025879,
        0.5229969620704651,
        0.49792394042015076,
        0.23195159435272217,
        0.15976810455322266,
        0.11287929117679596,
        0.10723932832479477,
        -0.997302770614624,
        -0.5540984272956848,
        0.37268462777137756,
        0.2212550938129425,
        0.48182985186576843,
        -0.07300488650798798,
        -2.0025010108947754,
        -0.0134709058329463,
        -0.3280121982097626,
        -0.14456221461296082,
        0.1286950260400772,
        0.3126055896282196,
        1.2591320276260376,
        -0.2810184955596924,
        -0.496273934841156,
        -0.4508756697177887,
        -0.4338553547859192,
        0.06699588894844055,
        0.4246806502342224,
        0.1094403862953186,
        0.42055389285087585,
        0.12735041975975037,
        -0.3725299835205078,
        0.630405068397522,
        0.24149081110954285,
        -0.37682491540908813,
        -0.11745285242795944,
        0.03223155438899994,
        0.0872824564576149,
        0.10660047084093094,
        -0.30690714716911316,
        0.2395356297492981,
        0.023999037221074104,
        0.7223039865493774,
        0.22928041219711304,
        -0.13249602913856506,
        -0.148051455616951,
        0.2611262798309326,
        -0.20801319181919098,
        0.9250921010971069,
        0.30273109674453735,
        0.04567735269665718,
        0.09934066236019135,
        0.046203769743442535,
        0.022147951647639275,
        -0.6225561499595642,
        -0.441078782081604,
        0.284742146730423,
        0.8930851817131042,
        0.04659074544906616,
        -2.5266005992889404,
        0.5853145718574524,
        0.11788563430309296,
        -1.9824209213256836,
        0.1747332215309143,
        -0.2983361780643463,
        0.5302398204803467,
        -1.2275938987731934,
        0.21714013814926147,
        0.24747207760810852,
        -0.06719019263982773,
        -0.11669906973838806,
        -0.176909938454628,
        -0.0713673084974289,
        0.3837558627128601,
        0.10869820415973663,
        -0.6041431427001953,
        0.7174072265625,
        -0.059149812906980515,
        0.40010616183280945,
        -0.06276990473270416,
        -0.009167426265776157,
        0.8010273575782776,
        0.441507488489151,
        -0.005667806603014469,
        -0.12160832434892654,
        0.08597448468208313,
        -0.8993985056877136,
        -0.10473494231700897,
        -0.4970412850379944,
        0.4126202166080475,
        -0.14890708029270172,
        -0.7650147080421448,
        -0.18032565712928772,
        0.5154438614845276,
        0.07179349660873413,
        0.02212245762348175,
        -1.1167948246002197,
        0.1154886931180954,
        -0.6510147452354431,
        0.2295982986688614,
        -0.653912365436554,
        0.3992912471294403,
        -0.1865144819021225,
        -2.3760769367218018,
        -1.4198694229125977,
        -0.6437599062919617,
        -0.012574056163430214,
        -0.12264252454042435,
        -0.2456161081790924,
        -0.23118871450424194,
        -0.3703776001930237,
        -2.2539148330688477,
        -0.3802260160446167,
        -0.17249567806720734,
        -2.471022605895996,
        -0.2359025925397873,
        -0.4285874366760254,
        1.3757987022399902,
        0.15191514790058136,
        -0.33322522044181824,
        0.01269281841814518,
        0.20696640014648438,
        0.04588673636317253,
        0.7197580337524414,
        0.4424639046192169,
        0.5776463747024536,
        0.2860911190509796,
        0.33214327692985535,
        0.033445704728364944,
        -1.9213905334472656,
        0.54787278175354,
        0.7894145250320435,
        -0.03999750316143036,
        0.3040791451931,
        -0.14452680945396423,
        0.1786855161190033,
        0.3231881260871887,
        -0.9919896721839905,
        -0.0570315420627594,
        -0.39002126455307007,
        0.23374594748020172,
        0.16462458670139313,
        -0.6887837052345276,
        -0.28392133116722107,
        0.3080715537071228,
        -0.15387065708637238,
        -0.496401309967041,
        -0.027014968916773796,
        -0.28463953733444214,
        -0.053506553173065186,
        -0.21467582881450653,
        -0.31274691224098206,
        0.15757399797439575,
        -0.23415568470954895,
        0.07830121368169785,
        0.08124331384897232,
        0.2247866839170456,
        0.46375688910484314,
        -0.39787614345550537,
        0.2585850656032562,
        0.0009001008002087474,
        0.30401015281677246,
        -0.3446924090385437,
        0.372152715921402,
        -0.4013327360153198,
        0.19284136593341827,
        0.07829989492893219,
        0.4798860549926758,
        -0.3113754987716675,
        -0.12218588590621948,
        -0.3775652050971985,
        0.19414961338043213,
        0.5209043622016907,
        -0.13855282962322235,
        -0.09239771962165833,
        -0.09354176372289658,
        -0.16379418969154358,
        0.062475528568029404,
        -0.014964668080210686,
        0.2717011868953705,
        -0.18042759597301483,
        0.15526777505874634,
        0.19918081164360046,
        0.36666831374168396,
        -0.05096469819545746,
        -0.14869047701358795,
        -0.03438512608408928,
        -0.5589938759803772,
        -0.0761389210820198,
        0.38080036640167236,
        -2.1529905796051025,
        -0.05905027687549591,
        0.40475624799728394,
        0.30495157837867737,
        -0.23797856271266937,
        -1.4783836603164673,
        -0.3997668921947479,
        -0.6169596910476685,
        -0.3512534499168396,
        0.1576274037361145,
        0.21259449422359467,
        0.3608165681362152,
        0.5646196007728577,
        -0.044649992138147354,
        -0.5380463004112244,
        0.8863880038261414,
        -1.0297898054122925,
        1.6312028169631958,
        0.9312289357185364,
        -0.14784246683120728,
        1.160282015800476,
        -0.3094046711921692,
        0.4482041299343109,
        1.6042298078536987,
        0.5536410808563232,
        -0.2669031023979187,
        1.2602230310440063,
        -0.44747981429100037,
        1.5127979516983032,
        0.30440449714660645,
        -0.41710364818573,
        -0.17218871414661407,
        1.248443365097046,
        -1.6443904638290405,
        -0.1337508261203766,
        -0.9664056897163391,
        -0.03231148049235344,
        0.06777900457382202,
        -0.15439750254154205,
        -1.0779783725738525,
        0.6127291321754456,
        0.1601725071668625,
        -0.14701665937900543,
        0.7896094918251038,
        0.9069686532020569,
        -1.1419322490692139,
        -0.360908567905426,
        0.49551668763160706,
        1.6803988218307495,
        0.26062309741973877,
        -1.064500331878662,
        -1.3556917905807495,
        0.025275472551584244,
        0.49170440435409546,
        1.0497252941131592,
        0.3089478015899658,
        -0.8955976366996765,
        -1.940222144126892,
        0.6795705556869507,
        -1.1977627277374268,
        0.3722558319568634,
        -0.7239550948143005,
        0.2286108434200287,
        0.7415180802345276,
        0.22747519612312317,
        -0.18696953356266022,
        -0.42560094594955444,
        0.062391698360443115,
        -0.10468664765357971,
        -0.8190109133720398,
        0.11667121201753616,
        -0.2734779119491577,
        0.8182216286659241,
        0.4490635395050049,
        -0.9522055387496948,
        0.28432929515838623,
        -0.12336664646863937,
        -0.6586841940879822,
        -1.4080971479415894,
        -0.5087019801139832,
        -0.008646889589726925,
        0.19309775531291962,
        -1.5452992916107178,
        -0.5379788875579834,
        0.24431045353412628,
        -2.7499992847442627,
        0.9697723388671875,
        0.006201428826898336,
        -0.8984550833702087,
        0.12094195187091827,
        -0.6842460632324219,
        0.9598774909973145,
        1.1567078828811646,
        0.22663447260856628,
        1.03485107421875,
        0.5550670623779297,
        2.263603687286377,
        0.30249834060668945,
        -0.38212084770202637,
        -0.44381648302078247,
        0.5615939497947693,
        0.9169472455978394,
        1.9756698608398438,
        -1.2736066579818726,
        -0.7456519603729248,
        -1.816706657409668,
        -2.28261399269104,
        -2.025498628616333,
        -0.4293893575668335,
        0.00786915048956871,
        0.385131299495697,
        0.631767988204956,
        0.12354229390621185,
        1.7999095916748047,
        -1.2789195775985718,
        -0.35535818338394165,
        -2.2813687324523926,
        -0.30519986152648926,
        1.1274046897888184,
        -2.140194892883301,
        1.9445279836654663,
        -0.059616975486278534,
        0.373676061630249,
        0.048708632588386536,
        -0.1299239546060562,
        0.10640653967857361,
        0.4629615843296051,
        -0.5069785118103027,
        0.06953458487987518,
        -1.7810739278793335,
        0.5046277046203613,
        -1.8326410055160522,
        -0.4065335988998413,
        -0.10788335651159286,
        0.043101966381073,
        0.4141121208667755,
        0.1249317079782486,
        -0.033305685967206955,
        0.005015036091208458,
        0.19475917518138885,
        0.41504237055778503,
        0.14065790176391602,
        -0.21476061642169952,
        -0.22209763526916504,
        0.4621169865131378,
        0.22987507283687592,
        0.3654700219631195,
        -0.06524893641471863,
        -0.22444625198841095,
        -0.08899330347776413,
        -0.03594053164124489,
        -0.6227882504463196,
        -0.2209443300962448,
        0.17886245250701904,
        0.19520173966884613,
        -0.5862898826599121,
        -0.5117963552474976,
        0.531943142414093,
        0.49257123470306396,
        -1.2047009468078613,
        0.2848440110683441,
        0.6998607516288757,
        0.25762054324150085,
        0.9234591722488403,
        -0.13750992715358734,
        -1.0101404190063477,
        0.4202862083911896,
        -0.47541096806526184,
        0.11182834208011627,
        0.09395402669906616,
        -0.9780189394950867,
        0.11285897344350815,
        -0.2587093114852905,
        -0.22667789459228516,
        0.1468597799539566,
        -0.9889243245124817,
        -0.2772379517555237,
        0.4003390371799469,
        0.6047210693359375,
        0.5037204027175903,
        0.27253565192222595,
        -0.7299150824546814,
        0.1815454214811325,
        -0.18448062241077423,
        0.4291546046733856,
        -0.0793691948056221,
        0.021236207336187363,
        0.42605751752853394,
        0.7481551170349121,
        -0.3890117406845093,
        1.1073939800262451,
        -1.1517415046691895,
        -0.7189422845840454,
        -0.916578471660614,
        -0.5645637512207031,
        0.10115125775337219,
        -0.062459882348775864,
        -0.2883818447589874,
        0.39051979780197144,
        0.6946638226509094,
        -0.2555936872959137,
        -1.4496046304702759,
        0.29612797498703003,
        0.6318014860153198,
        -0.1840216964483261,
        0.22827385365962982,
        0.2049153596162796,
        -0.01653149165213108,
        -0.01344608049839735,
        0.36246681213378906,
        0.12658874690532684,
        -0.30691421031951904,
        -0.2794432044029236,
        -0.028909780085086823,
        0.009455774910748005,
        -0.06399606168270111,
        0.2740778923034668,
        0.0005502457497641444,
        -0.35812968015670776,
        -0.1451728343963623,
        -0.3589977025985718,
        -0.35721150040626526,
        -0.1852143257856369,
        -0.019576502963900566,
        -0.16142475605010986,
        -0.5116223096847534,
        0.28976666927337646,
        0.4124186933040619,
        0.4107134938240051,
        0.5106348395347595,
        -0.3219180107116699,
        0.7747343182563782,
        0.4324653446674347,
        -0.45216605067253113,
        0.00831118319183588,
        0.21455436944961548,
        0.44385793805122375,
        -0.5564869046211243,
        -0.0379568487405777,
        0.464099258184433,
        -0.036025192588567734,
        0.1821189671754837,
        -0.2075675129890442,
        0.029348120093345642,
        0.4276624917984009,
        -0.09761865437030792,
        -0.016667505726218224,
        -0.02127879485487938,
        0.4938521087169647,
        -0.05502631515264511,
        -0.038532804697752,
        -1.4310925006866455,
        -0.34527164697647095,
        0.3456529378890991,
        -0.13144855201244354,
        -0.010500526055693626,
        0.4452163875102997,
        0.33337658643722534,
        -0.35857903957366943,
        -0.1554471254348755,
        0.47598448395729065,
        0.42401137948036194,
        -0.08032535761594772,
        0.1148279681801796,
        0.10553214699029922,
        0.03786022961139679,
        -0.7004811763763428,
        0.18100053071975708,
        -0.33831411600112915,
        0.4119967818260193,
        0.05688745528459549,
        0.140646830201149,
        0.18333770334720612,
        0.0870128646492958,
        -0.19433026015758514,
        -0.0631503313779831,
        -0.6506145000457764,
        -0.5448258519172668,
        0.30978041887283325,
        -0.19155767560005188,
        -0.38025912642478943,
        0.5457818508148193,
        0.1398635059595108,
        -0.8639339804649353,
        -0.04317949339747429,
        -0.028426984325051308,
        -0.6177701354026794,
        0.20919765532016754,
        0.2587147355079651,
        0.24289052188396454,
        -0.5407112836837769,
        -0.308663010597229,
        -0.06386776268482208,
        -1.471189022064209,
        0.296290785074234,
        -0.5516437292098999,
        0.25245630741119385,
        0.2698219418525696,
        -0.2334890514612198,
        0.19227302074432373,
        -0.22416122257709503,
        0.5092999339103699,
        -0.4137178063392639,
        -0.7966493368148804,
        -0.1102733388543129,
        0.3289965093135834,
        -0.11235325783491135,
        0.05883185938000679,
        0.27558794617652893,
        0.10632453113794327,
        0.25760558247566223,
        -0.10878362506628036,
        0.22601254284381866,
        0.07958449423313141,
        0.03220914676785469,
        0.38810819387435913,
        0.48558613657951355,
        0.13997478783130646,
        -0.10104798525571823,
        -0.8863081336021423,
        -0.6672287583351135,
        -1.2774869203567505,
        0.4475598931312561,
        0.512061595916748,
        0.2233535796403885,
        0.4258819818496704,
        0.169896200299263,
        0.3376372456550598,
        -0.2591016888618469,
        -0.8510220646858215,
        0.12869462370872498,
        0.21184544265270233,
        -0.33339202404022217,
        -0.35038965940475464,
        0.2934219539165497,
        0.632238507270813,
        -0.23774752020835876,
        0.49842193722724915,
        0.3764519691467285,
        0.13695092499256134,
        0.5655016303062439,
        0.19596825540065765,
        0.07270362228155136,
        -0.08417163044214249,
        -0.12879647314548492,
        -0.5475814938545227,
        -0.10610953718423843,
        -0.0535530187189579,
        -0.03432677686214447,
        -0.4727475345134735,
        0.05012955516576767,
        0.2580764889717102,
        0.42251917719841003,
        0.16646529734134674,
        -0.14588965475559235,
        0.5816236734390259,
        -0.7063328623771667,
        0.15071935951709747,
        -0.08633556216955185,
        0.3121074438095093,
        0.4775872528553009,
        -0.19009268283843994,
        0.04422608017921448,
        0.4946759343147278,
        0.7376734018325806,
        -0.6405767798423767,
        0.5297192335128784,
        -0.13288338482379913,
        0.05917752906680107,
        0.11719467490911484,
        -0.21833692491054535,
        0.2606664299964905,
        0.1524503380060196,
        -0.3262448012828827,
        -0.0550006702542305,
        0.012030955404043198,
        -0.3304107189178467,
        0.09153565764427185,
        0.1505165547132492,
        0.07696488499641418,
        -0.1837683618068695,
        0.7543816566467285,
        0.21116243302822113,
        0.4941880404949188,
        0.263104647397995,
        0.27841147780418396,
        -0.15585185587406158,
        0.49088773131370544,
        0.2963997423648834,
        -0.3626357913017273,
        0.3273942172527313,
        0.30805811285972595,
        0.391452431678772,
        0.1213335320353508,
        -0.017834855243563652,
        -0.0270990040153265,
        -0.3025163412094116,
        0.16489847004413605,
        0.620001494884491,
        -0.07974980026483536,
        -0.18829555809497833,
        0.2529366612434387,
        -0.40795862674713135,
        -0.4017709791660309,
        0.07595700770616531,
        -0.09645478427410126,
        0.3690148890018463,
        0.0946415513753891,
        -0.4630851745605469,
        0.22153182327747345,
        -0.2146441787481308,
        -1.372740626335144,
        -0.1962006688117981,
        -0.05893903598189354,
        -0.8602400422096252,
        0.10446664690971375,
        0.17553220689296722,
        0.5084841847419739,
        -0.3985218405723572,
        -0.4356919825077057,
        0.25292515754699707,
        -1.728670358657837,
        -0.20116589963436127,
        -0.21946686506271362,
        0.030340423807501793,
        0.486421138048172,
        0.25577661395072937,
        -0.1907971054315567,
        0.061624716967344284,
        0.5379120707511902,
        0.16886776685714722,
        -1.0268360376358032,
        0.6784620881080627,
        0.26585817337036133,
        -0.5568304657936096,
        0.31336477398872375,
        0.20396442711353302,
        0.7118549942970276,
        0.07409662753343582,
        0.1411539614200592,
        0.07206663489341736,
        0.15286190807819366,
        0.4404400587081909,
        0.34728768467903137,
        0.6002935767173767,
        0.500909686088562,
        -0.26138412952423096,
        -0.41079390048980713,
        -0.05462774261832237,
        -0.09853260219097137,
        -0.5901167392730713,
        0.3676527738571167,
        0.0744883120059967,
        0.23628270626068115,
        -0.5220601558685303,
        0.6244387626647949,
        -0.14516080915927887,
        -1.1667500734329224,
        -0.07229705154895782,
        0.23980621993541718,
        -0.49872952699661255,
        -0.1134900376200676,
        0.4591260254383087,
        0.2645340859889984,
        0.1901225745677948,
        0.49075669050216675,
        0.22375187277793884,
        -0.3310665488243103,
        -0.4196382164955139,
        0.40174373984336853,
        -0.32073459029197693,
        -0.044284623116254807,
        0.33776718378067017,
        -0.6556516289710999,
        0.088681161403656,
        0.2936525344848633,
        -0.1632896214723587,
        -0.8423003554344177,
        -0.12687300145626068,
        0.6024876236915588,
        -0.1566455215215683,
        -0.6430468559265137,
        0.18792977929115295,
        0.23552998900413513,
        0.72687166929245,
        0.05457364767789841,
        0.4629110097885132,
        0.2526147663593292,
        0.2720700204372406,
        0.40554535388946533,
        -0.11915645748376846,
        0.580254077911377,
        -0.2816515266895294,
        -1.2439031600952148,
        0.2244185209274292,
        0.37030354142189026,
        0.31477999687194824,
        0.14876027405261993,
        0.5354152917861938,
        -0.267347127199173,
        -0.07737763226032257,
        -0.3617178201675415,
        -0.1839464008808136,
        0.08935495465993881,
        -0.45489490032196045,
        0.12125828862190247,
        0.25274887681007385,
        -0.2621211111545563,
        -0.23826289176940918,
        0.6221631169319153,
        -0.13279078900814056,
        0.07164984941482544,
        0.3432779610157013,
        0.18170154094696045,
        -0.3362375795841217,
        -0.23788735270500183,
        -0.00168130942620337,
        0.4800190031528473,
        -0.37443065643310547,
        0.19229479134082794,
        0.3191687762737274,
        0.07840705662965775,
        -0.16215454041957855,
        0.02698921225965023,
        -0.09591779112815857,
        -0.8588760495185852,
        0.16531085968017578,
        0.1004209965467453,
        -0.13729740679264069,
        0.2676001191139221,
        -0.2655426263809204,
        -0.21187210083007812,
        -0.7418153882026672,
        0.16176900267601013,
        -0.15988171100616455,
        0.09550928324460983,
        -0.026845715939998627,
        0.532937228679657,
        -0.19085659086704254,
        -1.0313291549682617,
        -0.3403629958629608,
        0.01760995388031006,
        -1.122841238975525,
        0.7142641544342041,
        -0.4240745007991791,
        0.41556116938591003,
        0.4211391508579254,
        -0.0820729210972786,
        0.2702871561050415,
        -1.1169979572296143,
        -0.9667862057685852,
        0.41336682438850403,
        -0.009416051208972931,
        0.4899936318397522,
        0.6325743198394775,
        -0.32773739099502563,
        -0.0014628809876739979,
        0.30102694034576416,
        0.2951981723308563,
        -1.5832287073135376,
        -0.20245261490345,
        0.35988596081733704,
        -0.6481645107269287,
        -0.06722185760736465,
        0.25417768955230713,
        0.21423393487930298,
        -0.16617871820926666,
        -0.36260899901390076,
        0.0359889455139637,
        -0.21650539338588715,
        0.8251560926437378,
        0.27483636140823364,
        0.6518484354019165,
        0.13146890699863434,
        0.24604977667331696,
        0.07564770430326462,
        -1.3084144592285156,
        -1.3042964935302734,
        0.32366740703582764,
        0.26143157482147217,
        -0.09326887875795364,
        -0.008684666827321053,
        0.008272122591733932,
        0.7208499908447266,
        -0.1740626096725464,
        -2.065422534942627,
        0.02427874132990837,
        0.13780097663402557,
        0.19372966885566711,
        -0.4122221767902374,
        0.08345381915569305,
        0.09204571694135666,
        0.20810508728027344,
        0.6077602505683899,
        0.41106539964675903,
        0.179629385471344,
        -0.04222659021615982,
        0.2792728841304779,
        -0.14544013142585754,
        -0.05383079871535301,
        0.27902913093566895,
        0.722131609916687,
        -0.2932385802268982,
        -0.10115357488393784,
        0.49748170375823975,
        -0.2814851701259613,
        0.06660959869623184,
        -0.4542483687400818,
        -0.26500973105430603,
        0.07395417243242264,
        0.027437014505267143,
        0.2684575915336609,
        0.04484294727444649,
        0.23427028954029083,
        -0.14975039660930634,
        0.12863439321517944,
        0.17622970044612885,
        0.3009272813796997,
        0.09564829617738724,
        0.14168836176395416,
        -0.7359827160835266,
        -1.4542596340179443,
        0.3136524260044098,
        0.3015109598636627,
        0.3483930230140686,
        0.091874860227108,
        -0.060484401881694794,
        -0.13097332417964935,
        0.28481295704841614,
        -0.27044305205345154,
        -0.14000771939754486,
        0.07149200141429901,
        0.6468334197998047,
        0.028852377086877823,
        0.2925654351711273,
        0.4248853623867035,
        0.2512657642364502,
        -0.09565164148807526,
        0.11886175721883774,
        -0.3693057894706726,
        0.3406100869178772,
        -0.2519403100013733,
        -0.1415054351091385,
        0.3352036774158478,
        0.15666623413562775,
        0.4860377311706543,
        0.10020182281732559,
        0.10480566322803497,
        0.12230774015188217,
        -0.14694896340370178,
        -0.05774007365107536,
        0.0038120090030133724,
        0.014669861644506454,
        -0.12255349010229111,
        0.5397257208824158,
        0.4218616485595703,
        0.08768527209758759,
        0.6105743646621704,
        -0.1804044395685196,
        -0.30779609084129333,
        -0.2672054171562195,
        0.02041604369878769,
        0.20100438594818115,
        -0.1410982757806778,
        0.2550317645072937,
        -1.5258378982543945,
        -0.1891150027513504,
        0.27522048354148865,
        0.0032716146670281887,
        -0.6002699732780457,
        0.2600547969341278,
        -0.3327285349369049,
        0.2336534857749939,
        0.2085854560136795,
        0.6690266728401184,
        -0.36876776814460754,
        0.5094821453094482,
        -0.7070788741111755,
        -0.6139193773269653,
        -0.3743256628513336,
        0.19195638597011566,
        0.21555225551128387,
        0.6009052395820618,
        0.2657068073749542,
        -0.38296908140182495,
        0.4506660997867584,
        0.07928325980901718,
        -0.8339409828186035,
        -0.17349472641944885,
        0.2968122065067291,
        0.08175013959407806,
        0.04688296094536781,
        0.23019593954086304,
        0.16093376278877258,
        -0.20367233455181122,
        -0.03535301610827446,
        0.21060538291931152,
        -0.20092956721782684,
        -1.5692771673202515,
        0.13043367862701416,
        -0.0009241604711860418,
        0.1856759488582611,
        -0.9254781603813171,
        -0.4857715368270874,
        -0.326412558555603,
        -0.5912832617759705,
        -0.1821126639842987,
        0.5613068342208862,
        -0.14508219063282013,
        0.1170836091041565,
        0.8333736062049866,
        0.24373777210712433,
        -0.1676982343196869,
        -0.6463968753814697,
        -0.0224970243871212,
        0.4206480085849762,
        0.010986131615936756,
        0.08481763303279877,
        -0.05982981249690056,
        0.2307024747133255,
        0.16637437045574188,
        0.3289886713027954,
        0.3602551221847534,
        -0.22253313660621643,
        -0.0730358213186264,
        0.4841802418231964,
        0.22812344133853912,
        -0.08995573222637177,
        0.4769594669342041,
        0.11760739237070084,
        -0.11540022492408752,
        -0.08210138976573944,
        0.2403578907251358,
        -0.04073214903473854,
        -0.17893049120903015,
        0.6686089634895325,
        -0.1782681792974472,
        0.019155533984303474,
        0.3212377429008484,
        0.43761152029037476,
        0.5857263803482056,
        0.6605330109596252,
        -0.19597826898097992,
        0.3728993833065033,
        -0.04853804409503937,
        -0.08002869784832001,
        0.4006166160106659,
        0.354625940322876,
        -0.8453484773635864,
        -0.8657183647155762,
        0.6045469045639038,
        0.5467551350593567,
        -0.4656578004360199,
        0.04877008870244026,
        -0.10738451778888702,
        0.2746906280517578,
        0.40968334674835205,
        0.043644875288009644,
        -0.02356524020433426,
        0.11781267821788788,
        -0.06344299018383026,
        0.3619340658187866,
        -0.6751510500907898,
        0.26941725611686707,
        -1.0705546140670776,
        0.004400708246976137,
        -0.08498766273260117,
        -0.971790611743927,
        0.32377147674560547,
        -0.05893031880259514,
        -0.36415988206863403,
        -0.08893411606550217,
        0.3600635826587677,
        -1.5303329229354858,
        2.4130024909973145,
        1.9678468704223633,
        -2.2503645420074463,
        0.7267547249794006,
        0.12015099823474884,
        -1.6243020296096802,
        1.2241334915161133,
        -0.07942074537277222,
        0.04899370297789574,
        1.1870485544204712,
        2.3688302040100098,
        -0.8892356157302856,
        2.2652881145477295,
        1.2959880828857422,
        0.5199300646781921,
        0.03711120784282684,
        1.9239321947097778,
        0.08036933839321136,
        0.2601771056652069,
        0.3074963688850403,
        1.403533935546875,
        -0.8630496263504028,
        1.0352506637573242,
        -1.4183447360992432,
        1.0198781490325928,
        -1.4111422300338745,
        -2.6364357471466064,
        -0.35001975297927856,
        -0.75886070728302,
        -1.219012975692749,
        1.1565207242965698,
        -0.5684293508529663,
        0.3991352319717407,
        -0.13288450241088867,
        3.0220882892608643,
        -0.47236666083335876,
        -0.30022940039634705,
        0.7590974569320679,
        0.32346630096435547,
        1.6087415218353271,
        -0.5896325707435608,
        0.0320146270096302,
        0.2364177256822586,
        0.13790865242481232,
        1.0239455699920654,
        1.0154223442077637,
        0.201060950756073,
        -0.5864847898483276,
        1.0399523973464966,
        0.926834225654602,
        -1.7433817386627197,
        1.3476274013519287,
        0.6819894313812256,
        -0.07817500084638596,
        -2.5308592319488525,
        1.0790183544158936,
        -0.04942156374454498,
        1.0437315702438354,
        0.21252132952213287,
        -0.1693522185087204,
        -0.4657798707485199,
        0.0855807438492775,
        -2.162703514099121,
        -1.2919059991836548,
        -1.1750197410583496,
        -2.834413766860962,
        -0.08361303061246872,
        -0.4981817901134491,
        0.07712745666503906,
        0.01604270376265049,
        0.37797561287879944,
        -0.4068510830402374,
        -0.04680728167295456,
        -3.4798989295959473,
        0.23768292367458344,
        -0.46986299753189087,
        0.3040223717689514,
        -0.3356320858001709,
        2.8460030555725098,
        0.30062440037727356,
        -2.081350803375244,
        -0.1694989949464798,
        -0.44708409905433655,
        -0.36006060242652893,
        1.3059940338134766,
        -0.6231750845909119,
        -0.5097173452377319,
        -1.5740808248519897,
        -1.3689818382263184,
        -1.4146249294281006,
        -0.2919091582298279,
        -0.1732555478811264,
        -2.667241334915161,
        1.6095993518829346,
        0.9820306301116943,
        -1.239838719367981,
        0.2677465081214905,
        -1.2248971462249756,
        -0.7225371599197388,
        0.5098603963851929,
        0.19131813943386078,
        -0.35521259903907776,
        0.11564085632562637,
        -0.35828837752342224,
        -3.097957134246826,
        -0.4710559844970703,
        -0.36408731341362,
        -2.0360476970672607,
        -0.5848921537399292,
        -3.0730185508728027,
        0.8084381818771362,
        0.21645453572273254,
        2.0338780879974365,
        0.23843219876289368,
        0.9432755708694458,
        -0.1369975060224533,
        1.207310438156128,
        1.0492229461669922,
        -0.060484834015369415,
        0.08912213146686554,
        0.004359458107501268,
        0.09184027463197708,
        -0.6707889437675476,
        -1.020067572593689,
        -1.814383864402771,
        0.231302872300148,
        0.5670900940895081,
        0.3647006154060364,
        -0.024345727637410164,
        -0.19900469481945038,
        0.6039985418319702,
        -0.052505891770124435,
        -0.3218543827533722,
        0.30854332447052,
        -0.36204859614372253,
        -0.37009406089782715,
        0.6561365127563477,
        -0.07541167736053467,
        -0.014490396715700626,
        0.17751547694206238,
        -0.17512118816375732,
        -0.28025972843170166,
        -0.14403656125068665,
        -0.29576724767684937,
        -0.4419349431991577,
        -0.2698855400085449,
        -0.4507136642932892,
        -0.16271689534187317,
        0.2942409813404083,
        0.17434656620025635,
        0.3751871883869171,
        0.23999908566474915,
        0.26520729064941406,
        -0.27305981516838074,
        0.39292073249816895,
        0.36868250370025635,
        0.03272613137960434,
        0.4024572968482971,
        0.03437504917383194,
        0.3132372796535492,
        0.2657645046710968,
        -0.13438010215759277,
        -0.25794717669487,
        0.3891272246837616,
        0.21077492833137512,
        -0.41922634840011597,
        -0.17072756588459015,
        0.21686333417892456,
        0.2739642560482025,
        -0.11006997525691986,
        0.25577232241630554,
        0.32081618905067444,
        0.3397614657878876,
        0.23151591420173645,
        0.13982804119586945,
        -0.19667720794677734,
        -0.6107407212257385,
        -0.6981096267700195,
        0.12751926481723785,
        0.3735581338405609,
        -0.250735878944397,
        0.6382593512535095,
        0.05128292739391327,
        0.39800840616226196,
        -0.0599953755736351,
        0.40191709995269775,
        0.33882641792297363,
