{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel_1",
      "shape": [
        15,
        64
      ],
      "dtype": "float32",
      "data": [
        -0.466848760843277,
        0.8618912100791931,
        1.0260999202728271,
        -1.8930422067642212,
        -0.58357834815979,
        -2.875584840774536,
        0.03977873921394348,
        -0.1276731640100479,
        0.2820361256599426,
        0.12776266038417816,
        0.21549542248249054,
        -0.34738361835479736,
        0.42380592226982117,
        0.019207071512937546,
        0.503464937210083,
        0.26769599318504333,
        0.1789536327123642,
        0.602657675743103,
        0.6192068457603455,
        -3.717449426651001,
        0.4706227481365204,
        -1.3532401323318481,
        -2.871851682662964,
        0.06042191758751869,
        0.5271380543708801,
        -0.08392838388681412,
        0.7825323343276978,
        -0.18966209888458252,
        -0.32937467098236084,
        -1.379233717918396,
        -0.1866290420293808,
        0.35916605591773987,
        0.38442251086235046,
        -1.0742517709732056,
        -3.3448290824890137,
        0.4978168308734894,
        -0.13423016667366028,
        0.34019410610198975,
        -0.3036712110042572,
        0.17852097749710083,
        -0.1230243518948555,
        -2.500319719314575,
        0.3374759554862976,
        0.8248034119606018,
        0.35523295402526855,
        0.061369288712739944,
        0.3636247515678406,
        0.22064055502414703,
        1.289097547531128,
        -2.574549913406372,
        1.439004898071289,
        0.97711580991745,
        0.48253875970840454,
        -1.1510512828826904,
        -3.239161252975464,
        0.9513368010520935,
        1.3777744770050049,
        -0.44214606285095215,
        0.48925232887268066,
        -0.34562498331069946,
        0.16623251140117645,
        -0.43618106842041016,
        0.46993541717529297,
        0.2901134490966797,
        0.49020102620124817,
        0.37073975801467896,
        0.8116607666015625,
        -1.18915593624115,
        -1.0142337083816528,
        -2.5244505405426025,
        0.7253199815750122,
        -1.2676047086715698,
        -0.18993166089057922,
        0.4143518805503845,
        0.2763461470603943,
        -0.7996411919593811,
        0.06302594393491745,
        -0.10850405693054199,
        -1.9528443813323975,
        0.9341973066329956,
        0.9441331624984741,
        0.7904165387153625,
        0.028336981311440468,
        -2.794734477996826,
        0.6724810004234314,
        0.9125823974609375,
        -2.589639902114868,
        -0.20200827717781067,
        0.6270327568054199,
        -0.3366028070449829,
        1.385982632637024,
        0.01949189230799675,
        -0.2957797646522522,
        -0.36854010820388794,
        -0.26172786951065063,
        0.32983291149139404,
        0.2009643167257309,
        -0.6297635436058044,
        -2.973827362060547,
        1.1585239171981812,
        0.3367971181869507,
        0.15802708268165588,
        0.5464378595352173,
        0.1295752227306366,
        -0.42086902260780334,
        -2.5359880924224854,
        -0.11158724874258041,
        0.794170618057251,
        -0.256605863571167,
        -0.027416467666625977,
        -0.09782370924949646,
        0.75696861743927,
        0.3129402995109558,
        0.030344581231474876,
        0.44027960300445557,
        0.2157895416021347,
        0.19067883491516113,
        -1.1082602739334106,
        -2.8133797645568848,
        0.8478981852531433,
        0.9462783336639404,
        -0.7301164269447327,
        0.5056331753730774,
        0.17258429527282715,
        1.7817676067352295,
        0.30884283781051636,
        -0.09574216604232788,
        0.23777472972869873,
        0.8513609170913696,
        0.09489178657531738,
        0.314118355512619,
        -0.20873479545116425,
        0.3220224678516388,
        -3.240908622741699,
        0.32276833057403564,
        -1.7964781522750854,
        -0.7236913442611694,
        -0.17093871533870697,
        0.04153719171881676,
        -0.40208181738853455,
        0.13715533912181854,
        0.23207814991474152,
        -0.20995530486106873,
        0.6343784928321838,
        1.8059098720550537,
        0.293965607881546,
        0.7156977653503418,
        -3.3363125324249268,
        0.1109735369682312,
        0.7887007594108582,
        -0.6634376049041748,
        -0.15151925384998322,
        1.1046384572982788,
        -0.0031241211108863354,
        0.7631431818008423,
        0.25812265276908875,
        0.3727681636810303,
        -0.7571355104446411,
        -0.22271868586540222,
        0.5222113132476807,
        -0.7094457745552063,
        0.7133086919784546,
        -3.8721156120300293,
        0.8379634618759155,
        0.24501469731330872,
        -0.055467065423727036,
        -0.017891833558678627,
        0.523578941822052,
        0.4880039393901825,
        -2.7307896614074707,
        0.22233030200004578,
        0.71480792760849,
        -0.14693067967891693,
        0.013816199265420437,
        0.17760975658893585,
        0.47965025901794434,
        0.6657247543334961,
        0.21928635239601135,
        -0.15865837037563324,
        0.7711414098739624,
        0.5016415119171143,
        -0.537887454032898,
        -3.3178396224975586,
        1.477826714515686,
        0.28476646542549133,
        0.6112136840820312,
        0.8164560198783875,
        0.7724369168281555,
        1.3029241561889648,
        0.3552248179912567,
        -0.07741466164588928,
        0.24737690389156342,
        0.6607071757316589,
        0.1710524708032608,
        0.61373370885849,
        -2.462160587310791,
        -0.09822487086057663,
        -5.562624454498291,
        0.5873950719833374,
        -0.5828021764755249,
        -0.04326063022017479,
        -0.1153731569647789,
        0.10408753156661987,
        -1.465189814567566,
        0.23585930466651917,
        0.41831621527671814,
        0.045422185212373734,
        0.5497161149978638,
        1.0371705293655396,
        0.8175655603408813,
        0.42491579055786133,
        -4.748497009277344,
        0.14133639633655548,
        0.7013320922851562,
        -2.5786092281341553,
        -0.13589993119239807,
        1.2984055280685425,
        0.8090038895606995,
        0.32073962688446045,
        0.45102179050445557,
        0.22822216153144836,
        -3.2458488941192627,
        0.06357461214065552,
        0.3239924907684326,
        0.004135946277529001,
        0.41336944699287415,
        -4.214102268218994,
        0.5570448040962219,
        -0.602103054523468,
        0.6021324992179871,
        0.2166394591331482,
        0.061245694756507874,
        0.5407902598381042,
        -4.158840179443359,
        0.8004472851753235,
        0.6079309582710266,
        0.35526514053344727,
        -0.3572721779346466,
        0.33334311842918396,
        0.15342828631401062,
        0.7513726353645325,
        -0.12633782625198364,
        0.426176518201828,
        -0.059499166905879974,
        0.31918883323669434,
        -0.9245087504386902,
        -4.9980788230896,
        0.7406342029571533,
        0.42487770318984985,
        0.36601436138153076,
        0.7719998955726624,
        0.7693619728088379,
        0.521649956703186,
        0.361815869808197,
        -0.4759593904018402,
        0.3670123815536499,
        0.47437170147895813,
        -4.016606330871582,
        -0.079036645591259,
        -3.9474728107452393,
        -1.3554579019546509,
        -3.07596492767334,
        0.7673079967498779,
        -1.448317050933838,
        -0.7919743657112122,
        -0.449677973985672,
        -0.05847592651844025,
        1.2599717378616333,
        -3.488647699356079,
        0.028691131621599197,
        -1.5063785314559937,
        1.0249618291854858,
        0.39639812707901,
        0.8140983581542969,
        0.3893669843673706,
        -6.308504581451416,
        0.17142651975154877,
        0.9264208078384399,
        -6.896481990814209,
        0.04227050766348839,
        0.6512628197669983,
        0.06597185879945755,
        0.6792163848876953,
        -0.36450836062431335,
        0.8773589730262756,
        -1.6673195362091064,
        0.14529667794704437,
        0.8948948383331299,
        0.4494118094444275,
        -0.3416811525821686,
        -6.030051231384277,
        1.1664743423461914,
        -0.8398873805999756,
        0.09230409562587738,
        0.3868426978588104,
        0.7390121221542358,
        0.2523476481437683,
        -6.271343231201172,
        0.23554465174674988,
        0.9327052235603333,
        -0.46158283948898315,
        -0.26081582903862,
        -0.7518215775489807,
        0.18935391306877136,
        1.3010201454162598,
        -1.4875621795654297,
        -0.7725111246109009,
        0.05976245552301407,
        -0.03560878336429596,
        1.210384488105774,
        -6.348814010620117,
        0.94282466173172,
        0.9602656364440918,
        -1.0170780420303345,
        0.798669695854187,
        0.6950998306274414,
        0.9429930448532104,
        0.6774463653564453,
        0.12202180922031403,
        0.5063609480857849,
        -0.23523962497711182,
        -0.6838867664337158,
        -4.832021236419678,
        -0.4263927936553955,
        -1.6668111085891724,
        0.07268621027469635,
        4.189298152923584,
        0.4916134476661682,
        0.3267977237701416,
        5.0603532791137695,
        -4.569008827209473,
        -1.5573768615722656,
        -0.9507595896720886,
        -0.0902547836303711,
        2.1222381591796875,
        -1.1967545747756958,
        -1.059883713722229,
        -4.577077865600586,
        4.680113315582275,
        0.10753641277551651,
        -4.628437519073486,
        -1.5100706815719604,
        0.1717710942029953,
        4.1543965339660645,
        -3.5281949043273926,
        -3.9236299991607666,
        -4.358232021331787,
        0.41187265515327454,
        -1.4969432353973389,
        0.7102272510528564,
        4.749467372894287,
        1.5595099925994873,
        -3.6003029346466064,
        -3.4148600101470947,
        0.20603251457214355,
        -1.693925142288208,
        1.76078462600708,
        4.709350109100342,
        5.020504951477051,
        5.566042423248291,
        3.43567156791687,
        0.2435097098350525,
        5.061002731323242,
        -3.981937885284424,
        -1.7342268228530884,
        3.021354913711548,
        -0.319019615650177,
        -2.6533522605895996,
        -1.7004791498184204,
        -0.7395578622817993,
        2.789947509765625,
        3.5048813819885254,
        -4.752185821533203,
        -1.5864495038986206,
        0.105325847864151,
        -1.7800047397613525,
        -3.8504180908203125,
        -2.958383321762085,
        -2.488046884536743,
        -1.3449702262878418,
        -2.0446784496307373,
        -1.451006531715393,
        -1.8761026859283447,
        -3.791959047317505,
        -0.7295063734054565,
        -0.14886866509914398,
        0.699224054813385,
        -0.9002085328102112,
        0.9279555678367615,
        0.28365081548690796,
        0.5885705947875977,
        -0.23495148122310638,
        0.19715741276741028,
        0.5495870113372803,
        0.4793914258480072,
        1.1928143501281738,
        0.06927402317523956,
        0.4914482533931732,
        -0.4364446997642517,
        0.6297817826271057,
        -0.9819941520690918,
        0.38751664757728577,
        0.3650384545326233,
        0.12773291766643524,
        0.4379780888557434,
        -0.7109265327453613,
        -0.685070276260376,
        0.3724386990070343,
        -0.09570623189210892,
        -0.08026401698589325,
        -0.06432177126407623,
        -0.2124357670545578,
        1.0930876731872559,
        -0.2733830511569977,
        -0.19336318969726562,
        0.39424845576286316,
        0.9386655688285828,
        -0.07656630128622055,
        0.21741603314876556,
        0.6067082285881042,
        0.004394410643726587,
        0.005052484106272459,
        0.42425215244293213,
        -0.06865273416042328,
        0.27504289150238037,
        0.5295392870903015,
        -0.05694037675857544,
        0.3461008667945862,
        0.6055935621261597,
        -0.0045342640951275826,
        0.07747455686330795,
        0.348305881023407,
        0.8246340751647949,
        -0.4783397912979126,
        0.9670014977455139,
        0.5700764060020447,
        0.5149564743041992,
        0.8740296959877014,
        0.23659762740135193,
        0.1385720819234848,
        0.9162999987602234,
        0.2626326084136963,
        0.54474276304245,
        -0.8992393612861633,
        0.47763946652412415,
        -0.03080045059323311,
        0.27189701795578003,
        0.20769959688186646,
        -0.07704722136259079,
        0.3796083629131317,
        0.6357057094573975,
        -0.528938889503479,
        0.9230813384056091,
        -0.02590569481253624,
        0.05118687078356743,
        0.7368700504302979,
        -0.15564218163490295,
        0.15107232332229614,
        0.12137544900178909,
        -0.5583564043045044,
        0.27622634172439575,
        -0.42528340220451355,
        0.19798682630062103,
        0.6296254992485046,
        0.3757707178592682,
        0.09342540800571442,
        0.36127057671546936,
        0.2473810613155365,
        0.42513126134872437,
        0.6729698181152344,
        0.21337716281414032,
        -0.22913916409015656,
        -0.16343265771865845,
        0.2172858864068985,
        0.07850300520658493,
        -0.03308418393135071,
        -0.09567301720380783,
        0.3827587962150574,
        -0.09572277218103409,
        0.39384517073631287,
        0.7710879445075989,
        0.6512918472290039,
        0.07612230628728867,
        0.34629422426223755,
        -0.05426030233502388,
        -0.28880220651626587,
        0.5784584879875183,
        -0.39773067831993103,
        1.0261304378509521,
        0.33439478278160095,
        -0.13429825007915497,
        0.8165093660354614,
        0.46122702956199646,
        0.17275288701057434,
        0.5461763739585876,
        -0.7040938138961792,
        0.6320493817329407,
        0.7991646528244019,
        0.3712085783481598,
        0.09938549995422363,
        0.028917711228132248,
        -0.19166141748428345,
        0.05572715029120445,
        0.65503990650177,
        0.6704016327857971,
        0.7302761077880859,
        0.09095831215381622,
        -1.5214953422546387,
        0.4590899646282196,
        -0.8141738176345825,
        0.43023571372032166,
        -0.05864518880844116,
        -2.268733024597168,
        0.4188721477985382,
        0.19331590831279755,
        0.10749257355928421,
        0.668849766254425,
        0.4873954951763153,
        -0.014946311712265015,
        0.826424241065979,
        0.06142405793070793,
        -0.055037323385477066,
        0.8163633346557617,
        0.5300647020339966,
        0.733565092086792,
        0.1131591647863388,
        0.466494083404541,
        0.6717905402183533,
        0.8555949926376343,
        0.34922441840171814,
        0.38780510425567627,
        0.44757530093193054,
        0.32759785652160645,
        0.5614675283432007,
        0.43388450145721436,
        0.18981443345546722,
        0.3105563819408417,
        0.6014406085014343,
        0.27363431453704834,
        -0.3452840745449066,
        -0.3118358552455902,
        0.7144630551338196,
        -0.12425786256790161,
        0.3843589425086975,
        0.0975656732916832,
        0.8760385513305664,
        0.2949523329734802,
        0.5664002895355225,
        0.6964343786239624,
        -0.02211817167699337,
        -0.13467425107955933,
        0.05459744483232498,
        0.45390769839286804,
        0.3872103989124298,
        0.05936075374484062,
        0.8249421119689941,
        0.0005552772781811655,
        -0.2729923129081726,
        -0.2371186912059784,
        0.8107781410217285,
        0.7738425135612488,
        -0.02225072681903839,
        0.09637025743722916,
        0.21308177709579468,
        0.354387104511261,
        0.32734760642051697,
        0.2303050309419632,
        0.4238739609718323,
        -0.027533575892448425,
        0.09212490916252136,
        0.7058026194572449,
        -2.3357632160186768,
        0.9485340118408203,
        -1.1337684392929077,
        0.15757933259010315,
        -0.23327739536762238,
        -2.5372233390808105,
        0.3934156894683838,
        0.2533116042613983,
        0.10061850398778915,
        0.844376266002655,
        0.402332067489624,
        0.5390949845314026,
        0.6076288223266602,
        0.1027035191655159,
        0.07952307909727097,
        0.531053900718689,
        0.43000075221061707,
        0.5794203877449036,
        -0.49813413619995117,
        0.0303325355052948,
        0.5520858764648438,
        1.806549310684204,
        0.1294170320034027,
        -0.1415587067604065,
        0.4628547728061676,
        0.05641429126262665,
        0.9061918258666992,
        0.45725277066230774,
        0.2470492720603943,
        0.2303706407546997,
        0.38544759154319763,
        0.22108274698257446,
        0.5306946635246277,
        -1.665693759918213,
        0.636066198348999,
        -0.282753586769104,
        0.5661043524742126,
        0.14928662776947021,
        1.0126582384109497,
        0.4954114258289337,
        0.7810986042022705,
        0.45804649591445923,
        -0.12582018971443176,
        -0.21192052960395813,
        -0.5061109662055969,
        0.7618139982223511,
        0.3879026174545288,
        0.2455592155456543,
        0.7853164672851562,
        0.8705213665962219,
        -0.21422208845615387,
        0.10478557646274567,
        -0.32328829169273376,
        1.1870073080062866,
        -1.77642023563385,
        0.3139955997467041,
        -0.12059012055397034,
        0.3158259391784668,
        0.3699902594089508,
        0.21523676812648773,
        0.2210693657398224,
        0.5706258416175842,
        0.0182521753013134,
        0.6287029981613159,
        -2.584345579147339,
        0.8302261829376221,
        -1.9616570472717285,
        0.43556246161460876,
        -0.04919416084885597,
        -3.0970025062561035,
        0.5422887802124023,
        0.6139816045761108,
        0.4180016815662384,
        0.7305768728256226,
        0.19503581523895264,
        -0.21207748353481293,
        1.4428422451019287,
        0.3410467505455017,
        -0.03452574089169502,
        0.8238893747329712,
        -0.19058793783187866,
        0.4938877820968628,
        -0.3275226652622223,
        1.2665486335754395,
        0.47210681438446045,
        0.41193869709968567,
        0.4416249990463257,
        -0.3908785581588745,
        0.20849411189556122,
        0.388797789812088,
        0.6843908429145813,
        0.3821485936641693,
        0.022261029109358788,
        0.25219908356666565,
        0.6686088442802429,
        0.48206475377082825,
        -0.2570924162864685,
        -1.2981361150741577,
        0.8992429375648499,
        0.2849969267845154,
        0.3611907660961151,
        -0.3096888065338135,
        0.2860057055950165,
        0.19599272310733795,
        0.3105621933937073,
        0.47360777854919434,
        0.37024447321891785,
        -0.17483483254909515,
        -0.5642147660255432,
        0.6431998014450073,
        0.1195879578590393,
        0.11542036384344101,
        1.061973214149475,
        1.024129033088684,
        -0.05308076739311218,
        0.40430840849876404,
        -0.8066561818122864,
        0.6411852240562439,
        -1.2622767686843872,
        0.34236422181129456,
        -0.23561105132102966,
        0.4347173571586609,
        -0.7318963408470154,
        -0.26289981603622437,
        1.2182527780532837,
        1.1006903648376465,
        0.017564838752150536,
        0.22220119833946228,
        -2.4946892261505127,
        0.7146601676940918,
        -2.539856433868408,
        0.15360119938850403,
        0.09186629951000214,
        0.4685799777507782,
        -4.917034149169922,
        -0.3148982524871826,
        0.8845428824424744,
        -4.341022491455078,
        0.895510733127594,
        -6.110641002655029,
        -3.869257926940918,
        6.987987995147705,
        0.6121556758880615,
        1.949857473373413,
        3.959010362625122,
        -3.604367971420288,
        -0.1768675446510315,
        -3.6110708713531494,
        -8.368657112121582,
        -0.670258641242981,
        2.8216567039489746,
        -3.282309055328369,
        0.9135220050811768,
        3.880704879760742,
        -5.355823040008545,
        -0.36267462372779846,
        5.369109153747559,
        -3.530540943145752,
        0.3956170976161957,
        -1.520804524421692,
        -0.07303221523761749,
        1.6848509311676025,
        -3.4666080474853516,
        1.2839710712432861,
        -8.264270782470703,
        2.5218565464019775,
        -2.1569385528564453,
        0.7008441686630249,
        -5.616024494171143,
        6.0954484939575195,
        -2.834444284439087,
        -1.4467130899429321,
        0.638702392578125,
        -6.53281307220459,
        0.7410557270050049,
        -0.23969365656375885,
        -1.7206870317459106,
        -1.930274248123169,
        6.030535697937012,
        0.10625005513429642,
        -0.9993568062782288,
        -6.6807451248168945,
        1.0495587587356567,
        6.168766021728516,
        5.534329414367676,
        1.558296799659729,
        3.189176559448242,
        0.15254391729831696,
        -6.39207649230957,
        -0.7433854341506958,
        1.544935941696167,
        -3.586247205734253,
        1.018427848815918,
        -6.330183506011963,
        0.7632518410682678,
        6.053373336791992,
        5.159776210784912,
        0.48692959547042847,
        0.7071152925491333,
        0.48973357677459717,
        0.7896695733070374,
        0.5893458127975464,
        0.4849749207496643,
        0.4975721836090088,
        0.38406309485435486,
        -0.8659816384315491,
        -0.5883082747459412,
        0.604499101638794,
        0.4707651138305664,
        0.3825356364250183,
        -0.4741407632827759,
        0.28904977440834045,
        0.39950618147850037,
        1.0142191648483276,
        0.02518884278833866,
        0.19584444165229797,
        0.1523783951997757,
        0.05853436514735222,
        0.5818467736244202,
        0.4504125714302063,
        -0.18515805900096893,
        0.7965309023857117,
        0.4696754515171051,
        0.5391430854797363,
        -0.5358031392097473,
        0.3287098705768585,
        0.7852582335472107,
        0.18483170866966248,
        1.0301045179367065,
        0.650713324546814,
        0.7925927042961121,
        0.45473670959472656,
        0.13896030187606812,
        -0.48505696654319763,
        -0.17445527017116547,
        -0.06928490847349167,
        -0.3945261240005493,
        0.8850801587104797,
        0.42067191004753113,
        0.5350532531738281,
        1.1195393800735474,
        0.417263001203537,
        -0.47082990407943726,
        0.12931028008460999,
        0.2236648052930832,
        0.5139705538749695,
        0.8942173719406128,
        -1.9148913621902466,
        -0.6464052200317383,
        -0.011100857518613338,
        0.4120202958583832,
        0.3445394039154053,
        0.8459453582763672,
        0.38428014516830444,
        0.3882039487361908,
        1.6247270107269287,
        0.2116531878709793,
        0.8127978444099426,
        0.6238179206848145,
        -0.4846711754798889,
        0.5012078881263733,
        0.3951623737812042,
        0.22713281214237213,
        0.2142316997051239,
        0.7989009022712708,
        0.21822069585323334,
        0.3341962695121765,
        -0.2388133704662323,
        1.0080952644348145,
        0.7479019165039062,
        0.009016222320497036,
        0.3981677293777466,
        0.08124974370002747,
        0.5127409100532532,
        -0.4999019503593445,
        0.9281638860702515,
        0.6839245557785034,
        0.6344015598297119,
        0.3718935251235962,
        0.4966009557247162,
        0.3373495638370514,
        0.2269158959388733,
        -0.36502283811569214,
        0.31743648648262024,
        -0.3150811493396759,
        0.5792107582092285,
        0.7124440670013428,
        1.097913146018982,
        -0.23556296527385712,
        0.7779532074928284,
        0.713884174823761,
        -0.04812414199113846,
        0.44513845443725586,
        0.3511483669281006,
        1.3377174139022827,
        0.19939815998077393,
        0.802606999874115,
        -0.48240190744400024,
        0.31215551495552063,
        -0.674748957157135,
        -0.5451720356941223,
        0.2266981452703476,
        0.12487377971410751,
        0.40772998332977295,
        0.1817604899406433,
        0.11265286803245544,
        0.2620174288749695,
        -0.43573176860809326,
        0.23806282877922058,
        0.0873456820845604,
        -0.036483410745859146,
        -1.0215510129928589,
        -0.08765728026628494,
        0.5360789895057678,
        0.4520161747932434,
        0.2559167444705963,
        0.5145329833030701,
        0.39421215653419495,
        0.403546541929245,
        1.2481913566589355,
        0.566533088684082,
        -0.037579841911792755,
        0.2774254083633423,
        0.5484387278556824,
        0.1312517374753952,
        -0.4252937138080597,
        -0.37294188141822815,
        0.4656495749950409,
        -0.2698315382003784,
        -0.008287834003567696,
        -0.1921253651380539,
        0.8466188907623291,
        -0.20161236822605133,
        0.8037154674530029,
        0.5747304558753967,
        0.0004793170664925128,
        0.22133047878742218,
        -0.5356403589248657,
        -0.6718788146972656,
        -0.22244998812675476,
        0.3547181785106659,
        0.770825982093811,
        -0.027003511786460876,
        0.7093706130981445,
        -0.5872853994369507,
        0.15346701443195343,
        -0.18241822719573975,
        -0.8429756164550781,
        0.11754068732261658,
        0.43394985795021057,
        0.1389077752828598,
        0.6649168729782104,
        -0.6016883254051208,
        -0.18109631538391113,
        0.14019329845905304,
        0.41266363859176636,
        0.4621576964855194,
        0.278626948595047,
        0.38912057876586914,
        -0.38615888357162476,
        0.6110426783561707,
        0.046835944056510925,
        0.7753815054893494,
        0.3809426426887512,
        0.6958412528038025,
        0.5481805205345154,
        -0.4881516695022583,
        0.016271676868200302,
        -0.0692843496799469,
        0.016768766567111015,
        0.43767935037612915,
        -0.668662428855896,
        -0.030343569815158844,
        0.2735669016838074,
        -0.2371741682291031,
        0.6621025800704956,
        0.9410313367843628,
        -0.12154031544923782,
        0.21055153012275696,
        -0.01309059839695692,
        0.7691600322723389,
        0.5298572182655334,
        -0.04313666746020317,
        0.20018167793750763,
        -0.4402097165584564,
        0.23324108123779297,
        0.012655745260417461,
        0.21773004531860352,
        0.4469611346721649
      ]
    },
    {
      "name": "dense_Dense1/bias_1",
      "shape": [
        64
      ],
      "dtype": "float32",
      "data": [
        0.16565674543380737,
        0.3098011612892151,
        0.2932015061378479,
        0.21057794988155365,
        0.11957445740699768,
        -0.047497525811195374,
        0.35699403285980225,
        0.5928235650062561,
        0.1287446916103363,
        -0.0278311837464571,
        0.18852762877941132,
        0.1732819676399231,
        0.21255972981452942,
        -0.02406015433371067,
        0.3277149796485901,
        0.5052719712257385,
        1.1286237239837646,
        0.16009525954723358,
        0.3240816295146942,
        0.1882457286119461,
        0.2225000262260437,
        0.23756173253059387,
        0.18790654838085175,
        0.19883184134960175,
        0.5008617639541626,
        0.19952665269374847,
        0.51384437084198,
        -0.14044727385044098,
        0.1983824074268341,
        0.3726925849914551,
        0.08142054080963135,
        0.5256701707839966,
        0.26851266622543335,
        0.5541387796401978,
        0.09663546830415726,
        0.6559190154075623,
        0.21262262761592865,
        0.254148930311203,
        0.12603259086608887,
        0.07956229895353317,
        0.5256792306900024,
        0.0960281491279602,
        0.26418930292129517,
        0.5250006914138794,
        0.23622070252895355,
        0.19631868600845337,
        -0.16262128949165344,
        0.2853933572769165,
        0.4551244378089905,
        0.07496470212936401,
        0.0391976460814476,
        0.12805427610874176,
        0.20549342036247253,
        0.20188242197036743,
        0.1097528487443924,
        0.5958428978919983,
        0.4691700041294098,
        0.23847106099128723,
        0.6510599851608276,
        0.25060251355171204,
        0.5609394907951355,
        0.32900580763816833,
        0.18071313202381134,
        0.12868015468120575
      ]
    },
    {
      "name": "dense_Dense2/kernel_1",
      "shape": [
        64,
        64
      ],
      "dtype": "float32",
      "data": [
        -0.2290756106376648,
        1.2118892669677734,
        -1.3250178098678589,
        0.5891216993331909,
        -0.85238116979599,
        -1.0404313802719116,
        0.145199254155159,
        0.001924305222928524,
        -2.0695290565490723,
        0.649918794631958,
        -0.2066287249326706,
        -2.131927967071533,
        2.3614113330841064,
        -2.6572349071502686,
        -1.8759257793426514,
        -1.607842206954956,
        0.04278501123189926,
        -2.150913953781128,
        1.880307912826538,
        -0.553493857383728,
        -2.3586831092834473,
        -2.1625545024871826,
        2.3165104389190674,
        -1.9039722681045532,
        0.534469485282898,
        0.30546921491622925,
        0.2575272023677826,
        2.670416831970215,
        2.0108048915863037,
        0.4195345640182495,
        0.7808343768119812,
        -1.5438663959503174,
        -2.014251708984375,
        0.04683712124824524,
        -2.0391242504119873,
        -0.6093404293060303,
        0.1640487015247345,
        -0.23054610192775726,
        -1.0974247455596924,
        1.4995874166488647,
        -0.2245905101299286,
        -0.07869374752044678,
        3.1483876705169678,
        -0.29183149337768555,
        -0.1009247750043869,
        0.05189346522092819,
        -2.2289702892303467,
        1.096550464630127,
        0.13735370337963104,
        0.8613650798797607,
        -1.9560282230377197,
        -0.001532102469354868,
        -0.8947595357894897,
        -2.5408244132995605,
        0.12988920509815216,
        2.0740110874176025,
        0.6145795583724976,
        0.3324357569217682,
        -1.6583900451660156,
        0.24218210577964783,
        -0.2396477907896042,
        1.2750768661499023,
        -0.6778746247291565,
        2.0899603366851807,
        0.3518310487270355,
        -1.5300952196121216,
        1.3752028942108154,
        -0.04787026345729828,
        3.2369797229766846,
        0.8263790011405945,
        0.2705651819705963,
        -0.024883341044187546,
        2.804656505584717,
        -0.10962275415658951,
        -0.07375193387269974,
        2.5268213748931885,
        -0.6445757150650024,
        3.348618268966675,
        2.8211281299591064,
        2.1671175956726074,
        0.012067423202097416,
        2.948011636734009,
        -2.0924417972564697,
        0.5486867427825928,
        2.532236099243164,
        2.940760612487793,
        -1.9688329696655273,
        2.856372117996216,
        -0.6718981862068176,
        0.14296363294124603,
        -0.07486721128225327,
        -1.0022002458572388,
        -0.22900390625,
        -0.255216121673584,
        -0.21013249456882477,
        2.7071826457977295,
        2.893979072570801,
        -0.2008594572544098,
        3.655264139175415,
        -0.518595278263092,
        -0.283139169216156,
        0.3938191533088684,
        3.18112850189209,
        -1.687243938446045,
        0.5172194242477417,
        -0.13517068326473236,
        -1.1884205341339111,
        -0.0577053427696228,
        0.023072736337780952,
        0.10740002244710922,
        2.4128916263580322,
        -1.1025919914245605,
        -0.024670004844665527,
        -0.4942725598812103,
        2.7196121215820312,
        0.18670397996902466,
        0.4121492803096771,
        3.2844398021698,
        0.19633150100708008,
        -1.253785252571106,
        -0.34500154852867126,
        -0.1644107550382614,
        3.3531301021575928,
        -0.47704949975013733,
        0.14246031641960144,
        -2.630692958831787,
        2.3513312339782715,
        -0.9677408933639526,
        -0.4457740783691406,
        0.18101902306079865,
        1.7061717510223389,
        -1.909902572631836,
        1.9940762519836426,
        2.0590765476226807,
        -0.30634617805480957,
        -1.605428695678711,
        0.1189613863825798,
        0.9809921383857727,
        -0.04798104614019394,
        -0.35948821902275085,
        -0.5762940645217896,
        -0.5186277627944946,
        1.3848470449447632,
        2.739942789077759,
        -0.06560983508825302,
        0.5015920400619507,
        0.7478419542312622,
        2.062321662902832,
        0.9740093946456909,
        0.5139233469963074,
        -0.08686809986829758,
        0.4713725447654724,
        -1.3007452487945557,
        -0.21060539782047272,
        -0.15610381960868835,
        -0.29394233226776123,
        0.2788305878639221,
        -1.5310972929000854,
        -1.4708194732666016,
        0.7533501982688904,
        1.046337366104126,
        -0.12186642736196518,
        0.49493473768234253,
        1.7115850448608398,
        1.9524370431900024,
        2.4867613315582275,
        0.20287539064884186,
        1.3140445947647095,
        -0.35189810395240784,
        0.03834586217999458,
        -0.576166033744812,
        0.026078689843416214,
        0.02134088985621929,
        -0.029623905196785927,
        2.112201452255249,
        1.0524731874465942,
        1.940896987915039,
        0.9887655973434448,
        0.238703191280365,
        -0.12846176326274872,
        -4.119377613067627,
        0.5279209613800049,
        -0.10610971599817276,
        1.1012080907821655,
        0.24421091377735138,
        -1.5314013957977295,
        -0.1391003280878067,
        -1.2261008024215698,
        2.0969579219818115,
        0.6075880527496338,
        -0.10033902525901794,
        -0.10359805822372437,
        0.8575847744941711,
        0.021167701110243797,
        -0.5270482301712036,
        -0.7261231541633606,
        0.3152310252189636,
        -0.7123265266418457,
        -0.018206454813480377,
        -0.6908556222915649,
        0.6516523361206055,
        -0.535854160785675,
        -0.25947660207748413,
        0.20061661303043365,
        0.6670913696289062,
        0.7258725166320801,
        -0.017312264069914818,
        -0.6894253492355347,
        0.045234836637973785,
        0.037934690713882446,
        -0.9148812294006348,
        -1.1153466701507568,
        -0.29737016558647156,
        0.13435058295726776,
        -0.40163594484329224,
        0.39841166138648987,
        -0.5564393997192383,
        0.10457362979650497,
        0.11280203610658646,
        -0.9842591285705566,
        1.2477141618728638,
        -0.5628435015678406,
        -0.439683735370636,
        0.22130809724330902,
        0.40530556440353394,
        -0.23247383534908295,
        1.0441944599151611,
        -1.5461372137069702,
        -1.0999362468719482,
        -1.1792978048324585,
        2.9305906295776367,
        -1.0644220113754272,
        0.9154741168022156,
        -0.1682211458683014,
        -0.9767817258834839,
        -0.25902941823005676,
        0.054091863334178925,
        -0.004045299720019102,
        -0.7062510848045349,
        -0.624340295791626,
        -0.6902841329574585,
        2.5120599269866943,
        0.22690285742282867,
        1.5284286737442017,
        0.2750421166419983,
        0.39556366205215454,
        -0.0589432530105114,
        -0.24329331517219543,
        0.7363410592079163,
        0.9171438217163086,
        0.327709823846817,
        -0.3909343183040619,
        -1.1437188386917114,
        -0.10402828454971313,
        0.13239219784736633,
        0.34444084763526917,
        0.8390100002288818,
        -0.34689247608184814,
        1.9620014429092407,
        -0.9870295524597168,
        1.949509859085083,
        1.3310914039611816,
        0.13970813155174255,
        -0.7942395210266113,
        2.0765466690063477,
        0.6706740856170654,
        -0.022952310740947723,
        0.6364631652832031,
        -1.4406657218933105,
        1.179610252380371,
        2.0995876789093018,
        2.371431827545166,
        -0.20869746804237366,
        2.184014320373535,
        0.24168339371681213,
        1.3952136039733887,
        2.224438428878784,
        1.971079707145691,
        -1.01865553855896,
        1.8949589729309082,
        -0.6172062754631042,
        -0.04219651222229004,
        -0.0388188473880291,
        -1.159763216972351,
        -0.09105277806520462,
        -1.0216162204742432,
        -0.9586816430091858,
        1.9972928762435913,
        2.2310080528259277,
        0.10502700507640839,
        1.9207868576049805,
        1.2498592138290405,
        0.6546524167060852,
        1.4894956350326538,
        1.2159883975982666,
        0.2656925916671753,
        0.7744268178939819,
        0.005869653541594744,
        -0.6003957986831665,
        0.2647835910320282,
        -0.11965581774711609,
        -0.23922358453273773,
        2.0357272624969482,
        0.5037412643432617,
        0.6882631182670593,
        -0.6030253767967224,
        1.8868486881256104,
        -1.5610864162445068,
        -0.5840943455696106,
        2.0721256732940674,
        0.19966526329517365,
        -0.09065647423267365,
        -0.0882137194275856,
        -0.83111172914505,
        1.631321668624878,
        -0.987851083278656,
        1.067153811454773,
        -0.7928548455238342,
        0.942113995552063,
        -0.4145199656486511,
        3.5524582862854004,
        3.0839784145355225,
        -1.9456861019134521,
        -1.5427465438842773,
        -2.5019490718841553,
        -1.3922165632247925,
        -0.20469129085540771,
        -0.8090921640396118,
        -1.4828099012374878,
        -1.060258388519287,
        -0.06752067804336548,
        -0.3516574800014496,
        2.516432762145996,
        -0.3778340220451355,
        -2.198458194732666,
        -2.1747288703918457,
        -0.1444598287343979,
        -2.2873566150665283,
        -0.7520795464515686,
        -2.139192819595337,
        -2.0202090740203857,
        -1.4782220125198364,
        0.3769667148590088,
        -1.8826160430908203,
        -2.029419422149658,
        -0.09979590028524399,
        0.11329575628042221,
        -2.751591444015503,
        2.534818410873413,
        -0.18253979086875916,
        -1.5535448789596558,
        -2.0795907974243164,
        -1.8426084518432617,
        -0.34140175580978394,
        -0.26743000745773315,
        -2.1862308979034424,
        -1.9063568115234375,
        -2.190912961959839,
        3.256455659866333,
        -1.69404137134552,
        3.419278621673584,
        0.16943104565143585,
        -2.9465506076812744,
        -0.09128958731889725,
        -0.278638631105423,
        0.03005986474454403,
        -3.082785129547119,
        -1.1808232069015503,
        -1.9348876476287842,
        3.6625795364379883,
        -1.7848612070083618,
        3.2308053970336914,
        2.381371021270752,
        -1.719908356666565,
        -0.36244821548461914,
        0.43765339255332947,
        3.6209239959716797,
        1.8535503149032593,
        -1.0389118194580078,
        -0.9392421841621399,
        -1.7628847360610962,
        -0.5434749126434326,
        -0.7989410758018494,
        2.684772253036499,
        -0.3533690273761749,
        -0.386889785528183,
        -0.2678864896297455,
        1.2116553783416748,
        1.3363274335861206,
        -0.193852499127388,
        -0.23195025324821472,
        1.2118170261383057,
        0.6931788325309753,
        -0.4044035077095032,
        -0.05305686965584755,
        1.6219888925552368,
        1.1041114330291748,
        1.8796087503433228,
        1.074518084526062,
        0.38334354758262634,
        -0.025876395404338837,
        1.0889902114868164,
        -1.0269845724105835,
        -0.29752814769744873,
        0.5830978155136108,
        1.2942438125610352,
        -0.6246271729469299,
        1.4601372480392456,
        1.101577877998352,
        -0.008281489834189415,
        -0.15341901779174805,
        0.9846857190132141,
        -1.057831883430481,
        1.2670764923095703,
        1.163634181022644,
        1.3841191530227661,
        1.5043795108795166,
        0.041283246129751205,
        0.9388150572776794,
        -0.40987616777420044,
        -1.1078349351882935,
        0.30977046489715576,
        -0.4794502258300781,
        -0.7580166459083557,
        -0.3193298578262329,
        0.0907001942396164,
        0.19888772070407867,
        0.08622957020998001,
        -0.3324275612831116,
        -0.04064328595995903,
        0.6984248161315918,
        -1.0030856132507324,
        -0.5884580612182617,
        0.2666471600532532,
        1.1518723964691162,
        1.2800395488739014,
        0.5788286328315735,
        0.9928849935531616,
        -0.20447155833244324,
        -0.6900164484977722,
        -0.3077913522720337,
        1.282503366470337,
        0.8377645015716553,
        1.060972809791565,
        -0.9011223912239075,
        -0.3183276653289795,
        1.497017741203308,
        -0.20341120660305023,
        0.7795394659042358,
        0.4523678123950958,
        0.20656421780586243,
        0.9723987579345703,
        1.311927080154419,
        0.2267002910375595,
        0.14495371282100677,
        0.5380196571350098,
        1.5182267427444458,
        -0.7921344041824341,
        -0.10631479322910309,
        1.5860460996627808,
        0.3467700183391571,
        1.7023580074310303,
        1.5657823085784912,
        1.2226451635360718,
        -0.05680526793003082,
        1.413948893547058,
        -0.929215133190155,
        -0.6044650673866272,
        1.2834075689315796,
        1.7637218236923218,
        -1.3716247081756592,
        1.474591851234436,
        0.6136178970336914,
        -0.21488229930400848,
        -0.39379018545150757,
        -0.6999067664146423,
        -0.14090347290039062,
        0.7530388236045837,
        0.6518524885177612,
        1.1495435237884521,
        1.5130765438079834,
        -0.32842954993247986,
        1.4705250263214111,
        -0.7506137490272522,
        -0.5304389595985413,
        0.3152819871902466,
        1.9062385559082031,
        -0.9975345134735107,
        0.7426831126213074,
        -0.16265606880187988,
        -0.2890983521938324,
        -0.25441500544548035,
        -0.2133302390575409,
        0.2858348488807678,
        1.3950165510177612,
        -0.7692034244537354,
        -0.7554764151573181,
        -0.2982819378376007,
        1.8428199291229248,
        0.6055353879928589,
        -0.09831246733665466,
        1.5387333631515503,
        0.19013889133930206,
        -0.21573346853256226,
        0.5474188327789307,
        0.725597620010376,
        1.8890442848205566,
        -0.1115487590432167,
        -0.7809864282608032,
        -1.5174113512039185,
        1.6789690256118774,
        -0.08493980765342712,
        -0.3110577464103699,
        0.7954521775245667,
        -0.21967044472694397,
        0.28439849615097046,
        -1.3296778202056885,
        0.38072142004966736,
        0.2125963568687439,
        0.9770637154579163,
        -1.8230000734329224,
        -0.387167751789093,
        -0.12176401913166046,
        -1.2309343814849854,
        1.4724435806274414,
        -1.5751386880874634,
        -1.665752649307251,
        0.15635544061660767,
        -0.275998592376709,
        -2.243713617324829,
        1.5473989248275757,
        0.18505898118019104,
        -1.1755331754684448,
        -2.2180726528167725,
        2.1908047199249268,
        -2.030163049697876,
        0.05151069164276123,
        0.06986846029758453,
        -0.7712817192077637,
        1.299625277519226,
        0.8885094523429871,
        0.9476839900016785,
        0.0616731159389019,
        -2.178226947784424,
        -1.9898779392242432,
        0.22484461963176727,
        -1.5991435050964355,
        0.3908769488334656,
        0.29577919840812683,
        0.4140559732913971,
        -0.16574330627918243,
        0.9482267498970032,
        0.021492013707756996,
        0.06455613672733307,
        0.2643376886844635,
        -0.030101776123046875,
        -0.04357406124472618,
        -0.25408366322517395,
        -0.81630539894104,
        1.038215160369873,
        0.03308727592229843,
        3.080454111099243,
        -1.7485474348068237,
        2.0803842544555664,
        1.0068989992141724,
        -2.291734457015991,
        0.19946613907814026,
        0.7105048894882202,
        0.6247333884239197,
        0.25145426392555237,
        -1.739990234375,
        0.10487587749958038,
        0.005506566725671291,
        2.4885263442993164,
        -1.57463800907135,
        0.2855098247528076,
        -0.130422905087471,
        0.3313266932964325,
        -1.8087252378463745,
        2.43213152885437,
        -0.46252769231796265,
        -1.8708603382110596,
        0.0403955839574337,
