{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 2,
                "mode": "fan_in",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 6,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense4",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        15,
        64
      ],
      "dtype": "float32",
      "data": [
        2.5406112670898438,
        1.3998080492019653,
        1.3824354410171509,
        2.746537685394287,
        0.5491437911987305,
        -9.053999900817871,
        1.6337692737579346,
        1.0055820941925049,
        0.9578884840011597,
        0.5732206702232361,
        2.147916793823242,
        2.703430652618408,
        0.5103664398193359,
        -3.097748279571533,
        -3.1348981857299805,
        0.9512514472007751,
        0.5516740679740906,
        -1.7349296808242798,
        2.0840089321136475,
        -2.121338367462158,
        -11.003387451171875,
        0.7682030200958252,
        2.4273712635040283,
        2.263735294342041,
        1.4453123807907104,
        0.6553127765655518,
        0.47297200560569763,
        2.1581027507781982,
        -10.077409744262695,
        0.5348162651062012,
        2.1677680015563965,
        0.43107789754867554,
        -12.535036087036133,
        -3.4099082946777344,
        0.6655387282371521,
        2.8151307106018066,
        0.9000633358955383,
        -0.11651287227869034,
        11.794363021850586,
        -2.176572799682617,
        0.5537472367286682,
        0.6414158940315247,
        2.6881067752838135,
        0.04089871421456337,
        0.0639725998044014,
        1.601637840270996,
        -0.44309163093566895,
        7.963484287261963,
        -0.2019481658935547,
        0.29243528842926025,
        0.012784318067133427,
        8.431180000305176,
        3.015669822692871,
        0.590367317199707,
        0.3789139688014984,
        1.3943367004394531,
        0.6947555541992188,
        3.745512008666992,
        -1.8723950386047363,
        0.4933631718158722,
        0.050887975841760635,
        0.2912846803665161,
        0.8986147046089172,
        0.37771615386009216,
        2.19112491607666,
        0.5250804424285889,
        2.4302122592926025,
        1.9770346879959106,
        0.3714183270931244,
        -5.648203372955322,
        2.0638351440429688,
        1.5290539264678955,
        0.5966145992279053,
        0.07094906270503998,
        2.8836333751678467,
        1.757603645324707,
        0.4991249144077301,
        -1.5939152240753174,
        -0.9062484502792358,
        1.199301838874817,
        1.2366211414337158,
        -0.9138917922973633,
        1.7752517461776733,
        -1.7187080383300781,
        -11.620099067687988,
        0.9666116237640381,
        1.6957417726516724,
        2.883471965789795,
        1.4560916423797607,
        1.4358068704605103,
        0.5724653601646423,
        2.010141611099243,
        -10.38176155090332,
        0.6635773777961731,
        1.7000576257705688,
        0.06702978163957596,
        -11.381271362304688,
        2.582752227783203,
        1.2239989042282104,
        1.8783140182495117,
        0.39040127396583557,
        0.9819108247756958,
        8.838967323303223,
        -2.155932903289795,
        0.8689975738525391,
        1.227389931678772,
        1.9397408962249756,
        0.7584737539291382,
        1.6806217432022095,
        1.586080551147461,
        1.4756371974945068,
        6.940349102020264,
        0.9331362247467041,
        1.7505981922149658,
        -0.4463963806629181,
        6.4026360511779785,
        2.159762144088745,
        1.0198111534118652,
        1.401667833328247,
        -1.608622431755066,
        1.2940089702606201,
        1.5439177751541138,
        0.970463752746582,
        0.6743413209915161,
        0.46364110708236694,
        -0.31714513897895813,
        0.8148809671401978,
        0.7894790172576904,
        -1.5580400228500366,
        8.72566032409668,
        7.533031940460205,
        -2.342834234237671,
        -1.2141337394714355,
        -9.330777168273926,
        5.320888519287109,
        6.092791557312012,
        -1.2013540267944336,
        1.3791619539260864,
        6.277261734008789,
        6.8649582862854,
        3.3964858055114746,
        0.5265817642211914,
        2.279135227203369,
        1.9387164115905762,
        6.550949573516846,
        3.359410285949707,
        4.382009029388428,
        0.9410806894302368,
        -12.718966484069824,
        1.0153720378875732,
        -1.189405918121338,
        6.353935241699219,
        -1.15627920627594,
        7.006262302398682,
        -1.5817444324493408,
        5.107247829437256,
        -11.478659629821777,
        2.77905535697937,
        -1.3677490949630737,
        2.556084156036377,
        -13.308250427246094,
        4.803340435028076,
        3.04532790184021,
        -2.1621999740600586,
        1.1884689331054688,
        4.201476573944092,
        9.577340126037598,
        0.04601873457431793,
        3.4916794300079346,
        3.2939651012420654,
        -2.15822172164917,
        4.37018346786499,
        1.6886147260665894,
        1.2107138633728027,
        -1.1355780363082886,
        10.228909492492676,
        4.988410472869873,
        5.997417449951172,
        0.0656253769993782,
        2.2586004734039307,
        6.8541998863220215,
        4.431413650512695,
        2.9087719917297363,
        -0.06873101741075516,
        0.13968496024608612,
        3.179049491882324,
        0.3591443598270416,
        -1.281797170639038,
        -1.4135050773620605,
        0.006160150282084942,
        2.7849602699279785,
        3.154207706451416,
        -1.2852821350097656,
        7.747307777404785,
        7.202301979064941,
        -2.1351356506347656,
        -1.4239853620529175,
        -11.949614524841309,
        5.406522750854492,
        6.08510684967041,
        -1.1853971481323242,
        2.8396248817443848,
        5.962430000305176,
        6.198012351989746,
        2.82171893119812,
        0.8630352020263672,
        2.5589916706085205,
        2.240948438644409,
        6.651283264160156,
        3.577695846557617,
        4.275306701660156,
        1.161321997642517,
        -15.125456809997559,
        1.3634347915649414,
        -0.43398651480674744,
        6.728198528289795,
        -1.9086600542068481,
        7.073514461517334,
        -1.719772458076477,
        5.237367630004883,
        -13.561957359313965,
        2.4251585006713867,
        -1.1145492792129517,
        1.6690447330474854,
        -16.16242218017578,
        5.013280391693115,
        3.4101080894470215,
        -2.0011966228485107,
        1.4648500680923462,
        3.6297199726104736,
        9.93242359161377,
        1.253305435180664,
        3.413405179977417,
        2.9477603435516357,
        -1.832417368888855,
        4.179190635681152,
        1.7376385927200317,
        1.6050529479980469,
        -1.109204888343811,
        10.689620971679688,
        4.352513313293457,
        5.923369407653809,
        0.2049880176782608,
        2.964425802230835,
        7.382199764251709,
        3.924272298812866,
        2.503333330154419,
        0.06524301320314407,
        1.1557426452636719,
        2.875753879547119,
        -0.4250054657459259,
        -1.3509743213653564,
        -1.4851566553115845,
        0.29345789551734924,
        2.916187286376953,
        3.011150360107422,
        -0.12561675906181335,
        7.997853755950928,
        5.933728218078613,
        -0.837797999382019,
        -0.2399297058582306,
        -8.753349304199219,
        3.735795259475708,
        4.622247219085693,
        -0.07519987225532532,
        2.636314630508423,
        5.1368865966796875,
        3.585298538208008,
        3.0133371353149414,
        0.7624739408493042,
        1.977994680404663,
        1.4095818996429443,
        5.0777907371521,
        3.692974328994751,
        5.007477760314941,
        0.939361572265625,
        -18.520116806030273,
        1.1737219095230103,
        0.17128415405750275,
        4.927023887634277,
        0.07105898857116699,
        5.4973859786987305,
        -0.8578486442565918,
        3.957331657409668,
        -13.84676456451416,
        1.3672003746032715,
        -0.36574462056159973,
        2.017915964126587,
        -19.964927673339844,
        3.795565128326416,
        1.4949826002120972,
        -0.21937987208366394,
        -0.024369435384869576,
        3.4394054412841797,
        12.530543327331543,
        1.3896534442901611,
        3.7699592113494873,
        1.7778650522232056,
        -0.4053307771682739,
        3.273132562637329,
        1.0974751710891724,
        2.1804628372192383,
        0.29961761832237244,
        11.877612113952637,
        3.2239789962768555,
        5.140894412994385,
        -0.5983402132987976,
        5.31648063659668,
        5.972499847412109,
        3.704835891723633,
        1.5166341066360474,
        0.7519887685775757,
        1.084824800491333,
        0.800911009311676,
        0.05463658273220062,
        -0.3790566325187683,
        -0.636027455329895,
        0.30146169662475586,
        1.768828272819519,
        3.1064908504486084,
        1.3112730979919434,
        3.5284128189086914,
        -6.957736015319824,
        11.442316055297852,
        24.465251922607422,
        4.6216721534729,
        -21.040245056152344,
        -21.311180114746094,
        24.927379608154297,
        14.867152214050293,
        -20.08720588684082,
        -14.676403045654297,
        18.930585861206055,
        1.2477009296417236,
        17.249391555786133,
        -22.551307678222656,
        5.00670862197876,
        17.82244110107422,
        24.20965576171875,
        -2.6547691822052,
        3.1749749183654785,
        -20.450105667114258,
        -6.649801254272461,
        -19.602760314941406,
        -0.023796409368515015,
        -9.619494438171387,
        24.875911712646484,
        -22.031497955322266,
        3.3577587604522705,
        -23.335100173950195,
        -5.901735305786133,
        22.745250701904297,
        3.1762502193450928,
        7.037265300750732,
        -22.632579803466797,
        13.494808197021484,
        -18.363893508911133,
        14.237380981445312,
        22.01099967956543,
        -2.806278705596924,
        21.76521110534668,
        -22.721994400024414,
        3.183102607727051,
        11.46856689453125,
        -19.140113830566406,
        22.826086044311523,
        23.099721908569336,
        27.288448333740234,
        7.031581878662109,
        4.305320739746094,
        -0.046486690640449524,
        25.18732261657715,
        -17.762351989746094,
        12.741680145263672,
        -23.13227081298828,
        23.472410202026367,
        -12.872843742370605,
        -13.805561065673828,
        8.568633079528809,
        24.670307159423828,
        24.646026611328125,
        0.11569858342409134,
        -23.735538482666016,
        17.931434631347656,
        2.7369918823242188,
        3.089036464691162,
        2.1370420455932617,
        2.842552423477173,
        -0.5696232318878174,
        -3.6725046634674072,
        2.8836216926574707,
        2.5156872272491455,
        -0.6403416991233826,
        0.13395950198173523,
        2.3217856884002686,
        3.7124617099761963,
        -0.25253230333328247,
        -4.3102335929870605,
        -0.45546337962150574,
        1.7032915353775024,
        0.4471941292285919,
        -1.1525410413742065,
        2.883273124694824,
        -4.507293224334717,
        -3.2991678714752197,
        1.8483357429504395,
        2.833526372909546,
        3.7370054721832275,
        1.852961778640747,
        0.9729341268539429,
        -0.48904868960380554,
        2.8234658241271973,
        -4.009033679962158,
        1.6810730695724487,
        2.0873847007751465,
        -0.27019429206848145,
        -2.8538694381713867,
        -1.8237231969833374,
        1.5685349702835083,
        2.492135524749756,
        2.569905996322632,
        -0.1279640942811966,
        12.948103904724121,
        -2.159818410873413,
        1.600156545639038,
        1.6121824979782104,
        2.5124831199645996,
        0.043620515614748,
        1.8018709421157837,
        -1.3691496849060059,
        -0.5200194716453552,
        7.593725204467773,
        -0.5143792033195496,
        0.2608010768890381,
        -0.3609347641468048,
        7.483491897583008,
        2.9826462268829346,
        0.046743351966142654,
        2.005693197250366,
        -0.4486110806465149,
        1.3538827896118164,
        4.735244274139404,
        -2.403855800628662,
        0.07382595539093018,
        -0.14772960543632507,
        -0.026590153574943542,
        1.4188395738601685,
        0.12008507549762726,
        1.348861575126648,
        5.434200763702393,
        3.6321020126342773,
        1.3760725259780884,
        -0.4421237111091614,
        -1.3794138431549072,
        2.8902838230133057,
        2.907264471054077,
        -0.7137778401374817,
        1.0596389770507812,
        2.7525575160980225,
        4.0649213790893555,
        0.7413507103919983,
        -4.1651716232299805,
        0.9927293658256531,
        1.4384346008300781,
        2.286524534225464,
        0.5417042374610901,
        3.204671859741211,
        -4.8180975914001465,
        -0.671766996383667,
        1.240666389465332,
        1.8123465776443481,
        3.5432252883911133,
        0.802790105342865,
        2.654536247253418,
        -0.4319038391113281,
        3.115992546081543,
        -1.115002155303955,
        1.2546216249465942,
        1.5689259767532349,
        0.13658663630485535,
        -0.5560543537139893,
        0.39861342310905457,
        1.6889787912368774,
        1.1308233737945557,
        1.7075382471084595,
        1.0266691446304321,
        10.319403648376465,
        -2.8606455326080322,
        2.210038185119629,
        1.9078799486160278,
        1.1160513162612915,
        1.1444787979125977,
        1.2854948043823242,
        -0.6558871865272522,
        -0.5402907133102417,
        7.3500590324401855,
        1.2262921333312988,
        1.7890347242355347,
        -0.07721202820539474,
        6.5410966873168945,
        3.9541385173797607,
        1.8282514810562134,
        1.252524733543396,
        -0.1687132567167282,
        0.5561447739601135,
        3.9586257934570312,
        -2.250657081604004,
        -0.3766895532608032,
        -0.3640785813331604,
        -0.2542533278465271,
        1.6816211938858032,
        1.8719482421875,
        -0.8238991498947144,
        7.529241561889648,
        7.603732585906982,
        -0.8478914499282837,
        -0.8827399015426636,
        0.3037978410720825,
        4.222201824188232,
        5.112821578979492,
        -0.9615833759307861,
        2.6764979362487793,
        4.305735111236572,
        5.959902763366699,
        2.6984283924102783,
        -5.137633800506592,
        3.4107086658477783,
        1.4269108772277832,
        6.283837795257568,
        3.0626778602600098,
        5.03495454788208,
        -5.160818099975586,
        0.706920862197876,
        0.802331805229187,
        -0.04575430974364281,
        5.152716636657715,
        -0.6938301920890808,
        6.487300872802734,
        -1.028183102607727,
        4.006288528442383,
        0.5324556827545166,
        1.5411181449890137,
        -0.506567120552063,
        1.3060191869735718,
        0.8365193605422974,
        4.727238655090332,
        2.330700159072876,
        -1.0881143808364868,
        1.1768461465835571,
        3.2749202251434326,
        10.230960845947266,
        -2.955012559890747,
        3.524961471557617,
        2.184828519821167,
        -0.7063284516334534,
        4.1100873947143555,
        1.0235521793365479,
        0.0683474987745285,
        -0.6188774108886719,
        9.295039176940918,
        4.273915767669678,
        5.712047100067139,
        0.021769285202026367,
        4.985086917877197,
        5.6847639083862305,
        4.181289196014404,
        1.8731811046600342,
        -0.15375916659832,
        -0.8213523030281067,
        3.515430450439453,
        -3.2523441314697266,
        -0.780899167060852,
        -0.8543202877044678,
        0.2014136016368866,
        2.1925723552703857,
        3.4575209617614746,
        -0.6755856871604919,
        8.086523056030273,
        7.032354831695557,
        -0.8144852519035339,
        -0.8103827238082886,
        0.5260379910469055,
        4.503358840942383,
        5.06926155090332,
        -0.8291816711425781,
        2.9342093467712402,
        4.939504146575928,
        4.982205390930176,
        3.6426644325256348,
        -4.757663249969482,
        3.570028305053711,
        1.2559394836425781,
        5.677646160125732,
        2.6265032291412354,
        5.217724323272705,
        -7.1089630126953125,
        0.7277815937995911,
        0.7079096436500549,
        0.08987448364496231,
        5.102940559387207,
        -0.9192157983779907,
        6.682907581329346,
        -0.8646636605262756,
        4.082315921783447,
        0.5963082313537598,
        1.8226045370101929,
        -0.731242835521698,
        1.1035947799682617,
        0.8204812407493591,
        4.62868595123291,
        2.260406017303467,
        -0.875391960144043,
        0.924362063407898,
        3.8261899948120117,
        10.369131088256836,
        -3.652859687805176,
        4.640026569366455,
        1.9505141973495483,
        -0.7747101187705994,
        4.5865797996521,
        0.8078774809837341,
        -0.21830905973911285,
        -0.5099082589149475,
        9.403815269470215,
        4.178231239318848,
        5.445256233215332,
        0.2648559808731079,
        4.373266696929932,
        6.280459403991699,
        4.274592399597168,
        1.6491928100585938,
        0.19226610660552979,
        -0.1834494173526764,
        2.2278318405151367,
        -4.0219550132751465,
        -0.5377050042152405,
        -0.7560203075408936,
        -0.4917711913585663,
        2.09779953956604,
        3.626156806945801,
        2.345574140548706,
        2.760545253753662,
        3.6652917861938477,
        2.0904717445373535,
        -0.1346474587917328,
        -0.1878226101398468,
        2.8262276649475098,
        2.7973878383636475,
        -0.21958406269550323,
        0.6520223021507263,
        3.1255710124969482,
        3.188913583755493,
        0.4709949493408203,
        -3.500835418701172,
        1.0613861083984375,
        1.3612101078033447,
        1.8573799133300781,
        1.1065177917480469,
        3.8915436267852783,
        -4.5005340576171875,
        0.5480749011039734,
        1.1412200927734375,
        2.308581829071045,
        4.096000671386719,
        2.0111758708953857,
        2.4783425331115723,
        -0.24772842228412628,
        3.1071507930755615,
        0.16816961765289307,
        1.2702254056930542,
        1.7672805786132812,
        0.6910585761070251,
        0.6282885074615479,
        0.5910329222679138,
        1.5181448459625244,
        2.3313958644866943,
        1.7397249937057495,
        0.9874292016029358,
        11.93474292755127,
        -3.176079750061035,
        2.4267184734344482,
        1.3887802362442017,
        2.1737427711486816,
        0.7727609276771545,
        0.957638680934906,
        0.010619483888149261,
        -0.023209692910313606,
        8.275700569152832,
        0.7525952458381653,
        1.526430368423462,
        -0.2595820128917694,
        6.103074550628662,
        3.8230998516082764,
        1.5327228307724,
        1.458907127380371,
        0.025255566462874413,
        0.9628645181655884,
        2.8748981952667236,
        -1.347233533859253,
        0.07349336892366409,
        0.19150860607624054,
        0.2676103413105011,
        1.6910905838012695,
        0.956096351146698,
        30.70180892944336,
        -15.243265151977539,
        -25.461212158203125,
        29.93039321899414,
        0.06521657854318619,
        5.261539459228516,
        -7.980435848236084,
        -9.963997840881348,
        0.24986481666564941,
        -22.57486343383789,
        -7.1514573097229,
        -15.20182991027832,
        -23.357690811157227,
        6.3596510887146,
        -21.542463302612305,
        10.186249732971191,
        -27.84678077697754,
        -22.2619571685791,
        -13.246305465698242,
        -2.2793185710906982,
        6.652795791625977,
        17.73497200012207,
        28.320632934570312,
        -4.385543346405029,
        30.164878845214844,
        -27.576095581054688,
        5.862720012664795,
        -2.358625888824463,
        6.245848178863525,
        6.539694309234619,
        29.429990768432617,
        -14.225951194763184,
        7.0269975662231445,
        -20.234464645385742,
        4.674222946166992,
        28.819684982299805,
        18.961462020874023,
        -27.269107818603516,
        24.89460563659668,
        -1.4488499164581299,
        -19.76136589050293,
        2.067838430404663,
        30.25063133239746,
        -28.664995193481445,
        12.862259864807129,
        -8.472769737243652,
        -0.846085250377655,
        1.1396013498306274,
        -30.847192764282227,
        -29.617385864257812,
        -0.0630965381860733,
        20.437496185302734,
        -11.50289535522461,
        -27.797876358032227,
        5.327681064605713,
        -4.801204204559326,
        24.259157180786133,
        1.712005853652954,
        12.162511825561523,
        1.6739797592163086,
        1.234475016593933,
        -0.06362682580947876,
        0.9934269785881042,
        -25.23169708251953,
        -4.6474928855896,
        7.549917221069336,
        7.257327079772949,
        -3.2543745040893555,
        -1.797075629234314,
        1.944411039352417,
        4.701170921325684,
        5.701765060424805,
        -1.744604229927063,
        4.132283687591553,
        6.16520881652832,
        -0.38414379954338074,
        3.940448045730591,
        2.3086202144622803,
        3.0317981243133545,
        2.0560903549194336,
        5.925558090209961,
        2.7996087074279785,
        3.3602423667907715,
        2.097669839859009,
        2.515735149383545,
        0.9230467081069946,
        -4.825137138366699,
        6.415789604187012,
        -3.6526596546173096,
        7.402421474456787,
        -1.7602852582931519,
        4.992995738983154,
        2.5868518352508545,
        2.613609790802002,
        -4.32280158996582,
        1.6430456638336182,
        2.687324285507202,
        3.4944026470184326,
        2.8416693210601807,
        -2.9355318546295166,
        1.0579172372817993,
        3.7381796836853027,
        3.630720853805542,
        2.211759090423584,
        2.9537112712860107,
        2.8444879055023193,
        -3.4303171634674072,
        4.5404205322265625,
        1.6191318035125732,
        1.5466850996017456,
        -1.7186546325683594,
        5.28478479385376,
        4.988141059875488,
        6.188120365142822,
        -0.2136363536119461,
        0.8811430931091309,
        7.328906536102295,
        4.3860907554626465,
        2.5503487586975098,
        -0.0038413808215409517,
        0.06585297733545303,
        -3.3000171184539795,
        1.0968729257583618,
        -1.6765297651290894,
        -1.6013014316558838,
        -0.4099656045436859,
        2.89223051071167,
        3.1175537109375,
        -3.510974884033203,
        7.575947284698486,
        6.39402961730957,
        -1.886749505996704,
        -0.8140339255332947,
        0.8839144706726074,
        5.597460746765137,
        5.2827630043029785,
        -1.2569916248321533,
        3.577129602432251,
        5.951613903045654,
        -2.739722967147827,
        3.5258705615997314,
        2.073655843734741,
        2.522477388381958,
        1.9310944080352783,
        6.450236797332764,
        2.8510212898254395,
        3.049581289291382,
        2.9036765098571777,
        0.9258107542991638,
        1.5706228017807007,
        -2.9272022247314453,
        5.959068298339844,
        -2.13533353805542,
        7.41115665435791,
        -0.9954137206077576,
        4.757136821746826,
        0.842833399772644,
        2.119616985321045,
        -2.8727846145629883,
        1.4131548404693604,
        0.905182957649231,
        2.787660598754883,
        3.266033411026001,
        -2.01440167427063,
        0.705597460269928,
        4.2665934562683105,
        3.7528460025787354,
        2.1778087615966797,
        3.0632643699645996,
        2.498140335083008,
        -3.1113741397857666,
        4.619651794433594,
        1.899068832397461,
        1.9691517353057861,
        -0.9911041259765625,
        6.437012195587158,
        4.67476224899292,
        5.510037899017334,
        -0.44613412022590637,
        1.370806097984314,
        6.0855712890625,
        4.194250106811523,
        2.316211700439453,
        0.027865244075655937,
        0.22557394206523895,
        -6.3863525390625,
        0.5486904382705688,
        -0.9303794503211975,
        -1.2507975101470947,
        -0.6319712996482849,
        2.9121222496032715,
        3.3412928581237793,
        2.041354179382324,
        7.251049041748047,
        5.856741428375244,
        2.1459450721740723,
        1.2585034370422363,
        -1.8489066362380981,
        3.1338279247283936,
        3.8996684551239014,
        0.9899389147758484,
        1.6316274404525757,
        4.041142463684082,
        5.255272388458252,
        3.5540640354156494,
        -1.6841471195220947,
        1.8136136531829834,
        0.9607812762260437,
        3.8355555534362793,
        1.658078670501709,
        6.3859968185424805,
        -1.5005818605422974,
        -1.6019701957702637,
        1.674041748046875,
        1.525957465171814,
        4.6064887046813965,
        1.712291955947876,
        4.418033123016357,
        1.4353440999984741,
        3.525057554244995,
        -2.093977689743042,
        1.1826162338256836,
        2.0017611980438232,
        2.300292730331421,
        -1.8237782716751099,
        2.1455492973327637,
        1.3582247495651245,
        2.0415806770324707,
        1.1173927783966064,
        2.565791368484497,
        15.841644287109375,
        -1.9045987129211426,
        4.620636940002441,
        0.43965649604797363,
        2.1963648796081543,
        2.3803956508636475,
        0.9567834138870239,
        2.605375051498413,
        0.7655209302902222,
        13.062956809997559,
        2.425143003463745,
        3.505873441696167,
        -0.17272315919399261,
        8.987030982971191,
        5.687750816345215,
        2.9850099086761475,
        0.8981135487556458,
        1.0676915645599365,
        1.2147663831710815,
        3.40203857421875,
        0.4016417860984802,
        0.8802472949028015,
        1.168458104133606,
        -0.5475237369537354,
        1.1049996614456177,
        2.8261148929595947
      ]
    },
    {
      "name": "dense_Dense1/bias",
      "shape": [
        64
      ],
      "dtype": "float32",
      "data": [
        0.09314972162246704,
        8.1378755569458,
        6.740415573120117,
        0.6091050505638123,
        -0.08125779777765274,
        0.7463515996932983,
        4.454668998718262,
        4.862623691558838,
        0.06845162063837051,
        3.112295389175415,
        5.463018417358398,
        4.284571647644043,
        3.59446120262146,
        1.4262796640396118,
        2.9131994247436523,
        1.6267462968826294,
        5.266481876373291,
        2.6328158378601074,
        5.330860137939453,
        1.2887450456619263,
        0.8728510141372681,
        1.2282490730285645,
        -0.07371968030929565,
        5.5976715087890625,
        0.23773115873336792,
        6.0138936042785645,
        0.06696287542581558,
        4.355492115020752,
        0.7887592315673828,
        1.8749688863754272,
        -0.03583173081278801,
        2.197117567062378,
        0.9492350220680237,
        3.2022135257720947,
        2.132230281829834,
        0.6324806809425354,
        1.3100428581237793,
        3.5199060440063477,
        11.800354957580566,
        1.3827052116394043,
        4.132047176361084,
        1.9641237258911133,
        0.22953973710536957,
        3.726191997528076,
        1.4808324575424194,
        2.3605268001556396,
        0.03730461373925209,
        10.747654914855957,
        3.834078550338745,
        4.886238098144531,
        -0.07801653444766998,
        5.79869270324707,
        6.3172526359558105,
        3.9979944229125977,
        1.8199753761291504,
        0.8488208651542664,
        1.0085201263427734,
        2.0726099014282227,
        0.7607837915420532,
        -0.049372609704732895,
        0.04522576555609703,
        -0.030172348022460938,
        2.1587235927581787,
        3.430128335952759
      ]
    },
    {
      "name": "dense_Dense2/kernel",
      "shape": [
        64,
        64
      ],
      "dtype": "float32",
      "data": [
        -7.488068580627441,
        -4.585095405578613,
        -1.4390578269958496,
        -6.473816394805908,
        -5.015642166137695,
        2.5504941940307617,
        18.66787338256836,
        5.8035054206848145,
        11.0118989944458,
        -17.312664031982422,
        -14.634018898010254,
        -4.444314956665039,
        -5.281534671783447,
        20.84514617919922,
        -16.947999954223633,
        -3.322009563446045,
        -17.253087997436523,
        17.936176300048828,
        -15.221463203430176,
        -17.506826400756836,
        -16.87189292907715,
        0.19670036435127258,
        -2.079744338989258,
        -10.906990051269531,
        -4.589245319366455,
        19.1297664642334,
        -5.583878040313721,
        14.68375015258789,
        2.8598060607910156,
        -5.642939567565918,
        -16.74163055419922,
        4.1492133140563965,
        -5.265693664550781,
        1.2579174041748047,
        -0.1614810973405838,
        20.84798240661621,
        19.86360740661621,
        -16.056848526000977,
        -17.930400848388672,
        14.777087211608887,
        -5.189981460571289,
        -5.8564958572387695,
        -0.27207568287849426,
        -3.5831830501556396,
        8.897073745727539,
        13.37379264831543,
        -1.8645522594451904,
        -4.041682243347168,
        -5.094005107879639,
        18.189882278442383,
        18.660341262817383,
        -3.901689052581787,
        -16.553281784057617,
        21.560365676879883,
        6.866679668426514,
        -17.662199020385742,
        18.83171272277832,
        5.321035385131836,
        1.1237586736679077,
        -8.616593360900879,
        -17.90549087524414,
        13.92953109741211,
        -3.321078062057495,
        -5.282027721405029,
        11.060887336730957,
        1.7129930257797241,
        0.39251619577407837,
        11.887811660766602,
        1.8992137908935547,
        1.1466180086135864,
        0.884100079536438,
        3.1618826389312744,
        1.3065569400787354,
        4.716092586517334,
        4.897758483886719,
        0.17474479973316193,
        1.6912941932678223,
        0.27565255761146545,
        4.434372425079346,
        0.5424396991729736,
        4.661418437957764,
        1.9982250928878784,
        4.566667556762695,
        5.120789527893066,
        4.950608730316162,
        -0.06954572349786758,
        14.549455642700195,
        6.920309066772461,
        1.623810887336731,
        -1.1954652070999146,
        1.8078746795654297,
        0.6350517868995667,
        0.6437709927558899,
        1.6593068838119507,
        6.5304646492004395,
        1.391001582145691,
        1.7189791202545166,
        5.822605609893799,
        -0.18748067319393158,
        0.9915302991867065,
        -0.6680920720100403,
        7.340437412261963,
        2.268644332885742,
        -0.22828984260559082,
        1.939207673072815,
        1.5237822532653809,
        -0.15918110311031342,
        12.982989311218262,
        9.455087661743164,
        0.8594671487808228,
        11.02481460571289,
        0.3643316626548767,
        2.5198652744293213,
        -1.0377527475357056,
        0.9169129133224487,
        1.7939101457595825,
        4.625615119934082,
        1.1990635395050049,
        0.6004787683486938,
        6.12941837310791,
        0.19198061525821686,
        0.048735328018665314,
        13.264664649963379,
        10.460687637329102,
        4.887697219848633,
        -0.6661356687545776,
        12.12170696258545,
        1.7463486194610596,
        11.702813148498535,
        0.5682191848754883,
        2.1215951442718506,
        12.316812515258789,
        3.1881606578826904,
        -1.690846562385559,
        -1.7468180656433105,
        3.4176673889160156,
        2.067791700363159,
        7.202272415161133,
        5.971102237701416,
        0.3269643783569336,
        3.6016502380371094,
        -1.231225609779358,
        6.512355327606201,
        0.557849645614624,
        6.784046173095703,
        -1.0689301490783691,
        6.238265514373779,
        6.791780471801758,
        6.449465274810791,
        0.29159659147262573,
        16.79884147644043,
        8.420146942138672,
        0.8862391710281372,
        -1.0383718013763428,
        3.526473045349121,
        -0.3206028342247009,
        -0.369621604681015,
        3.2288548946380615,
        7.46072244644165,
        0.29620182514190674,
        3.54471755027771,
        7.409684658050537,
        -0.11107876896858215,
        -2.663010597229004,
        -1.138077735900879,
        9.936599731445312,
        4.360578536987305,
        -4.992524147033691,
        3.406816005706787,
        3.709188222885132,
        -0.02061137743294239,
        14.072809219360352,
        14.143583297729492,
        1.1974767446517944,
        14.159153938293457,
        0.4446346163749695,
        3.5333492755889893,
        -1.3517663478851318,
        -2.026198625564575,
        0.9794111251831055,
        6.781080722808838,
        -1.8949875831604004,
        -0.4283772110939026,
        9.07414436340332,
        -1.3766025304794312,
        -0.5353266596794128,
        17.534582138061523,
        8.183005332946777,
        7.351443290710449,
        -5.787208080291748,
        9.406571388244629,
        3.3816919326782227,
        -4.63515043258667,
        0.5365123748779297,
        4.060652256011963,
        -4.738901615142822,
        -9.432148933410645,
        2.6467485427856445,
        16.787757873535156,
        0.6494673490524292,
        7.404754638671875,
        -13.736231803894043,
        -11.114891052246094,
        -0.5473840236663818,
        -9.961337089538574,
        19.188335418701172,
        -13.54407787322998,
        0.44729968905448914,
        -13.669661521911621,
        13.860200881958008,
        -11.287019729614258,
        -14.088064193725586,
        -13.824686050415039,
        -0.13639895617961884,
        -1.6448842287063599,
        -6.886662006378174,
        0.05335918813943863,
        17.618989944458008,
        -9.88466739654541,
        11.238293647766113,
        5.797460556030273,
        -10.27428150177002,
        -14.032638549804688,
        7.905330181121826,
        -10.279817581176758,
        -3.1743721961975098,
        -0.08865165710449219,
        18.123327255249023,
        18.400205612182617,
        -12.668464660644531,
        -20.192506790161133,
        14.616838455200195,
        -9.971763610839844,
        -10.833996772766113,
        -0.1375424712896347,
        -1.5723546743392944,
        5.330915451049805,
        10.204503059387207,
        1.4283883571624756,
        0.35509470105171204,
        -10.006854057312012,
        16.719457626342773,
        16.51742935180664,
        0.47836101055145264,
        -12.816984176635742,
        18.549406051635742,
        5.768279552459717,
        -15.551472663879395,
        17.416948318481445,
        9.30783748626709,
        0.5014945268630981,
        -5.275665760040283,
        -14.604842185974121,
        13.837756156921387,
        0.08515417575836182,
        -10.053455352783203,
        15.57337760925293,
        10.226827621459961,
        23.16256332397461,
        12.864105224609375,
        -20.019248962402344,
        -5.022000789642334,
        0.39074334502220154,
        -15.394508361816406,
        -12.465027809143066,
        8.723862648010254,
        12.038989067077637,
        11.358214378356934,
        -19.732749938964844,
        2.200953245162964,
        9.334754943847656,
        11.9277925491333,
        8.878693580627441,
        -4.2946624755859375,
        11.730457305908203,
        8.320999145507812,
        9.087906837463379,
        -0.006238196510821581,
        -0.1842908263206482,
        17.109130859375,
        10.24515151977539,
        -0.47753000259399414,
        -19.71120834350586,
        -6.944433689117432,
        16.25176239013672,
        -19.75204086303711,
        9.552702903747559,
        16.907581329345703,
        -19.48658561706543,
        -18.21172523498535,
        0.07295408099889755,
        0.5152672529220581,
        0.6757760047912598,
        10.374999046325684,
        -19.639055252075195,
        10.920680046081543,
        -19.41290855407715,
        -19.81966781616211,
        -0.16411885619163513,
        13.69759750366211,
        -5.155190944671631,
        -10.565677642822266,
        18.286405563354492,
        11.858393669128418,
        -20.8443546295166,
        -0.6624248623847961,
        -0.8105576038360596,
        9.739540100097656,
        10.86956787109375,
        0.41628792881965637,
        -7.478636741638184,
        7.2091875076293945,
        -0.6627934575080872,
        23.06292152404785,
        0.942706286907196,
        18.022619247436523,
        8.535550117492676,
        11.04173755645752,
        20.065183639526367,
        -19.606346130371094,
        -4.633045196533203,
        9.36994743347168,
        6.948326110839844,
        -5.148160934448242,
        -6.906628608703613,
        12.525138854980469,
        -2.1137278079986572,
        -6.557259559631348,
        -7.358879566192627,
        0.36542654037475586,
        -0.03321452811360359,
        3.4564428329467773,
        -5.94949197769165,
        1.5793945789337158,
        -0.00873732939362526,
        3.810962438583374,
        0.5133948922157288,
        -3.672715425491333,
        0.4487132728099823,
        0.28676995635032654,
        1.3110620975494385,
        0.12999844551086426,
        -8.962295532226562,
        -0.23891624808311462,
        8.312851905822754,
        0.08991912752389908,
        -6.391329765319824,
        -3.7861380577087402,
        3.709052562713623,
        -6.456403732299805,
        -0.9700408577919006,
        9.314080238342285,
        -6.493227958679199,
        -7.404196262359619,
        0.15401172637939453,
        -3.110860586166382,
        -3.8498306274414062,
        -0.6761662364006042,
        -1.5807316303253174,
        -1.0913994312286377,
        -6.468130588531494,
        -6.4651198387146,
        0.2254713922739029,
        -6.778197288513184,
        -6.325533390045166,
        -1.468887448310852,
        -5.938145637512207,
        3.3767507076263428,
        -6.033601760864258,
        -2.173689126968384,
        -3.225388765335083,
        9.48843765258789,
        0.8461604714393616,
        0.6494682431221008,
        9.45938777923584,
        -1.1392697095870972,
        -0.4879644513130188,
        1.1653780937194824,
        -7.684604644775391,
        -2.9883906841278076,
        0.4726739227771759,
        2.4469449520111084,
        -5.546306610107422,
        -6.454654693603516,
        8.817242622375488,
        -1.7293797731399536,
        -2.585102081298828,
        9.826676368713379,
        7.333680629730225,
        0.05435657128691673,
        0.5693314075469971,
        8.404651641845703,
        5.282330513000488,
        3.767245292663574,
        2.5262176990509033,
        -1.7778066396713257,
        7.6096601486206055,
        0.1132427528500557,
        3.449430465698242,
        -1.612342357635498,
        3.7905139923095703,
        1.8946189880371094,
        2.857450008392334,
        3.8724958896636963,
        3.155583143234253,
        -0.02080032229423523,
        16.72142791748047,
        4.6430182456970215,
        -2.109591007232666,
        1.035979151725769,
        7.699832916259766,
        3.2373881340026855,
        -2.5190985202789307,
        7.638465881347656,
        4.657681465148926,
        -3.7894036769866943,
        7.870217323303223,
        12.020172119140625,
        -0.20171092450618744,
        -0.0781843438744545,
        0.7177284955978394,
        6.928983211517334,
        5.966728687286377,
        -10.227489471435547,
        7.633255958557129,
        7.890240669250488,
        -0.1969234198331833,
        11.505904197692871,
        15.441737174987793,
        3.7318761348724365,
        11.028993606567383,
        -1.9088687896728516,
        6.90928316116333,
        1.050005555152893,
        0.6669082641601562,
        -1.958566427230835,
        3.6342082023620605,
        -0.013443885371088982,
        1.1629786491394043,
        6.520468235015869,
        0.9596784710884094,
        -5.993042469024658,
        17.09504508972168,
        5.510657787322998,
        4.544789791107178,
        -9.2915620803833,
        6.971812725067139,
        7.627450466156006,
        9.622211456298828,
        -1.609115481376648,
        -2.140578269958496,
        10.635967254638672,
        7.05873966217041,
        0.24026237428188324,
        0.18086110055446625,
        8.342549324035645,
        4.952660083770752,
        4.48099946975708,
        2.7875115871429443,
        -1.8354237079620361,
        7.086287021636963,
        0.01611565425992012,
        4.06503438949585,
        -1.5336774587631226,
        4.11024284362793,
        2.008315324783325,
        3.064244031906128,
        4.258537292480469,
        3.9343926906585693,
        0.08668658882379532,
        16.701372146606445,
        4.841612815856934,
        -1.4320166110992432,
        0.45565322041511536,
        7.422430515289307,
        2.0986452102661133,
        -2.179375410079956,
        6.844186305999756,
        5.418509006500244,
        -3.4562854766845703,
        7.09963846206665,
        11.457091331481934,
        -0.07617608457803726,
        0.36348581314086914,
        0.28378191590309143,
        7.365798473358154,
        5.73590087890625,
        -9.909417152404785,
        6.905527591705322,
        7.293939590454102,
        0.12531235814094543,
        12.161523818969727,
        15.53878402709961,
        3.5002336502075195,
        11.03272819519043,
        -1.5181158781051636,
        6.233599662780762,
        0.2855168282985687,
        0.7060765624046326,
        -1.3512012958526611,
        3.8384506702423096,
        0.7118578553199768,
        0.5950823426246643,
        7.171997547149658,
        0.39474260807037354,
        -5.135132312774658,
        17.062026977539062,
        5.847274303436279,
        4.9181318283081055,
        -9.437870025634766,
        7.037546634674072,
        7.173674583435059,
        16.058101654052734,
        10.802266120910645,
        24.917009353637695,
        12.681672096252441,
        -22.077869415283203,
        -4.236783981323242,
        0.17146094143390656,
        -17.292879104614258,
        -14.874171257019043,
        8.9932279586792,
        13.59278392791748,
        12.658821105957031,
        -21.856298446655273,
        2.3021750450134277,
        9.424046516418457,
        12.776243209838867,
        9.241191864013672,
        -4.709242820739746,
        12.396313667297363,
        8.855775833129883,
        9.747941970825195,
        -0.057325560599565506,
        -1.7452768087387085,
        18.50687026977539,
        11.641521453857422,
        -0.9534013867378235,
        -22.333051681518555,
        -7.911749839782715,
        17.551992416381836,
        -22.14909553527832,
        10.488139152526855,
        17.479703903198242,
        -21.919307708740234,
        -20.268230438232422,
        -0.07925323396921158,
        0.3093767464160919,
        0.2559160590171814,
        10.816025733947754,
        -20.666257858276367,
        11.274381637573242,
        -21.784034729003906,
        -22.14596939086914,
        -0.12364014983177185,
        13.634424209594727,
        -7.380066394805908,
        -13.38818645477295,
        18.34197235107422,
        12.761032104492188,
        -22.076725006103516,
        -1.0800814628601074,
        -1.7380249500274658,
        10.842599868774414,
        11.672725677490234,
        0.19555829465389252,
        -8.095877647399902,
        7.279158592224121,
        -1.3723169565200806,
        25.36427879333496,
        -0.3790647089481354,
        19.234092712402344,
        8.780220031738281,
        11.97156810760498,
        21.344594955444336,
        -21.99285888671875,
        14.684187889099121,
        3.9580955505371094,
        7.5068464279174805,
        14.337958335876465,
        -1.4073320627212524,
        1.156003713607788,
        -5.133155345916748,
        -2.4222664833068848,
        -5.590934753417969,
        10.643807411193848,
        10.262574195861816,
        3.780179262161255,
        -1.2549949884414673,
        -5.004899501800537,
        10.143417358398438,
        3.9654061794281006,
        10.635810852050781,
        -5.1136674880981445,
        10.201315879821777,
        10.4924955368042,
        9.970073699951172,
        -0.0535934641957283,
        15.200531959533691,
        11.943441390991211,
        4.056066036224365,
        -5.1423444747924805,
        -0.7658971548080444,
        -3.8684444427490234,
        3.5452282428741455,
        -0.9911028742790222,
        10.988308906555176,
        4.607437610626221,
        -0.7952829599380493,
        2.395141839981079,
        -0.11698168516159058,
        -6.661739826202393,
        -7.649965286254883,
        12.948442459106445,
        2.217458963394165,
        -3.1283698081970215,
        -0.8133885860443115,
        -0.8053576946258545,
